{
    "event_id": "048",
    "claim": "The UK NCSC and Microsoft warned that Russia-linked threat actor Callisto Group is targeting organizations worldwide.",
    "original_label": "true",
    "label": "true",
    "explain": "The UK National Cyber Security Centre (NCSC) and Microsoft reported that the Russia-linked APT group Callisto Group is targeting organizations worldwide. The nation-state actor is carrying out spear-phishing attacks for cyberespionage purposes. The Callisto APT group (aka “Seaborgium“, “Star Blizzard”, “ColdRiver”, “TA446”) targeted government officials, military personnel, journalists and think tanks since at least 2015.In the past, the group’s activity involved persistent phishing and credential theft campaigns leading to intrusions and data theft. The APT primarily targets NATO countries, but experts also observed campaigns targeting the Baltics, Nordics, and Eastern Europe regions, including Ukraine. This week, the Reddit security team attributed the leak of US-UK trade documents through its platform to a coordinated information campaign linked to Russia. “We were recently made aware of a post on Reddit that included leaked documents from the UK,” the statement said. “We investigated this account and the accounts connected to it, and today we believe this was part of a campaign that has been reported as originating from Russia.” “Earlier this year Facebook discovered a Russian campaign on its platform, which was further analyzed by the Atlantic Council and dubbed ‘Secondary Infektion,’” Reddit’s announcement said. “Suspect accounts on Reddit were recently reported to us, along with indicators from law enforcement, and we were able to confirm that they did indeed show a pattern of coordination.” According to a press release published by the UK government, the UK and its allies observed a series of attempts by the Russian Intelligence Services to target high-profile individuals and entities through cyber operations. The nation-state actor aimed at obtaining information to interfere in UK politics and democratic processes. The UK Government linked the activity to Centre 18, a unit within Russia’s Intelligence Services FSB tracked as Star Blizzard. “While some attacks resulted in documents being leaked, attempts to interfere with UK politics and democracy have not been successful.” reads the press release. ” The group has also selectively leaked and amplified the release of information in line with Russian confrontation goals, including to undermine trust in politics in the UK and likeminded states.” The UK believes that the FSB coordinated at least the following activities: Cyber attacks against parliamentarians from multiple political parties since at least 2015. The theft of UK-US trade documents leaked before the 2019 General Election. The leak was previously attributed to the Russian state via a Written Ministerial Statement in 2020. The 2018 hack of the Institute for Statecraft, a UK think tank engaged in initiatives to safeguard democracy against disinformation. The state-sponsored hackers gained access to the account of its founder Christopher Donnelly from December 2021. Attacks against universities, journalists, the public sector, non-governmental organizations, and other civil society organizations, many of which play a crucial role in UK democracy. The National Crime Agency investigation identifies two members of Star Blizzard and the UK and US governments sanctioned them. The two individuals are: Ruslan Aleksandrovich PERETYATKO, who is a Russian FSB intelligence officer and a member of Star Blizzard AKA the Callisto Group Andrey Stanislavovich KORINETS, AKA Alexey DOGUZHIEV, who is a member of Star Blizzard AKA the Callisto Group “The Foreign, Commonwealth and Development Office has also summoned the Russian Ambassador to express the UK’s deep concern about Russia’s sustained attempts to use cyber to interfere in political and democratic processes in the UK and beyond.” concludes the press release. The Microsoft Threat Intelligence team also provided technical details about Star Blizzard tactics, techniques, and procedures (TTPs). The operations of Star Blizzard continue to concentrate on the theft of email credentials, with a primary emphasis on targeting cloud-based email providers hosting both organizational and personal email accounts.Microsoft has identified five new Callisto Group (Star Blizzard) evasive techniques: Use of server-side scripts to prevent automated scanning of actor-controlled infrastructure. Use of email marketing platform services to hide true email sender addresses and obviate the need for including actor-controlled domain infrastructure in email messages Use of a DNS provider to obscure the IP addresses of actor-controlled virtual private server (VPS) infrastructure. Once notified, the DNS provider took action to mitigate actor-controlled domains abusing their service. Password-protected PDF lures or links to cloud-based file-sharing platforms where PDF lures are hosted Shifting to a more randomized domain generation algorithm (DGA) for actor-registered domains.\n\n\n",
    "reports": [
        {
            "link": "https://www.securityweek.com/us-uk-announce-charges-and-sanctions-against-two-russian-hackers/",
            "content": "Although it was not publicly attributed to any Russian intelligence service, past Calisto operations showed objectives and victimology that align closely with Russian strategic interests. Based on the fact that Calisto was observed targeting Russian individuals abroad, SEKOIA.IO assess it is plausible that Calisto conducts domestic surveillance as well. Calisto (aka Callisto, COLDRIVER) is suspected to be a Russian-nexus intrusion set active since at least April 2017. Despite the absence of technical evidence associating Calisto activities with a known Russian cyber offensive service, Sekoia.io assess that this intrusion set intelligence collection activities targeting parties involved in Ukraine support, especially those in the tactical equipment logistics, probably contribute to Russian efforts to disrupt Kiev supply-chain for military reinforcements. The group was observed carrying out phishing campaigns aiming at credential theft, targeting military and strategic research sectors such as NATO entities and a Ukraine-based defense contractor, as well as NGOs and think tanks. While Security Service of Ukraine (SBU) publicly associated Calisto with Gamaredon Group, an intrusion set attributed to the Russian Federal Security Service (FSB) that focuses essentially on Ukraine operations since the beginning of the Russian invasion in February 2022, this link is not supported by other security companies or researchers.",
            "domain": "www.securityweek.com",
            "tokenized": [
                {
                    "sent": "Although it was not publicly attributed to any Russian intelligence service, past Calisto operations showed objectives and victimology that align closely with Russian strategic interests.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Based on the fact that Calisto was observed targeting Russian individuals abroad, SEKOIA.IO assess it is plausible that Calisto conducts domestic surveillance as well.",
                    "is_evidence": 0
                },
                {
                    "sent": "Calisto (aka Callisto, COLDRIVER) is suspected to be a Russian-nexus intrusion set active since at least April 2017.",
                    "is_evidence": 0
                },
                {
                    "sent": "Despite the absence of technical evidence associating Calisto activities with a known Russian cyber offensive service, Sekoia.io assess that this intrusion set intelligence collection activities targeting parties involved in Ukraine support, especially those in the tactical equipment logistics, probably contribute to Russian efforts to disrupt Kiev supply-chain for military reinforcements.",
                    "is_evidence": 0
                },
                {
                    "sent": "The group was observed carrying out phishing campaigns aiming at credential theft, targeting military and strategic research sectors such as NATO entities and a Ukraine-based defense contractor, as well as NGOs and think tanks.",
                    "is_evidence": 0
                },
                {
                    "sent": "While Security Service of Ukraine (SBU) publicly associated Calisto with Gamaredon Group, an intrusion set attributed to the Russian Federal Security Service (FSB) that focuses essentially on Ukraine operations since the beginning of the Russian invasion in February 2022, this link is not supported by other security companies or researchers.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://securelist.com/calisto-trojan-for-macos/86543/",
            "content": "But at the time of our research, the server was no longer responding to requests and seemed to be disabled:Static analysis of Calisto revealed unfinished and unused additional functionality: Loading/unloading of kernel extensions for handling USB devices Data theft from user directories Self-destruction together with the OS。Conceptually, the Calisto backdoor resembles a member of the Backdoor. Calisto’s activity can be investigated using its child processes log and decompiled code:We can see that the Trojan uses a hidden directory named .calisto to store: Keychain storage data Data extracted from the user login/password window Information about the network connection Data from Google Chrome: history, bookmarks, cookies Recall that Keychain stores passwords/tokens saved by the user, including ones saved in Safari. OSX.Proton, this Trojan is able to steal a great amount of personal data from the user system, including the contents of Keychain Recall that all known members of the Proton malware family were distributed and discovered in 2017. So we decided to unpick Calisto to see what it is and why its development was stopped (or was it?).We have no reliable information about how the backdoor was distributed. The malware was uploaded to VirusTotal way back in 2016, most likely the same year it was created. The text differs slightly from the Intego’s one — perhaps the cybercriminals took it from an earlier version of the product.",
            "domain": "securelist.com",
            "tokenized": [
                {
                    "sent": "But at the time of our research, the server was no longer responding to requests and seemed to be disabled:Static analysis of Calisto revealed unfinished and unused additional functionality: Loading/unloading of kernel extensions for handling USB devices Data theft from user directories Self-destruction together with the OS。Conceptually, the Calisto backdoor resembles a member of the Backdoor.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Calisto’s activity can be investigated using its child processes log and decompiled code:We can see that the Trojan uses a hidden directory named .calisto to store: Keychain storage data Data extracted from the user login/password window Information about the network connection Data from Google Chrome: history, bookmarks, cookies Recall that Keychain stores passwords/tokens saved by the user, including ones saved in Safari.",
                    "is_evidence": 0
                },
                {
                    "sent": "OSX.Proton, this Trojan is able to steal a great amount of personal data from the user system, including the contents of Keychain Recall that all known members of the Proton malware family were distributed and discovered in 2017.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "So we decided to unpick Calisto to see what it is and why its development was stopped (or was it?).We have no reliable information about how the backdoor was distributed.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The malware was uploaded to VirusTotal way back in 2016, most likely the same year it was created.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The text differs slightly from the Intego’s one — perhaps the cybercriminals took it from an earlier version of the product.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.bbc.com/news/technology-39588703/",
            "content": "For further information on the terms used in this document, please refer to the Security Response glossary. Isolate compromised computers quickly to prevent threats from spreading further. Next, the Trojan uninstalls the DMG component on the compromised computer. OSX.Calisto is a Trojan horse that opens a backdoor on the compromised computer. Perform a forensic analysis and restore the computers using trusted media. These services are avenues of attack.",
            "domain": "www.bbc.com",
            "tokenized": [
                {
                    "sent": "For further information on the terms used in this document, please refer to the Security Response glossary.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Isolate compromised computers quickly to prevent threats from spreading further.",
                    "is_evidence": 0
                },
                {
                    "sent": "Next, the Trojan uninstalls the DMG component on the compromised computer.",
                    "is_evidence": 0
                },
                {
                    "sent": "OSX.Calisto is a Trojan horse that opens a backdoor on the compromised computer.",
                    "is_evidence": 0
                },
                {
                    "sent": "Perform a forensic analysis and restore the computers using trusted media.",
                    "is_evidence": 0
                },
                {
                    "sent": "These services are avenues of attack.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.securityweek.com/calisto-macos-backdoor-remained-undetected-two-years/",
            "content": "A comparison with the legitimate application shows that the threat looks fairly convincing, being likely to trick users, especially those who haven’t encountered the application before. Dubbed Calisto, the malware was first uploaded to VirusTotal in 2016, likely the same year it was created, but it remained undetected by anti-virus solutions until May 2018, Kaspersky’s security researchers say. It was being advertised as “a professional FUD surveillance and control solution” that could provide complete remote control of infected machines and could steal anything from credit card information to keystrokes and screenshots. Some of Calisto characteristics, Kaspersky says, would bring the malware close to the Backdoor. The Trojan uses a hidden directory named .calisto to store keychain storage data, data extracted from the user login/password window, network connection information, and Google Chrome data (history, bookmarks, and cookies). The threat poses as a well-known antivirus (Proton was disguising as a Symantec product), its code contains the line “com.proton.calisto.plist,” and can steal a lot of personal data from the system, including the contents of Keychain.",
            "domain": "www.securityweek.com",
            "tokenized": [
                {
                    "sent": "A comparison with the legitimate application shows that the threat looks fairly convincing, being likely to trick users, especially those who haven’t encountered the application before.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Dubbed Calisto, the malware was first uploaded to VirusTotal in 2016, likely the same year it was created, but it remained undetected by anti-virus solutions until May 2018, Kaspersky’s security researchers say.",
                    "is_evidence": 0
                },
                {
                    "sent": "It was being advertised as “a professional FUD surveillance and control solution” that could provide complete remote control of infected machines and could steal anything from credit card information to keystrokes and screenshots.",
                    "is_evidence": 0
                },
                {
                    "sent": "Some of Calisto characteristics, Kaspersky says, would bring the malware close to the Backdoor.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Trojan uses a hidden directory named .calisto to store keychain storage data, data extracted from the user login/password window, network connection information, and Google Chrome data (history, bookmarks, and cookies).",
                    "is_evidence": 0
                },
                {
                    "sent": "The threat poses as a well-known antivirus (Proton was disguising as a Symantec product), its code contains the line “com.proton.calisto.plist,” and can steal a lot of personal data from the system, including the contents of Keychain.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}