{
    "event_id": "068",
    "claim": "A computer exploit, or exploit, is an attack on a computer system, especially one that takes advantage of a particular vulnerability the system offers to intruders. Used as a verb, exploit refers to the act of successfully making such an attack.",
    "original_label": "true",
    "label": "true",
    "explain": "A computer exploit, or exploit, is an attack on a computer system, especially one that takes advantage of a particular vulnerability the system offers to intruders. Used as a verb, exploit refers to the act of successfully making such an attack. An exploit takes advantage of a weakness in an operating system, application or any other software code, including application plug-ins or software libraries. The owners of the code typically issue a fix, or patch, in response. Users of the system or application are responsible for obtaining the patch, which can usually be downloaded from the software developer on the web, or it may be downloaded automatically by the operating system or application that needs it. Failure to install a patch for a given problem exposes the user to a computer exploit and the possibility of a security breach.Security exploits come in all shapes and sizes, but some techniques are used more often than others. Some of the most common web-based security vulnerabilities include SQL injection attacks, cross-site scripting and cross-site request forgery, as well as abuse of broken authentication code or security misconfigurations. Computer exploits can be categorized in several different ways, depending on how the exploits work and what type of attacks they are able to accomplish. The most familiar type of exploit is the zero-day exploit, which takes advantage of a zero-day vulnerability. A zero-day vulnerability occurs when a piece of software -- usually an application or an operating system -- contains a critical security vulnerability of which the vendor is unaware. The vulnerability only becomes known when a hacker is detected exploiting the vulnerability, hence the term zero-day exploit. Once such an exploit occurs, systems running the software are left vulnerable to an attack until the vendor releases a patch to correct the vulnerability and the patch is applied to the software.Computer exploits can be characterized by the expected result of the attack, such as denial of service, remote code execution, privilege escalation, malware delivery or other malicious goals. Computer exploits may also be characterized by the type of vulnerability being exploited, including buffer overflow exploits, code injection or other types of input validation vulnerabilities and side-channel attacks.Although exploits can occur in a variety of ways, one common method is for exploits to be launched from malicious websites. The victim might visit such a site by accident, or they might be tricked into clicking on a link to the malicious site within a phishing email or a malicious advertisement. Malicious websites used for computer exploits may be equipped with exploit packs, software toolkits that include malicious software that can be used to unleash attacks against various browser vulnerabilities from a malicious website, or from a website that has been hacked. Such attacks usually target software coded in Java, unpatched browsers or browser plug-ins, and they are commonly used to deploy malware onto the victim's computer. Automated exploits, such as those launched by malicious websites, are often composed of two main components: the exploit code and the shell code. The exploit code is the software that attempts to exploit a known vulnerability. The shell code is the payload of the exploit -- software designed to run once the target system has been breached. The shell code gets its name from the fact that some of these payloads open a command shell that can be used to run commands against the target system; however, not all shell code actually opens a command shell.In recent years, many high-profile exploits have been used to commit massive data breaches and malware attacks. In 2016, for example, Yahoo announced a hack that had occurred years earlier had caused the data of 1 billion users to be leaked. The attackers gained access to users' email accounts because the passwords were protected by MD5, which is a weak and outdated hashing algorithm. One of the most well-known exploits in recent years is EternalBlue, which attacks a patched flaw in the Windows Server Message Block protocol. The exploit, which has been attributed to the National Security Agency, was made public by the Shadow Brokers group this year and later used by threat actors in the WannaCry and NotPetya ransomware attacks. Most recently, credit-reporting firm Equifax suffered a massive data breach after attackers exploited a critical vulnerability in the Apache Struts framework, which was used in one of the company's web applications. A patch was released earlier this year for the critical flaw, which was being exploited in the wild, but Equifax did not update its web app until after the attackers were detected.\n\n\n",
    "reports": [
        {
            "link": "https://www.trendmicro.com/vinfo/us/security/definition/exploit/",
            "content": "An exploit is a code that takes advantage of a software vulnerability or security flaw. Based on popular usage of exploit terms, an exploit is referred to as a zero-day exploit when it is used to attack a vulnerability that has been identified but not yet patched, also known as a zero-day vulnerability. Exploits are often incorporated into malware, allowing them to propagate and run intricate routines on vulnerable computers. In some cases, an exploit can be used as part of a multi-component attack. Related terms:Exploit kit, zero-day exploit, cookies, hacking, vulnerability, virtual patching, SQL injection, cross-side scripting, Internet of Things. When used, exploits allow an intruder to remotely access a network and gain elevated privileges, or move deeper into the network.",
            "domain": "www.trendmicro.com",
            "tokenized": [
                {
                    "sent": "An exploit is a code that takes advantage of a software vulnerability or security flaw.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Based on popular usage of exploit terms, an exploit is referred to as a zero-day exploit when it is used to attack a vulnerability that has been identified but not yet patched, also known as a zero-day vulnerability.",
                    "is_evidence": 0
                },
                {
                    "sent": "Exploits are often incorporated into malware, allowing them to propagate and run intricate routines on vulnerable computers.",
                    "is_evidence": 0
                },
                {
                    "sent": "In some cases, an exploit can be used as part of a multi-component attack.",
                    "is_evidence": 0
                },
                {
                    "sent": "Related terms:Exploit kit, zero-day exploit, cookies, hacking, vulnerability, virtual patching, SQL injection, cross-side scripting, Internet of Things",
                    "is_evidence": 0
                },
                {
                    "sent": "When used, exploits allow an intruder to remotely access a network and gain elevated privileges, or move deeper into the network.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.malwarebytes.com/exploits/",
            "content": "A computer exploit is a type of malware that takes advantage of bugs or vulnerabilities, which cybercriminals use to gain illicit access to a system. Commonly exploited software includes the operating system itself, browsers, Microsoft Office, and third-party applications. Exploit attacks often start with malspam and drive-by downloads.Here’s a quick rundown of some of the more notable computer exploits. Sometimes exploits are packaged up by cybercriminal groups into what’s called an exploit kit. That’s because every piece of software you own and will ever own in your life will have vulnerabilities cybercriminals can find and take advantage of—in other words, “exploit.”",
            "domain": "www.malwarebytes.com",
            "tokenized": [
                {
                    "sent": "A computer exploit is a type of malware that takes advantage of bugs or vulnerabilities, which cybercriminals use to gain illicit access to a system.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Commonly exploited software includes the operating system itself, browsers, Microsoft Office, and third-party applications.",
                    "is_evidence": 0
                },
                {
                    "sent": "Exploit attacks often start with malspam and drive-by downloads.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Here’s a quick rundown of some of the more notable computer exploits.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Sometimes exploits are packaged up by cybercriminal groups into what’s called an exploit kit.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "That’s because every piece of software you own and will ever own in your life will have vulnerabilities cybercriminals can find and take advantage of—in other words, “exploit.”",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.fortinet.com/resources/cyberglossary/exploit/",
            "content": "For several years, Kaspersky Lab’s Global Research and Analysis Team (GReAT) has been closely monitoring more than 60 advanced threat actors responsible for cyber-attacks worldwide. However, only now Kaspersky Lab’s experts can confirm they have discovered a threat actor that surpasses anything known in terms of complexity and sophistication of techniques, and that has been active for almost two decades – The Equation Group. Kaspersky Lab observed seven exploits used by the Equation group in their malware. Since 2001, the Equation group has been busy infecting thousands, or perhaps even tens of thousands of victims in more than 30 countries worldwide, covering the following sectors: Government and diplomatic institutions, Telecommunications, Aerospace, Energy, Nuclear research, Oil and Gas, Military, Nanotechnology, Islamic activists and scholars, Mass media, Transportation, Financial institutions and companies developing encryption technologies. The Equation group uses a vast C&C infrastructure that includes more than 300 domains and more than 100 servers. This is perhaps the most powerful tool in the Equation group’s arsenal and the first known malware capable of infecting the hard drives.",
            "domain": "www.fortinet.com",
            "tokenized": [
                {
                    "sent": "An exploit (in its noun form) is a segment of code or a program that maliciously takes advantage of vulnerabilities or security flaws in software or hardware to infiltrate and initiate a denial-of-service (DoS) attack or install malware, such as spyware, ransomware, Trojan horses, worms, or viruses.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Exploit kits silently and automatically seek to exploit any vulnerabilities identified on a user’s machine when they are web browsing.",
                    "is_evidence": 0
                },
                {
                    "sent": "Remote exploits are run on an external computer, via an intranet or other network, exploiting a security vulnerability without prior access to the system.",
                    "is_evidence": 0
                },
                {
                    "sent": "Some attacks that may be part of an exploit can be domain hijacking, DoS and distributed denial-of-service (DDoS) attacks, and malware.",
                    "is_evidence": 0
                },
                {
                    "sent": "Some of the common exploit methods include memory safety violations, input validation errors, side-channel attacks, and privilege confusion bugs.",
                    "is_evidence": 0
                },
                {
                    "sent": "These bugs can create a vulnerability in the system, and an exploit searches out such vulnerabilities and looks for a way to exploit databases and networks or systems.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.rapid7.com/fundamentals/vulnerabilities-exploits-threats/",
            "content": "A Security Vulnerability is a weakness, flaw, or error found within a security system that has the potential to be leveraged by a threat agent in order to compromise a secure network. Exploits are the means through which a vulnerability can be leveraged for malicious activity by hackers; these include pieces of software, sequences of commands, or even open-source exploit kits. SQL Injection: As one of the most prevalent security vulnerabilities, SQL injections attempt to gain access to database content via malicious code injection. There are a number of Security Vulnerabilities, but some common examples are: Broken Authentication: When authentication credentials are compromised, user sessions and identities can be hijacked by malicious actors to pose as the original user. Three of the most common terms thrown around when discussing cyber risks are vulnerabilities, exploits, and threats. Vulnerabilities can be leveraged to force software to act in ways it’s not intended to, such as gleaning information about the current security defenses in place.",
            "domain": "www.securityweek.com",
            "tokenized": [
                {
                    "sent": "A Security Vulnerability is a weakness, flaw, or error found within a security system that has the potential to be leveraged by a threat agent in order to compromise a secure network.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Exploits are the means through which a vulnerability can be leveraged for malicious activity by hackers; these include pieces of software, sequences of commands, or even open-source exploit kits.",
                    "is_evidence": 0
                },
                {
                    "sent": "SQL Injection: As one of the most prevalent security vulnerabilities, SQL injections attempt to gain access to database content via malicious code injection.",
                    "is_evidence": 0
                },
                {
                    "sent": "There are a number of Security Vulnerabilities, but some common examples are: Broken Authentication: When authentication credentials are compromised, user sessions and identities can be hijacked by malicious actors to pose as the original user.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Three of the most common terms thrown around when discussing cyber risks are vulnerabilities, exploits, and threats.",
                    "is_evidence": 0
                },
                {
                    "sent": "Vulnerabilities can be leveraged to force software to act in ways it’s not intended to, such as gleaning information about the current security defenses in place.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}