{
    "event_id": "112",
    "claim": "The entire campaign of HpReact highly coincides with the timeline of Venezuelan political turmoil.",
    "original_label": "true",
    "label": "true",
    "explain": "Learn more about 360 Total Security In June 2020, 360 Security Center discovered a new backdoor Pyark written in Python by the fileless attack protection function. Through in-depth excavation and trace analysis of the backdoor, we discovered a series of advanced threat actions that have been active since 2019. By invading various military institutions in Venezuela, the attackers deployed backdoor to continuously monitor and steal the latest military secrets. We named it APT-C-43 based on 360’s way of naming the APT organization When tracing the attacker’s source, we found that the duration of this attack coincided with the Venezuelan political chaos, and the network assets used by the attackers were mostly deployed in Colombia, and some assets were frequently found in Venezuela and Colombia. After the United Venezuelan coup, the reactionary government headed by Juan Gerardo Guaidó Márquez fled to Colombia to seek military assistance. We guess the political background of APT-C -43’s campaign may be to help the reactionaries led by Juan steal military secrets of the Venezuelan military and provide intelligence support for the confrontation between the reactionary government and the current Venezuelan government. Therefore, we named this series of attacks HpReact. In the process of tracing the source, the campaign was linked to the APT group Machete, and Machete can be traced back to 2010. The organization is an APT organization with Spanish roots. Its targets are military, embassies and government agencies in Latin America. the Lord. Obviously, the HpReact campaign is only a small part of the organization’s cyber warfare in Latin America. The picture below shows the decoy document used by APT-C-43 in this campaign. The content of the document is a policy issued by the Venezuelan authorities to prevent deserters from going to Colombia to support the reactionary government. More about this policy. For details, please refer to Appendix 1. It can be seen that the attackers have a good understanding of Venezuela’s current politics, military, etc., and are good at using such sensitive files to make decoy documents, which are highly targeted and inductive.The APT-C-43 organization is good at launching attacks using phishing emails, and deploys the backdoor program Pyark (Machete) written in python after invading the victim’s machine. The network communication mainly relies on FTP and HTTP protocols.After successfully infiltrating the target machine, APT-C-43 organization monitors the target users, steal sensitive data, etc. The complete process of infecting the target machine is as follows: The decoy document carries malicious macrocode. Download the next stage of malicious component NisSrv.bat through FTP protocol, and we can see many variables named after Spanish vocabulary in the code, such as servidor (server), Usuario (user name), Contraseña (password), etc.:The file of “setupXOX.msi” is a Windows Installer installation program made by MSI Wrapper to deploy the final backdoor components. When we studied the historical samples of the Machete organization, we found that the organization’s technology for deploying backdoor has undergone an important change, with a clear time division. Through the following timeline, we can clearly see that the organization is constantly changing and innovating its own Attack technique:After the program runs, the Fpyark backdoor components will be released to the %ProgramData%\\USOEnable directory. The backdoor of Fpyark is writing by python. During the running process, python is required to execute the environment and various dependent libraries required by the script, which also caused the size of setupXOX.msi to reach 8.10M. After installation, the entire directory structure is as follows: After deploying the above backdoor components, run svchostt.exe according to the msiwpper configuration file:The file of “setupXOX.msi” is a virus releaser written in Microsoft Visual Basic language, which releases NisSrv.bat registered scheduled tasks to realize self-starting and staying. The program has the following vbp compilation path: UpdateSession is the main control module of the backdoor. Its functions include self-starting of the backdoor, collection of network configuration, keystroke records, and schedule other modules to execute by means of timers:UpdateService traverses the disk directory and collects more than ten kinds of sensitive files with suffixes such as doc, xlsx, and pdf in other directories, except for some system directories and security software directories.The entire campaign of HpReact highly coincides with the timeline of Venezuelan political turmoil. APT-C-43 took Venezuelan military agencies as the main targets and carried out surveillance and stealing activities for about two years, forming a significant impact on Venezuela’s national security. Great safety hazard. In recent years, with the intensification of cyber warfare in various countries, cyberspace security has become another important area for each country to maintain national security, and building a strong cybersecurity has become a top priority for each country. At present, 360 Total Security has supported the detection of attacks on this organization.360 Baize Lab (formerly 360 FirstAid team): Focusing on BOOTKIT/ROOTKIT Trojan analysis and traceability, it was the first to discover the world’s first UEFI Trojan Spy Shadow（UEFI⽊马谍影），boot area Trojan Hidden Soul（引导区⽊马隐魂），dual guns（双枪,）and multiple large-scale dark brush botnets, such as black fog and diaster. Now it is renamed 360 Baize Lab based on the original business, it is involved in APT testing and research. The laboratory provides core safety data for 360 Security Guards, 360 FirstAid team and other products, as well as stubborn Trojan detection and killing solutions, while providing 360 Security Center Technical Support.\n\n\n",
    "reports": [
        {
            "link": "https://www.welivesecurity.com/2019/08/05/sharpening-machete-cyberespionage/",
            "content": "For a detailed analysis of the backdoor, refer to our white paper Machete just got sharper: Venezuelan military under attack. More than half of the compromised computers were in the Venezuelan military forces, whereas the others were related to education, police, and foreign affairs sectors. The distribution of this malware in these countries is shown in Figure 1.Machete’s operators use effective spearphishing techniques. The group behind these attacks has stolen gigabytes of confidential documents, mostly from military organizations. Their long run of attacks, focused on Latin American countries, has allowed them to collect intelligence and refine their tactics over the years. This extends to other countries in Latin America, with the Ecuadorean military being another organization highly targeted with the Machete malware.",
            "domain": "www.welivesecurity.com",
            "tokenized": [
                {
                    "sent": "For a detailed analysis of the backdoor, refer to our white paper Machete just got sharper: Venezuelan military under attack.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "More than half of the compromised computers were in the Venezuelan military forces, whereas the others were related to education, police, and foreign affairs sectors.",
                    "is_evidence": 0
                },
                {
                    "sent": "The distribution of this malware in these countries is shown in Figure 1.Machete’s operators use effective spearphishing techniques.",
                    "is_evidence": 0
                },
                {
                    "sent": "The group behind these attacks has stolen gigabytes of confidential documents, mostly from military organizations.",
                    "is_evidence": 0
                },
                {
                    "sent": "Their long run of attacks, focused on Latin American countries, has allowed them to collect intelligence and refine their tactics over the years.",
                    "is_evidence": 0
                },
                {
                    "sent": "This extends to other countries in Latin America, with the Ecuadorean military being another organization highly targeted with the Machete malware.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://brandefense.io/blog/apt-groups/el-machete-apt-group/",
            "content": "Attacks affecting many countries, especially Latin America, are carried out against high-profile organizations such as government agencies, law enforcement, telecommunications, and energy companies. The countries where the cyber espionage group operates, which generally targets Latin American countries with effective spearphishing techniques, are as follows. The group, which frequently uses social engineering techniques such as including malware-laden documents and links in fake e-mails, is known to conduct extensive intelligence work on the target before carrying out the attack. The themes of the forged documents, which were mostly found to have been seized from previous attacks and repurposed for targeted phishing attacks, were related to military information ranging from national-level political issues concerning the victims and personnel assignments. They are also known as APT-C-43. Threat actors follow a series of stages that make up the attack lifecycle when they devise specific strategies to infiltrate an organization’s network and capture data.",
            "domain": "brandefense.io",
            "tokenized": [
                {
                    "sent": "Attacks affecting many countries, especially Latin America, are carried out against high-profile organizations such as government agencies, law enforcement, telecommunications, and energy companies.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The countries where the cyber espionage group operates, which generally targets Latin American countries with effective spearphishing techniques, are as follows.",
                    "is_evidence": 0
                },
                {
                    "sent": "The group, which frequently uses social engineering techniques such as including malware-laden documents and links in fake e-mails, is known to conduct extensive intelligence work on the target before carrying out the attack.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The themes of the forged documents, which were mostly found to have been seized from previous attacks and repurposed for targeted phishing attacks, were related to military information ranging from national-level political issues concerning the victims and personnel assignments.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "They are also known as APT-C-43.",
                    "is_evidence": 0
                },
                {
                    "sent": "Threat actors follow a series of stages that make up the attack lifecycle when they devise specific strategies to infiltrate an organization’s network and capture data.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://web-assets.esetstatic.com/wls/2019/08/ESET_Machete.pdf/",
            "content": "By analyzing filenames and metadata of exfiltrated documents, it was possible to determine that more than half of the compromised computers were in the Venezuelan military forces. Other compromised computers were related to education, police, and foreign affairs sectors. Real documents are used as decoys, so it is not rare that victims never realize they were compromised and are even compromised again after Machete C&C servers change. Since August 2018, all the main Machete backdoor components (which will be described in the next section) have been delivered with an extra layer of obfuscation. Their long run of attacks, focused in Latin American countries, has allowed them to collect intelligence and refine their tactics over the years. There is, however, an ongoing case of cyberespionage against the Venezuelan military that has managed to stay under the radar.",
            "domain": "web-assets.esetstatic.com",
            "tokenized": [
                {
                    "sent": "By analyzing filenames and metadata of exfiltrated documents, it was possible to determine that more than half of the compromised computers were in the Venezuelan military forces.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Other compromised computers were related to education, police, and foreign affairs sectors.",
                    "is_evidence": 0
                },
                {
                    "sent": "Real documents are used as decoys, so it is not rare that victims never realize they were compromised and are even compromised again after Machete C&C servers change.",
                    "is_evidence": 0
                },
                {
                    "sent": "Since August 2018, all the main Machete backdoor components (which will be described in the next section) have been delivered with an extra layer of obfuscation.",
                    "is_evidence": 0
                },
                {
                    "sent": "Their long run of attacks, focused in Latin American countries, has allowed them to collect intelligence and refine their tactics over the years.",
                    "is_evidence": 0
                },
                {
                    "sent": "There is, however, an ongoing case of cyberespionage against the Venezuelan military that has managed to stay under the radar.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.techrepublic.com/article/apt43-cyberespionage/",
            "content": "APT43 mostly uses spear phishing as a way to compromise its targets. According to Mandiant, who has tracked APT43 since 2018, the threat actor aligns with the mission of the Reconnaissance General Bureau, the main foreign intelligence service from North Korea. In a recent report, Google’s Threat Analysis Group provides intelligence about a threat actor dubbed Archipelago, which they describe as a subset of APT43 activities they’ve been tracking since 2012.The APT43 group primarily targeted foreign policy and nuclear security issues, yet it switched in 2021 to targeting health-related verticals, probably due to the worldwide COVID-19 pandemic. In particular, malware and tools have been shared between APT43 and the infamous Lazarus threat actor. In terms of attribution indicators, APT43 has shared infrastructure and tools with known North Korean operators and North Korean threat actors. New research from Mandiant exposes APT43, a cyberespionage threat actor supporting the interests of the North Korean regime; the group is also referred to as Kimsuky or Thallium.",
            "domain": "www.techrepublic.com",
            "tokenized": [
                {
                    "sent": "APT43 mostly uses spear phishing as a way to compromise its targets.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "According to Mandiant, who has tracked APT43 since 2018, the threat actor aligns with the mission of the Reconnaissance General Bureau, the main foreign intelligence service from North Korea.",
                    "is_evidence": 0
                },
                {
                    "sent": "In a recent report, Google’s Threat Analysis Group provides intelligence about a threat actor dubbed Archipelago, which they describe as a subset of APT43 activities they’ve been tracking since 2012.The APT43 group primarily targeted foreign policy and nuclear security issues, yet it switched in 2021 to targeting health-related verticals, probably due to the worldwide COVID-19 pandemic.",
                    "is_evidence": 0
                },
                {
                    "sent": "In particular, malware and tools have been shared between APT43 and the infamous Lazarus threat actor.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In terms of attribution indicators, APT43 has shared infrastructure and tools with known North Korean operators and North Korean threat actors.",
                    "is_evidence": 0
                },
                {
                    "sent": "New research from Mandiant exposes APT43, a cyberespionage threat actor supporting the interests of the North Korean regime; the group is also referred to as Kimsuky or Thallium.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}