{
    "event_id": "120",
    "claim": "Lazarus Group malware IndiaIndia obtains and sends to its C2 server the title of the window for each running process. The KilaAlfa keylogger also reports the title of the window in the foreground.",
    "original_label": "true",
    "label": "true",
    "explain": "Despite receiving a patch two years ago, the Log4Shell vulnerability remains a popular attack vector even for sophisticated threat actors. An example is a recently documented attack campaign against companies from several industries by the North Korean state-run Lazarus APT group. The Lazarus attackers exploited Log4Shell (CVE-2021-44228) in publicly facing and unpatched VMware Horizon servers and used their access to deploy custom remote access trojans (RATs) written in DLang, a programming language that’s not commonly used in malware development. The campaign, dubbed Operation Blacksmith by researchers from Cisco Talos, appears to have started in March and continues to date. The attacks are more likely opportunistic in nature rather than targeted with recorded victims in the manufacturing, agricultural, and physical security sectors.Custom remote access trojans built with uncommon technologies The Lazarus group (APT38) is one of North Korean government’s hacking teams and is usually tasked with cyberespionage and sabotage objectives. The group’s malicious activities span back many years and it shares some of its toolset and infrastructure with other North Korean APT groups. In fact, the Talos researchers believe the Lazarus APT today is most likely an umbrella for different sub-groups that operate their own campaigns that develop bespoke malware for their targets. These sub-groups might have different objectives and don’t always coordinate with each other, despite the occasional overlap. “During our analysis, Talos found some overlap with the malicious attacks disclosed by Microsoft in October 2023 attributing the activity to Onyx Sleet, also known as PLUTONIUM or Andariel,” the Talos researchers said in their new report on Operation Blacksmith. The Andariel campaign documented by Microsoft exploited CVE-2023-42793, a critical vulnerability in JetBrains TeamCity server, a CI/CD tool used in DevOps. The overlap with Lazarus’ Blacksmith operation was the use of a custom proxy tool dubbed HazyLoad that has only been observed in these two campaigns. However, the other malware implants were different. In Blacksmith, the attackers deployed three different malware programs written in DLang, a programming language originally released in 2001 that uses C++ as inspiration but adds many features and paradigms borrowed from other languages. DLang is an unusual choice for malware development, but Lazarus is known for adopting non-traditional technologies with previous examples including QtFramework and PowerBasic. One of the DLang-based implants deployed in the post-exploitation stage is dubbed NineRAT and is a RAT that uses Telegram as a command-and-control (C2) channel. “With NineRAT activated, the malware becomes the primary method of interaction with the infected host,” the Talos researchers said. “However, previously deployed backdoor mechanisms, such as the reverse proxy tool HazyLoad, remain in place. The multiple tools give overlapping backdoor entries to the Lazarus Group with redundancies in the event a tool is discovered, enabling highly persistent access.” By using the NineRAT samples as a reference, the Talos researchers managed to locate two additional implants that used similar code. One is a downloader also written in DLang that the researchers dubbed BottomLoader. Its purpose is to download an additional payload from a hardcoded URL by using a PowerShell command. The second implant is more sophisticated and is both a payload downloader and remote access trojan that was dubbed DLRAT. Unlike NineRAT, DLRAT doesn’t use Telegram for C2 but sends information about the infected host over HTTP to a C2 web server. In return the attackers can instruct it to upload local files to the server, to rename files and to download additional payloads. “The threat actors also created an additional user account on the system, granting it administrative privileges,” the researchers said. “Talos documented this TTP earlier this year, but the activity observed previously was meant to create unauthorized user accounts at the domain level. In this campaign, the operators created a local account, which matches the user account documented by Microsoft: krtbgt.” Log4j is the gift that keeps on giving Log4Shell was originally reported on December 9, 2021, and is in a highly popular Java library called Log4j. Because of the library’s widespread use, the vulnerability impacted millions of Java applications — both applications that companies developed in-house, as well as commercial products from many software developers. Patches became available for Log4j days after the flaw was announced, but it took months for all impacted vendors to release patches and for organizations to update their internal apps. Despite the big publicity that the flaw received, two years later a large enough number of systems appear to remain vulnerable for groups like Lazarus to still use the exploit. According to software supply chain management company Sonatype that also operates the Central Repository for Java components, over 20% of Log4j downloads continue to be for vulnerable versions. Application security firm Veracode reports that based on its own telemetry only 2.8% of tested applications are still using versions of Log4j with the Log4Shell vulnerabilities. However, an additional 3.8% use a version of Log4j 2.x vulnerable to another high-severity issue tracked as CVE-2021-44832 and a third of all applications that include Log4j continue to use the older 1.x series of the library that has reached end of life and has not received security patches for a long time. While Log4j 1.x is not affected by Log4Shell, it currently has seven other high and critical vulnerabilities that remain unfixed. “Our research also found that once developers are alerted to a vulnerable library through a scan, they fix them relatively quickly: 50% of vulnerabilities are fixed in 89 days overall, in 65 days for high severity vulnerabilities and in 107 days for medium severity vulnerabilities,” Veracode’s chief research officer Chris Eng said in a blog post. “This contradicts the Log4j data above, which shows that remediation is not happening quickly for this open-source library, especially for Log4j 1.2.x.”\n\n\n",
    "reports": [
        {
            "link": "https://www.trendmicro.com/vinfo/pl/security/news/cybercrime-and-digital-threats/a-look-into-the-lazarus-groups-operations/",
            "content": "Aside from being two of the most noteworthy cybercrime incidents of the past few years, these seemingly unrelated attacks are tied together by a common thread: their perpetrator, a cybercrime group called Lazarus. Defending against threats posed by Lazarus and other similar attacks: The Lazarus Group—and any kind of targeted attack—is dangerous because of the wide variety of tools at their disposal and the different tactics they use depending on their targets and their objectives. Here are some examples of the group's objectives, tools, and procedures: Notable Tactics of Lazarus Disruption The disruptive operations performed by Lazarus involve DDOS attacks and Wipers with time-based triggers. However, during their actual attacks, we have seen them deploy both protected and unprotected versions of their tools on the same target: Anti-Forensics Lazarus also employed some anti-forensics techniques in their operations, which include: Separation of components: In the later years of Lazarus operations, particularly operations related to the Bluenoroff subgroup, they made use of component separation for their malware Command line tools: Lazarus, again via Bluenoroff, makes use of command line backdoors and installers. Some operations were disguised as hacktivist activities, with groups such as \"GOP,\" \"WhoAmI,\" and \"New Romanic Army\" claiming responsibility for these alleged hacktivism attacks. The Lazarus group has had multiple operations over the years, most of which involve either disruption, sabotage, financial theft or espionage.",
            "domain": "www.trendmicro.com",
            "tokenized": [
                {
                    "sent": "Aside from being two of the most noteworthy cybercrime incidents of the past few years, these seemingly unrelated attacks are tied together by a common thread: their perpetrator, a cybercrime group called Lazarus.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Defending against threats posed by Lazarus and other similar attacks: The Lazarus Group—and any kind of targeted attack—is dangerous because of the wide variety of tools at their disposal and the different tactics they use depending on their targets and their objectives.",
                    "is_evidence": 0
                },
                {
                    "sent": "Here are some examples of the group's objectives, tools, and procedures: Notable Tactics of Lazarus Disruption The disruptive operations performed by Lazarus involve DDOS attacks and Wipers with time-based triggers.",
                    "is_evidence": 0
                },
                {
                    "sent": "However, during their actual attacks, we have seen them deploy both protected and unprotected versions of their tools on the same target: Anti-Forensics Lazarus also employed some anti-forensics techniques in their operations, which include: Separation of components: In the later years of Lazarus operations, particularly operations related to the Bluenoroff subgroup, they made use of component separation for their malware Command line tools: Lazarus, again via Bluenoroff, makes use of command line backdoors and installers.",
                    "is_evidence": 0
                },
                {
                    "sent": "Some operations were disguised as hacktivist activities, with groups such as \"GOP,\" \"WhoAmI,\" and \"New Romanic Army\" claiming responsibility for these alleged hacktivism attacks.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Lazarus group has had multiple operations over the years, most of which involve either disruption, sabotage, financial theft or espionage.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.radware.com/cyberpedia/ddos-attacks/the-lazarus-group-apt38-north-korean-threat-actor/",
            "content": "Lazarus Group uses a range of custom-built malware, such as remote access trojans (RATs), backdoors, and botnets. The Lazarus Group, also known as APT38, is a cyber espionage group that has been active since at least 2009. The Lazarus Group, also known as APT38, is a notorious Advanced Persistent Threat (APT) entity believed to be linked to North Korean hackers. The United States Federal Bureau of Investigation says that the Lazarus Group is allegedly a North Korean “state-sponsored hacking organization”. These high-profile attacks brought the Lazarus Group into prominence and established them as a significant threat in the realm of cybersecurity. They continuously evolve their tactics and tools, making them a significant cybersecurity threat that leverages techniques such as: Zero-days: Lazarus Group has been observed exploiting zero-day vulnerabilities in software to breach targets.",
            "domain": "www.radware.com",
            "tokenized": [
                {
                    "sent": "Lazarus Group uses a range of custom-built malware, such as remote access trojans (RATs), backdoors, and botnets.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The Lazarus Group, also known as APT38, is a cyber espionage group that has been active since at least 2009.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Lazarus Group, also known as APT38, is a notorious Advanced Persistent Threat (APT) entity believed to be linked to North Korean hackers.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The United States Federal Bureau of Investigation says that the Lazarus Group is allegedly a North Korean “state-sponsored hacking organization”.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "These high-profile attacks brought the Lazarus Group into prominence and established them as a significant threat in the realm of cybersecurity.",
                    "is_evidence": 0
                },
                {
                    "sent": "They continuously evolve their tactics and tools, making them a significant cybersecurity threat that leverages techniques such as: Zero-days: Lazarus Group has been observed exploiting zero-day vulnerabilities in software to breach targets.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://intsights.com/blog/everything-you-should-know-about-the-lazarus-apt-group-of-north-korea/",
            "content": "Back in 2016, the APT group carried out a cyber-attack against the Central Bank of Bangladesh followed by a successful hack into SWIFT, the main platform for worldwide interbank financial telecommunication and funds that transfers between banks around the world that processes around 25 million communications (mostly money transfer transactions) per day around the world. Considered one of the most dominate hacker groups of 2017, the Lazarus Group was originally detected in 2009 during a cyber-espionage campaign against South Korea. In April 2017, researchers suggested that Lazarus group, had initiated a few water-hole attacks in several countries worldwide against financial institutions, casinos, financial-trade software developers, and cryptocurrency businesses. In the past few years, Lazarus Group has issued a series of attacks mainly against the financial industry in the US and South Korea; each more sophisticated than the last. This was done by exploiting infected websites to redirect victims to a customized exploit kit. To learn more about some of Lazarus' most famous attacks, the timeline of their activity, and subgroups of the organization, download our report on the Most Notable Hackers of 2017.",
            "domain": "intsights.com",
            "tokenized": [
                {
                    "sent": "Back in 2016, the APT group carried out a cyber-attack against the Central Bank of Bangladesh followed by a successful hack into SWIFT, the main platform for worldwide interbank financial telecommunication and funds that transfers between banks around the world that processes around 25 million communications (mostly money transfer transactions) per day around the world.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Considered one of the most dominate hacker groups of 2017, the Lazarus Group was originally detected in 2009 during a cyber-espionage campaign against South Korea.",
                    "is_evidence": 0
                },
                {
                    "sent": "In April 2017, researchers suggested that Lazarus group, had initiated a few water-hole attacks in several countries worldwide against financial institutions, casinos, financial-trade software developers, and cryptocurrency businesses.",
                    "is_evidence": 0
                },
                {
                    "sent": "In the past few years, Lazarus Group has issued a series of attacks mainly against the financial industry in the US and South Korea; each more sophisticated than the last.",
                    "is_evidence": 0
                },
                {
                    "sent": "This was done by exploiting infected websites to redirect victims to a customized exploit kit.",
                    "is_evidence": 0
                },
                {
                    "sent": "To learn more about some of Lazarus' most famous attacks, the timeline of their activity, and subgroups of the organization, download our report on the Most Notable Hackers of 2017.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.welivesecurity.com/en/eset-research/lazarus-luring-employees-trojanized-coding-challenges-case-spanish-aerospace-company/",
            "content": "ESET researchers have uncovered a Lazarus attack against an aerospace company in Spain, where the group deployed several tools, most notably a publicly undocumented backdoor we named LightlessCan. In previously reported Lazarus attacks, as documented in blogposts by Positive Technologies in April 2021 and HvS Consulting in December 2020, these native commands are often executed in many instances after the attackers have gotten a foothold in the target’s system. In this blogpost, we describe the method of infiltration and the tools deployed during this Lazarus attack. Lazarus delivered various payloads to the victims’ systems; the most notable is a publicly undocumented and sophisticated remote access trojan (RAT) that we named LightlessCan, which represents a significant advancement compared to its predecessor, BlindingCan.",
            "domain": "www.welivesecurity.com",
            "tokenized": [
                {
                    "sent": "ESET researchers have uncovered a Lazarus attack against an aerospace company in Spain, where the group deployed several tools, most notably a publicly undocumented backdoor we named LightlessCan.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In previously reported Lazarus attacks, as documented in blogposts by Positive Technologies in April 2021 and HvS Consulting in December 2020, these native commands are often executed in many instances after the attackers have gotten a foothold in the target’s system.",
                    "is_evidence": 0
                },
                {
                    "sent": "In this blogpost, we describe the method of infiltration and the tools deployed during this Lazarus attack.",
                    "is_evidence": 0
                },
                {
                    "sent": "Lazarus delivered various payloads to the victims’ systems; the most notable is a publicly undocumented and sophisticated remote access trojan (RAT) that we named LightlessCan, which represents a significant advancement compared to its predecessor, BlindingCan.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        }
    ]
}