{
    "event_id": "139",
    "claim": "Tonto Team is a suspected Chinese state-sponsored cyber espionage threat group that has primarily targeted South Korea, Japan, Taiwan, and the United States since at least 2009; by 2020 they expanded operations to include other Asian as well as Eastern European countries, which has targeted government, military, energy, mining, financial, education, healthcare, and technology organizations, including through the Heartbeat Campaign (2009-2012) and Operation Bitter Biscuit (2017).",
    "original_label": "true",
    "label": "true",
    "explain": "In 2023, IT and cybersecurity companies remain one of the most attractive targets for cybercriminals, according to the latest threat report “Hi-Tech Crime Trends 2022/2023”. The compromise of a vendor’s infrastructure opens up ample opportunities to penetrate the network further and gain access to a huge pool of data about the victim’s customers and partners. Remember how the SolarWinds attack put Microsoft, Cisco, FireEye, Mimecast, and 18,000 other companies at risk? In light of the military conflict, nation-state threat actors from around the world, including from countries that are not directly involved in the crisis, are actively carrying out cyber espionage operations. In the summer of 2022, the Group-IB Managed Extended Detection and Response (MXDR) solution successfully detected and blocked an email carrying a malicious attachment. This email was intended for Group-IB’s employees. While analyzing this attack, Anastasia Tikhonova, Head of APT Research, and Dmitry Kupin, Senior Malware Analyst, at the Group-IB Threat Intelligence team found patterns in the actions of the attackers and attributed the observed TTPs to Tonto Team. The results of their research are worthy of a separate blog. These findings were presented at GovWare 2022 in Singapore by Anastasia Tikhonova. As always, we provide indicators of compromise associated with the Tonto Team campaign and detailed analysis of the tools, techniques, and procedures (TTPs) of the threat actor in the MITRE ATT&CK® format (Adversarial Tactics, Techniques & Common Knowledge). This information is useful for organizations fighting cybercrime and information security professionals — chief information officers, SOC analysts, and incident responders — in other sectors targeted by Tonto Team. Our goal is to assist in the adoption of preventive measures against the Tonto Team attacks.In June 2022, the Group-IB Managed XDR solution detected and blocked an attempt to deliver a malicious email to Group-IB’s employees. The attackers used phishing emails to deliver malicious Microsoft Office documents created with the Royal Road Weaponizer, a tool widely used by Chinese nation-state threat actors. During the attack, Group-IB researchers noticed the use of the Bisonal.DoubleT backdoor. Bisonal.DoubleT is a unique tool developed by the Tonto Team APT. The attackers used a new downloader that Group-IB analysts named TontoTeam.Downloader (aka QuickMute).Tonto Team (aka HeartBeat, Karma Panda, CactusPete, Bronze Huntley, Earth Akhlut) is a cyber espionage threat actor that is believed to originate from China. The threat actor has been targeting government, military, energy, financial, educational, healthcare, and technology sector companies since 2009. Initially focusing on Asia Pacific (South Korea, Japan, Taiwan), and the United States, by 2020, the group had expanded its operations to Eastern Europe.Nation state apt it all started with an email.On the evening of June 20, 2022, Group-IB Managed XDR triggered an alert and blocked malicious emails that were sent to two Group-IB employees.The threat actors posed as an employee of a legitimate company and used a fake mail created with GMX Mail (Global Message eXchange), a free email service. The targeted phishing emails were supposed to be the first stage of an attack.The analyzed file is a malicious document in a Rich Text Format (RTF) that was created via the Royal Road RTF Weaponizer. The weaponizer is mainly used by Chinese APT groups. The tool allows the threat actor to create malicious RTF exploits with plausible decoy content for CVE-2017-11882, CVE-2018-0802, and CVE-2018-0798, which are the vulnerabilities in the Microsoft Equation Editor.Researchers at Malwarebytes and SentinelOne have previously highlighted some of the indicators of compromise connected to RTF documents, but we would like to take a closer look into the kill chain.The decrypted payload was a malicious EXE file in PE32 format (MD5:e40c514739768ba04ab17ff0126c1533) that can be classified as a Bisonal.DoubleT backdoor. This malware provides remote access to an infected computer and allows an attacker to execute various commands on it. We conducted a static analysis of the Bisonal.DoubleT sample to compare it with an old version detected in 2020 (MD5:c3d25232add0238d04864fc992e7a330) and found similar strings,In addition, we conducted a dynamic comparison analysis of the sample obtained in 2022 with other samples in the Bisonal.DoubleT malware family,The identical patterns of network requests are highlighted in red, and the generated ID is in blue.In the sample obtained in 2020, we have found traces of communication with the C2 server offices-update[.]com, which was also mentioned by IZ:SOC in connection with another Bisonal malware sample.The data transmitted in a POST request (sending the result of the command execution) is encrypted using the same RC4 algorithm in a non-standard implementation with a 128-byte S-box to encrypt strings in the malware’s body.The set of files described above can be considered related to the cyberespionage group Tonto Team. The Bisonal.DoubleT malware was previously attributed to this threat actor and has been used by the group since at least 2019. Analysis of the network infrastructure showed the usage of the IP address (137[.]220[.]176[.]165), which had previously been seen in the Tonto Team attacks. The document was also created in the Royal Road RTF Weaponizer.Thus, there are several connections between the attempted attack against Group-IB and the Tonto Team APT: Metadata in the decoy documents indicates that the operating system language of the document’s author was Simplified Chinese. Documents are created in Royal Road, the well-known malicious document builder widely used by Chinese APT groups. Malicious documents are commonly used to deliver custom malware. Bisonal and its DoubleT version are both existing for over 10 years with continuous development and are attributed to the Tonto Team. It was not the first time the Tonto Team has shown interest in the IT sector. In March 2021, the group hacked into the email servers of a purchasing company and a software development and cybersecurity consulting company based in Eastern Europe.Therefore, Group-IB specialists assess with high confidence that this activity was carried out by the Tonto Team.During the research, we wondered if it was not the first attempt of the Tonto Team to attack Group-IB. To answer this question, we have studied the entire Group-IB Managed XDR database of neutralized malicious mailings and discovered that in the summer of 2021 the threat actor tried to attack Group-IB employees. The attempt was unsuccessful. The screenshot below shows that on June 28, 2021, the Group-IB Managed XDR blocked an email sent to our employees. This email contained a file that we identified as malicious,In 2021, the threat actor used spearphishing as the initial attack vector and once again employed fake mail registered with the GMX Mail service. The analyzed file “30 июня B 17.30 – очередное заседание Исполкома АДЭ.doc” (MD5:7c138c6b6f88643d7c16e741f98e0503) is a malicious RTF document that was created in the Royal Road RTF Weaponizer, similar to the email attachment used in the 2022 attack on Group-IB.The decrypted payload is a malicious PE32 format DLL file that can be classified as Bisonal.Dropper. This malware is used to deploy the Bisonal backdoor on the victim’s system. Compiled Date: 06/28/2021 01:44:01 UTC (which is 9:44 Beijing time – the beginning of a workday in China) Bisonal.Dropper creates a file “%AppData%\\Roaming\\conhost.exe” (Bisonal.DoubleT backdoor). It records random overlay data to “conhost.exe” to change the backdoor hash. ← Blog Nice Try Tonto Team How a nation-state APT attempted to attack Group-IB February 13, 2023 · 16 min to read · Advanced Persistent Threats APT China Hacker group Threat Intelligence In 2023, IT and cybersecurity companies remain one of the most attractive targets for cybercriminals, according to the latest threat report “Hi-Tech Crime Trends 2022/2023”. The compromise of a vendor’s infrastructure opens up ample opportunities to penetrate the network further and gain access to a huge pool of data about the victim’s customers and partners. Remember how the SolarWinds attack put Microsoft, Cisco, FireEye, Mimecast, and 18,000 other companies at risk? In light of the military conflict, nation-state threat actors from around the world, including from countries that are not directly involved in the crisis, are actively carrying out cyber espionage operations. In the summer of 2022, the Group-IB Managed Extended Detection and Response (MXDR) solution successfully detected and blocked an email carrying a malicious attachment. This email was intended for Group-IB’s employees. While analyzing this attack, Anastasia Tikhonova, Head of APT Research, and Dmitry Kupin, Senior Malware Analyst, at the Group-IB Threat Intelligence team found patterns in the actions of the attackers and attributed the observed TTPs to Tonto Team. The results of their research are worthy of a separate blog. These findings were presented at GovWare 2022 in Singapore by Anastasia Tikhonova. As always, we provide indicators of compromise associated with the Tonto Team campaign and detailed analysis of the tools, techniques, and procedures (TTPs) of the threat actor in the MITRE ATT&CK® format (Adversarial Tactics, Techniques & Common Knowledge). This information is useful for organizations fighting cybercrime and information security professionals — chief information officers, SOC analysts, and incident responders — in other sectors targeted by Tonto Team. Our goal is to assist in the adoption of preventive measures against the Tonto Team attacks. Key findings In June 2022, the Group-IB Managed XDR solution detected and blocked an attempt to deliver a malicious email to Group-IB’s employees. The attackers used phishing emails to deliver malicious Microsoft Office documents created with the Royal Road Weaponizer, a tool widely used by Chinese nation-state threat actors. During the attack, Group-IB researchers noticed the use of the Bisonal.DoubleT backdoor. Bisonal.DoubleT is a unique tool developed by the Tonto Team APT. The attackers used a new downloader that Group-IB analysts named TontoTeam.Downloader (aka QuickMute). Who is Tonto Team? Tonto Team (aka HeartBeat, Karma Panda, CactusPete, Bronze Huntley, Earth Akhlut) is a cyber espionage threat actor that is believed to originate from China. The threat actor has been targeting government, military, energy, financial, educational, healthcare, and technology sector companies since 2009. Initially focusing on Asia Pacific (South Korea, Japan, Taiwan), and the United States, by 2020, the group had expanded its operations to Eastern Europe. Nation state apt it all started with an email… On the evening of June 20, 2022, Group-IB Managed XDR triggered an alert and blocked malicious emails that were sent to two Group-IB employees: Screenshots of alerts in Group-IB Managed XDR (Subject of the letter: State cloud issues in terms of information security. Meeting protocol) The threat actors posed as an employee of a legitimate company and used a fake mail created with GMX Mail (Global Message eXchange), a free email service. The targeted phishing emails were supposed to be the first stage of an attack. Analysis of the malicious document The file “17.06.2022_Протокол_МРГ_Подгруппа_ИБ.doc” was attached to the email: The analyzed file is a malicious document in a Rich Text Format (RTF) that was created via the Royal Road RTF Weaponizer. The weaponizer is mainly used by Chinese APT groups. The tool allows the threat actor to create malicious RTF exploits with plausible decoy content for CVE-2017-11882, CVE-2018-0802, and CVE-2018-0798, which are the vulnerabilities in the Microsoft Equation Editor. Researchers at Malwarebytes and SentinelOne have previously highlighted some of the indicators of compromise connected to RTF documents, but we would like to take a closer look into the kill chain. The decoy document has the following metadata: Running the decoy, we found an encoded malicious payload dcnx18pwh.wmf (MD5:518439fc23cb0b4d21c7fd39484376ff): Analysis of the decrypted payload The decrypted payload was a malicious EXE file in PE32 format (MD5:e40c514739768ba04ab17ff0126c1533) that can be classified as a Bisonal.DoubleT backdoor. This malware provides remote access to an infected computer and allows an attacker to execute various commands on it. We conducted a static analysis of the Bisonal.DoubleT sample to compare it with an old version detected in 2020 (MD5:c3d25232add0238d04864fc992e7a330) and found similar strings: In addition, we conducted a dynamic comparison analysis of the sample obtained in 2022 with other samples in the Bisonal.DoubleT malware family: MD5 e40c514739768ba04ab17ff0126c1533 (sample 2022) c3d25232add0238d04864fc992e7a330 (sample 2020) URL hXXp://137.220.176[.]165/ru/order/index.php?strPageID=234989760 hXXp://www.offices-update[.]com/ru/order/index.php?strPageID=234989760 User-Agent Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.181 Safari/537.36\r\nAccept-Encoding: gzip, deflate\r\nAccept-Language: ru-RU,ru;q=0.9,en-US;q=0.8,en;q=0.7\r\nCookie: JSESSIONID=AHAKQAIOMIBQAAA3HEKQAAIAAAAAMAAAAAAQAAAAAEFA ASSFKJJE6TCEFVIEGBQAJVUWO5LFNQFAASSFKJJE6TCEFVIEGAAAAIADEMQ= Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.181 Safari/537.36 The identical patterns of network requests are highlighted in red, and the generated ID is in blue. Sample 2022 with MD5: e40c514739768ba04ab17ff0126c1533 Sample 2020 with MD5: c3d25232add0238d04864fc992e7a330 In the sample obtained in 2020, we have found traces of communication with the C2 server offices-update[.]com, which was also mentioned by IZ:SOC in connection with another Bisonal malware sample. Connection to the C2 of the Bisonal sample from the IZ:SOC public report As you can see from the table and the screenshot above, the network requests are very similar. The main functionality of Bisonal.DoubleT: collecting information about the compromised host: system language encoding, proxy server address, time since system boot, hostname, account name under which the file is running, and local IP address; getting a list of processes; stopping a specified process; getting remote access to cmd.exe; downloading a file from the control server and running it; creating a file on a disk using the local language encoding. The collected information about the compromised host is encoded using the Base32 algorithm. All of the important strings are encoded using the following RC4 algorithm in a non-standard implementation with a 128-byte S-box: After decryption, the strings look like this: The data transmitted in a POST request (sending the result of the command execution) is encrypted using the same RC4 algorithm in a non-standard implementation with a 128-byte S-box to encrypt strings in the malware’s body. Basic communication patterns between the threat actor’s C2 and Bisonal.DoubleT: Request Template Example Hello – GET request hXXps://137[.]220[.]176[.]165/ru/order/index.php?strPageID=[ID], where ID is a decimal number hXXps://137[.]220[.]176[.]165/ru/order/index.php?strPageID=167880896 Command – GET request hXXps://137[.]220[.]176[.]165/ru/news/index.php?strPageID=[ID]&newsID=[YYYY-MM-DD-mmss] hXXps://137[.]220[.]176[.]165/ru/news/index.php?strPageID=167880896&newsID=2022-06-21-1023 Response – POST request hXXps://137[.]220[.]176[.]165/xhome[.]native[.]page/datareader.php?sid=[ID] hXXps://137[.]220[.]176[.]165/xhome[.]native[.]page/datareader.php?sid=167880896 Download & Execute – GET request hXXps://137[.]220[.]176[.]165/siteFiles/index.php?strPageID=[ID] hXXps://137[.]220[.]176[.]165/siteFiles/index.php?strPageID=167880896 Attribution The set of files described above can be considered related to the cyberespionage group Tonto Team. The Bisonal.DoubleT malware was previously attributed to this threat actor and has been used by the group since at least 2019. Analysis of the network infrastructure showed the usage of the IP address (137[.]220[.]176[.]165), which had previously been seen in the Tonto Team attacks. The document was also created in the Royal Road RTF Weaponizer. Thus, there are several connections between the attempted attack against Group-IB and the Tonto Team APT: Metadata in the decoy documents indicates that the operating system language of the document’s author was Simplified Chinese. Documents are created in Royal Road, the well-known malicious document builder widely used by Chinese APT groups. Malicious documents are commonly used to deliver custom malware. Bisonal and its DoubleT version are both existing for over 10 years with continuous development and are attributed to the Tonto Team. It was not the first time the Tonto Team has shown interest in the IT sector. In March 2021, the group hacked into the email servers of a purchasing company and a software development and cybersecurity consulting company based in Eastern Europe. Therefore, Group-IB specialists assess with high confidence that this activity was carried out by the Tonto Team. We’ve seen them before During the research, we wondered if it was not the first attempt of the Tonto Team to attack Group-IB. To answer this question, we have studied the entire Group-IB Managed XDR database of neutralized malicious mailings and discovered that in the summer of 2021 the threat actor tried to attack Group-IB employees. The attempt was unsuccessful. The screenshot below shows that on June 28, 2021, the Group-IB Managed XDR blocked an email sent to our employees. This email contained a file that we identified as malicious: The Group-IB malware detonation platform analyzed the malicious attachment, so we were able to see the following picture: Is it really the same scheme? In 2021, the threat actor used spearphishing as the initial attack vector and once again employed fake mail registered with the GMX Mail service. The analyzed file “30 июня B 17.30 – очередное заседание Исполкома АДЭ.doc” (MD5:7c138c6b6f88643d7c16e741f98e0503) is a malicious RTF document that was created in the Royal Road RTF Weaponizer, similar to the email attachment used in the 2022 attack on Group-IB. The decoy has the following metadata: Malicious encoded payload (8.t MD5: d5d0a1a034dcefdb08d9ca51c7694a22): Analysis of the decrypted payload The decrypted payload is a malicious PE32 format DLL file that can be classified as Bisonal.Dropper. This malware is used to deploy the Bisonal backdoor on the victim’s system. Compiled Date: 06/28/2021 01:44:01 UTC (which is 9:44 Beijing time – the beginning of a workday in China) Bisonal.Dropper creates a file “%AppData%\\Roaming\\conhost.exe” (Bisonal.DoubleT backdoor). It records random overlay data to “conhost.exe” to change the backdoor hash. The dropper also adds “conhost.exe” to the system startup by creating a registry key setting: [HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run] userInit = “%AppData%\\Roaming\\conhost.exe” The backdoor will run only after a system reboot. Bisonal.DoubleT may write the following error messages to the log file “%windows%\\temp\\log.txt“: “[!] get pRegSetValueEx error\n” “[!] get pGetProcAddress error\n” “[!] get LoadLibraryA error\n” “conhost.exe” (MD5: f53965ab81f746f5a2bf183d2a704c72) is a malicious EXE file in PE32 format that can be classified as a Bisonal.DoubleT backdoor. Comparing this sample from 2021 with the sample from 2022, we haven’t found any difference in functionality and encryption algorithms. In the 2021 sample, all important strings are also encoded using the RC4 algorithm in a non-standard implementation with a 128-byte S-box,In addition, we compared the decrypted strings of the 2022 and 2021 samples. The different strings of the 2022 sample are marked in red, and the strings of the 2021 sample are highlighted in yellow. Below is the result of comparing the strings of the indicated Bisonal.DoubleT samples, ← Blog Nice Try Tonto Team How a nation-state APT attempted to attack Group-IB February 13, 2023 · 16 min to read · Advanced Persistent Threats APT China Hacker group Threat Intelligence In 2023, IT and cybersecurity companies remain one of the most attractive targets for cybercriminals, according to the latest threat report “Hi-Tech Crime Trends 2022/2023”. The compromise of a vendor’s infrastructure opens up ample opportunities to penetrate the network further and gain access to a huge pool of data about the victim’s customers and partners. Remember how the SolarWinds attack put Microsoft, Cisco, FireEye, Mimecast, and 18,000 other companies at risk? In light of the military conflict, nation-state threat actors from around the world, including from countries that are not directly involved in the crisis, are actively carrying out cyber espionage operations. In the summer of 2022, the Group-IB Managed Extended Detection and Response (MXDR) solution successfully detected and blocked an email carrying a malicious attachment. This email was intended for Group-IB’s employees. While analyzing this attack, Anastasia Tikhonova, Head of APT Research, and Dmitry Kupin, Senior Malware Analyst, at the Group-IB Threat Intelligence team found patterns in the actions of the attackers and attributed the observed TTPs to Tonto Team. The results of their research are worthy of a separate blog. These findings were presented at GovWare 2022 in Singapore by Anastasia Tikhonova. As always, we provide indicators of compromise associated with the Tonto Team campaign and detailed analysis of the tools, techniques, and procedures (TTPs) of the threat actor in the MITRE ATT&CK® format (Adversarial Tactics, Techniques & Common Knowledge). This information is useful for organizations fighting cybercrime and information security professionals — chief information officers, SOC analysts, and incident responders — in other sectors targeted by Tonto Team. Our goal is to assist in the adoption of preventive measures against the Tonto Team attacks. Key findings In June 2022, the Group-IB Managed XDR solution detected and blocked an attempt to deliver a malicious email to Group-IB’s employees. The attackers used phishing emails to deliver malicious Microsoft Office documents created with the Royal Road Weaponizer, a tool widely used by Chinese nation-state threat actors. During the attack, Group-IB researchers noticed the use of the Bisonal.DoubleT backdoor. Bisonal.DoubleT is a unique tool developed by the Tonto Team APT. The attackers used a new downloader that Group-IB analysts named TontoTeam.Downloader (aka QuickMute). Who is Tonto Team? Tonto Team (aka HeartBeat, Karma Panda, CactusPete, Bronze Huntley, Earth Akhlut) is a cyber espionage threat actor that is believed to originate from China. The threat actor has been targeting government, military, energy, financial, educational, healthcare, and technology sector companies since 2009. Initially focusing on Asia Pacific (South Korea, Japan, Taiwan), and the United States, by 2020, the group had expanded its operations to Eastern Europe. Nation state apt it all started with an email… On the evening of June 20, 2022, Group-IB Managed XDR triggered an alert and blocked malicious emails that were sent to two Group-IB employees: Screenshots of alerts in Group-IB Managed XDR (Subject of the letter: State cloud issues in terms of information security. Meeting protocol) The threat actors posed as an employee of a legitimate company and used a fake mail created with GMX Mail (Global Message eXchange), a free email service. The targeted phishing emails were supposed to be the first stage of an attack. Analysis of the malicious document The file “17.06.2022_Протокол_МРГ_Подгруппа_ИБ.doc” was attached to the email: The analyzed file is a malicious document in a Rich Text Format (RTF) that was created via the Royal Road RTF Weaponizer. The weaponizer is mainly used by Chinese APT groups. The tool allows the threat actor to create malicious RTF exploits with plausible decoy content for CVE-2017-11882, CVE-2018-0802, and CVE-2018-0798, which are the vulnerabilities in the Microsoft Equation Editor. Researchers at Malwarebytes and SentinelOne have previously highlighted some of the indicators of compromise connected to RTF documents, but we would like to take a closer look into the kill chain. The decoy document has the following metadata: Running the decoy, we found an encoded malicious payload dcnx18pwh.wmf (MD5:518439fc23cb0b4d21c7fd39484376ff): Analysis of the decrypted payload The decrypted payload was a malicious EXE file in PE32 format (MD5:e40c514739768ba04ab17ff0126c1533) that can be classified as a Bisonal.DoubleT backdoor. This malware provides remote access to an infected computer and allows an attacker to execute various commands on it. We conducted a static analysis of the Bisonal.DoubleT sample to compare it with an old version detected in 2020 (MD5:c3d25232add0238d04864fc992e7a330) and found similar strings: In addition, we conducted a dynamic comparison analysis of the sample obtained in 2022 with other samples in the Bisonal.DoubleT malware family: MD5 e40c514739768ba04ab17ff0126c1533 (sample 2022) c3d25232add0238d04864fc992e7a330 (sample 2020) URL hXXp://137.220.176[.]165/ru/order/index.php?strPageID=234989760 hXXp://www.offices-update[.]com/ru/order/index.php?strPageID=234989760 User-Agent Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.181 Safari/537.36\r\nAccept-Encoding: gzip, deflate\r\nAccept-Language: ru-RU,ru;q=0.9,en-US;q=0.8,en;q=0.7\r\nCookie: JSESSIONID=AHAKQAIOMIBQAAA3HEKQAAIAAAAAMAAAAAAQAAAAAEFA ASSFKJJE6TCEFVIEGBQAJVUWO5LFNQFAASSFKJJE6TCEFVIEGAAAAIADEMQ= Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.181 Safari/537.36 The identical patterns of network requests are highlighted in red, and the generated ID is in blue. Sample 2022 with MD5: e40c514739768ba04ab17ff0126c1533 Sample 2020 with MD5: c3d25232add0238d04864fc992e7a330 In the sample obtained in 2020, we have found traces of communication with the C2 server offices-update[.]com, which was also mentioned by IZ:SOC in connection with another Bisonal malware sample. Connection to the C2 of the Bisonal sample from the IZ:SOC public report As you can see from the table and the screenshot above, the network requests are very similar. The main functionality of Bisonal.DoubleT: collecting information about the compromised host: system language encoding, proxy server address, time since system boot, hostname, account name under which the file is running, and local IP address; getting a list of processes; stopping a specified process; getting remote access to cmd.exe; downloading a file from the control server and running it; creating a file on a disk using the local language encoding. The collected information about the compromised host is encoded using the Base32 algorithm. All of the important strings are encoded using the following RC4 algorithm in a non-standard implementation with a 128-byte S-box: After decryption, the strings look like this: The data transmitted in a POST request (sending the result of the command execution) is encrypted using the same RC4 algorithm in a non-standard implementation with a 128-byte S-box to encrypt strings in the malware’s body. Basic communication patterns between the threat actor’s C2 and Bisonal.DoubleT: Request Template Example Hello – GET request hXXps://137[.]220[.]176[.]165/ru/order/index.php?strPageID=[ID], where ID is a decimal number hXXps://137[.]220[.]176[.]165/ru/order/index.php?strPageID=167880896 Command – GET request hXXps://137[.]220[.]176[.]165/ru/news/index.php?strPageID=[ID]&newsID=[YYYY-MM-DD-mmss] hXXps://137[.]220[.]176[.]165/ru/news/index.php?strPageID=167880896&newsID=2022-06-21-1023 Response – POST request hXXps://137[.]220[.]176[.]165/xhome[.]native[.]page/datareader.php?sid=[ID] hXXps://137[.]220[.]176[.]165/xhome[.]native[.]page/datareader.php?sid=167880896 Download & Execute – GET request hXXps://137[.]220[.]176[.]165/siteFiles/index.php?strPageID=[ID] hXXps://137[.]220[.]176[.]165/siteFiles/index.php?strPageID=167880896 Attribution The set of files described above can be considered related to the cyberespionage group Tonto Team. The Bisonal.DoubleT malware was previously attributed to this threat actor and has been used by the group since at least 2019. Analysis of the network infrastructure showed the usage of the IP address (137[.]220[.]176[.]165), which had previously been seen in the Tonto Team attacks. The document was also created in the Royal Road RTF Weaponizer. Thus, there are several connections between the attempted attack against Group-IB and the Tonto Team APT: Metadata in the decoy documents indicates that the operating system language of the document’s author was Simplified Chinese. Documents are created in Royal Road, the well-known malicious document builder widely used by Chinese APT groups. Malicious documents are commonly used to deliver custom malware. Bisonal and its DoubleT version are both existing for over 10 years with continuous development and are attributed to the Tonto Team. It was not the first time the Tonto Team has shown interest in the IT sector. In March 2021, the group hacked into the email servers of a purchasing company and a software development and cybersecurity consulting company based in Eastern Europe. Therefore, Group-IB specialists assess with high confidence that this activity was carried out by the Tonto Team. We’ve seen them before During the research, we wondered if it was not the first attempt of the Tonto Team to attack Group-IB. To answer this question, we have studied the entire Group-IB Managed XDR database of neutralized malicious mailings and discovered that in the summer of 2021 the threat actor tried to attack Group-IB employees. The attempt was unsuccessful. The screenshot below shows that on June 28, 2021, the Group-IB Managed XDR blocked an email sent to our employees. This email contained a file that we identified as malicious: The Group-IB malware detonation platform analyzed the malicious attachment, so we were able to see the following picture: Is it really the same scheme? In 2021, the threat actor used spearphishing as the initial attack vector and once again employed fake mail registered with the GMX Mail service. The analyzed file “30 июня B 17.30 – очередное заседание Исполкома АДЭ.doc” (MD5:7c138c6b6f88643d7c16e741f98e0503) is a malicious RTF document that was created in the Royal Road RTF Weaponizer, similar to the email attachment used in the 2022 attack on Group-IB. The decoy has the following metadata: Malicious encoded payload (8.t MD5: d5d0a1a034dcefdb08d9ca51c7694a22): Analysis of the decrypted payload The decrypted payload is a malicious PE32 format DLL file that can be classified as Bisonal.Dropper. This malware is used to deploy the Bisonal backdoor on the victim’s system. Compiled Date: 06/28/2021 01:44:01 UTC (which is 9:44 Beijing time – the beginning of a workday in China) Bisonal.Dropper creates a file “%AppData%\\Roaming\\conhost.exe” (Bisonal.DoubleT backdoor). It records random overlay data to “conhost.exe” to change the backdoor hash. The dropper also adds “conhost.exe” to the system startup by creating a registry key setting: [HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run] userInit = “%AppData%\\Roaming\\conhost.exe” The backdoor will run only after a system reboot. Bisonal.DoubleT may write the following error messages to the log file “%windows%\\temp\\log.txt“: “[!] get pRegSetValueEx error\n” “[!] get pGetProcAddress error\n” “[!] get LoadLibraryA error\n” “conhost.exe” (MD5: f53965ab81f746f5a2bf183d2a704c72) is a malicious EXE file in PE32 format that can be classified as a Bisonal.DoubleT backdoor. Comparing this sample from 2021 with the sample from 2022, we haven’t found any difference in functionality and encryption algorithms. In the 2021 sample, all important strings are also encoded using the RC4 algorithm in a non-standard implementation with a 128-byte S-box: After decryption, the strings look like this: In addition, we compared the decrypted strings of the 2022 and 2021 samples. The different strings of the 2022 sample are marked in red, and the strings of the 2021 sample are highlighted in yellow. Below is the result of comparing the strings of the indicated Bisonal.DoubleT samples: Basic communication patterns between C2 and Bisonal.DoubleT: Request Template Example Hello – GET request hXXps://103[.]85[.]20[.]194/ru/order/index.php?strPageID=[ID], where ID is a decimal number hXXps://103[.]85[.]20[.]194/ru/order/index.php?strPageID=167880896 Command – GET request hXXps://103[.]85[.]20[.]194/ru/news/index.php?strPageID=[ID]&newsID=[YYYY-MM-DD-mmss] hXXps://103[.]85[.]20[.]194/ru/news/index.php?strPageID=167880896&newsID=2022-06-22-1422 Response – POST request hXXps://103[.]85[.]20[.]194/xhome[.]native[.]page/datareader.php?sid=[ID] hXXps://103[.]85[.]20[.]194/xhome[.]native[.]page/datareader.php?sid=167880896 Download & Execute – GET request hXXps://103[.]85[.]20[.]194/siteFiles/index.php?strPageID=[ID] hXXps://103[.]85[.]20[.]194/siteFiles/index.php?strPageID=167880896 So, there’s nothing new at all? In the 2022 attack, Tonto Team used a new downloader that Group-IB named TontoTeam.Downloader. It has also been called QuickMute in another public source. As usual, the group used a malicious RTF document that was created in Royal Road — Вниманию.doc (MD5: 8cdd56b2b4e1e901f7e728a984221d10).The decrypted payload is a malicious EXE file in PE32 format (MD5: 66c46b76bb1a1e7ecdb091619a8f5089), which can be classified as a downloader. This file is used to download malware for the next stage of the attack, which is a DLL with the specified export function “HttpsVictimMain”. The configuration data of the analyzed file is encrypted using RC4. The key is contained in the malware body and is 256 bytes long.Group-IB experts have previously warned about threats from TaskMasters and TA428, other Chinese nation-state cyber threat actors. Based on the conducted analysis, the company’s Threat Intelligence team concluded that Tonto Team is behind the 2021-2022 attempted attacks on Group-IB. The main goal of Chinese APTs are espionage and intellectual property theft. Undoubtedly, Tonto Team will keep probing IT and cybersecurity companies by leveraging spear phishing to deliver malicious documents using vulnerabilities with decoys specially prepared for this purpose. Successful supply chain attacks against IT and cybersecurity companies give attackers access to a large number of victims’ customers and partners. Therefore, organizations in these sectors need to stay up to date with ever-evolving tools, tactics, and methods of threat actors and employ Group-IB Managed XDR for advanced threat detection and response. This solution proved its efficiency in preventing the alleged Tonto Team attack on the Group-IB’s employees. Group-IB Managed XDR contains a whole range of advanced cybersecurity solutions to stop complex targeted attacks,Group-IB will continue to research the methods, tools and tactics of Tonto Team and inform the organizations targeted by this pro-state group. We aspire to promptly inform the attacked organizations about the discovered malicious activity against them – it helps minimize the damage from threat actor’s actions. Additionally, we consider informing the cybersecurity community about the discovered threats as a part of our mission and encourage other researchers to study complex threats together, share data and use our technologies to combat intruders.\n\n\n",
    "reports": [
        {
            "link": "https://thehackernews.com/2023/02/chinese-tonto-team-hackers-second.html/",
            "content": "\"The adversarial collective, in March 2021, also emerged as one of the threat actors to exploit the ProxyLogon flaws in Microsoft Exchange Server to strike cybersecurity and procuring companies based in Eastern Europe. \"Undoubtedly, Tonto Team will keep probing IT and cybersecurity companies by leveraging spear-phishing to deliver malicious documents using vulnerabilities with decoys specially prepared for this purpose.\" It's also the second attack aimed at Group-IB, the first of which took place in March 2021. The advanced persistent threat (APT) actor known as Tonto Team carried out an unsuccessful attack on cybersecurity company Group-IB in June 2022. The attempted attack on Group-IB is no different in that the threat actor leveraged phishing emails to distribute malicious Microsoft Office documents created with the Royal Road weaponizer to deploy Bisonal. [...] used by this threat actor in the wild is the use of legitimate corporate email addresses, most likely obtained by phishing, to send emails to other users,\" Trend Micro disclosed in 2020.",
            "domain": "thehackernews.com",
            "tokenized": [
                {
                    "sent": "\"The adversarial collective, in March 2021, also emerged as one of the threat actors to exploit the ProxyLogon flaws in Microsoft Exchange Server to strike cybersecurity and procuring companies based in Eastern Europe.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "\"Undoubtedly, Tonto Team will keep probing IT and cybersecurity companies by leveraging spear-phishing to deliver malicious documents using vulnerabilities with decoys specially prepared for this purpose.\"",
                    "is_evidence": 0
                },
                {
                    "sent": "It's also the second attack aimed at Group-IB, the first of which took place in March 2021.",
                    "is_evidence": 0
                },
                {
                    "sent": "The advanced persistent threat (APT) actor known as Tonto Team carried out an unsuccessful attack on cybersecurity company Group-IB in June 2022.",
                    "is_evidence": 0
                },
                {
                    "sent": "The attempted attack on Group-IB is no different in that the threat actor leveraged phishing emails to distribute malicious Microsoft Office documents created with the Royal Road weaponizer to deploy Bisonal.",
                    "is_evidence": 0
                },
                {
                    "sent": "[...] used by this threat actor in the wild is the use of legitimate corporate email addresses, most likely obtained by phishing, to send emails to other users,\" Trend Micro disclosed in 2020.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.malwarebytes.com/blog/news/2022/07/chinas-tonto-team-increases-espionage-activities-against-russia/",
            "content": "According to SentinelOne, the RTF file masquerades as a government advisory or security warning to agencies and infrastructure providers of potential attacks. According to analyses of several cybersecurity firms and CERT (Computer Emergency Response Team) Ukraine (CERT-UA), the state-sponsored threat actor group Tonto Team, which has been linked to China-backed cyber operations, is ramping up its spying campaign against Russian government agencies. The campaign, which involves an email, a Word document file in RTF (Rich Text File) format, and a backdoor payload, starts off with socially engineering recipients to convince them to open a malformed attachment, triggering the execution of an MS Office exploit, particularly in the Equation Editor. The repeated use of these tools through the years also suggests that campaigns against targeted nations have been successful, which gives us an idea of the state of security of these countries. You look at the exploits they’re using in these documents, they’re years old exploits. “The fact that these toolkits evolve and continue to operate really speaks to how well they’re resourced, and the state of the defense side,” Hegel told CyberScoop in a separate interview.",
            "domain": "www.malwarebytes.com",
            "tokenized": [
                {
                    "sent": "According to SentinelOne, the RTF file masquerades as a government advisory or security warning to agencies and infrastructure providers of potential attacks.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "According to analyses of several cybersecurity firms and CERT (Computer Emergency Response Team) Ukraine (CERT-UA), the state-sponsored threat actor group Tonto Team, which has been linked to China-backed cyber operations, is ramping up its spying campaign against Russian government agencies.",
                    "is_evidence": 0
                },
                {
                    "sent": "The campaign, which involves an email, a Word document file in RTF (Rich Text File) format, and a backdoor payload, starts off with socially engineering recipients to convince them to open a malformed attachment, triggering the execution of an MS Office exploit, particularly in the Equation Editor.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The repeated use of these tools through the years also suggests that campaigns against targeted nations have been successful, which gives us an idea of the state of security of these countries.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "You look at the exploits they’re using in these documents, they’re years old exploits.",
                    "is_evidence": 0
                },
                {
                    "sent": "“The fact that these toolkits evolve and continue to operate really speaks to how well they’re resourced, and the state of the defense side,” Hegel told CyberScoop in a separate interview.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.virusbulletin.com/conference/vb2020/abstracts/tonto-team-exploring-ttps-advanced-threat-actor-operating-large-infrastructure/",
            "content": "As an infection vector, the group sends spear-phishing emails with malicious attachments created with the help of the infamous 'Royal Road' RTF exploitation toolkit, which is known to be shared by different threat actors. Finally, we will share more intelligence about the attacker’s infrastructure and targets, as well as likely connections and overlaps with other known threat actors. He has been hunting malware and performing incident response investigations for years. It also helped us find additional links to known threat actors. Mapping and monitoring the attacker’s infrastructure allowed us to find interesting custom tools, such as a backend C&C panel for controlling infected machines. We will summarize various post-exploitation tools that we noticed the threat actor using.",
            "domain": "www.virusbulletin.com",
            "tokenized": [
                {
                    "sent": "As an infection vector, the group sends spear-phishing emails with malicious attachments created with the help of the infamous 'Royal Road' RTF exploitation toolkit, which is known to be shared by different threat actors.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Finally, we will share more intelligence about the attacker’s infrastructure and targets, as well as likely connections and overlaps with other known threat actors.",
                    "is_evidence": 0
                },
                {
                    "sent": "He has been hunting malware and performing incident response investigations for years.",
                    "is_evidence": 0
                },
                {
                    "sent": "It also helped us find additional links to known threat actors.",
                    "is_evidence": 0
                },
                {
                    "sent": "Mapping and monitoring the attacker’s infrastructure allowed us to find interesting custom tools, such as a backend C&C panel for controlling infected machines.",
                    "is_evidence": 0
                },
                {
                    "sent": "We will summarize various post-exploitation tools that we noticed the threat actor using.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.secureworld.io/industry-news/group-ib-chinese-tonto-team-cyberattack",
            "content": "\"The attackers used phishing emails to deliver malicious Microsoft Office documents created with the Royal Road Weaponizer, a tool widely used by Chinese nation-state threat actors.\" Cybersecurity firm Group-IB successfully defended against a targeted attack by the Chinese state-sponsored Tonto Team, one of the world's most advanced persistent threat (APT) actors. Here are some of the key findings from Group-IB: \"In June 2022, the Group-IB Managed XDR solution detected and blocked an attempt to deliver a malicious email to Group-IB's employees.\" However, companies like Group-IB are staying ahead of these threats by implementing effective cybersecurity measures and keeping up-to-date with the latest tactics used by APT actors. Therefore, organizations in these sectors need to stay up to date with ever-evolving tools, tactics, and methods of threat actors and employ Group-IB Managed XDR for advanced threat detection and response. Tonto Team will likely continue to target IT and cybersecurity companies through spear-phishing and the delivery of malicious documents using vulnerabilities and decoys.",
            "domain": "www.secureworld.io",
            "tokenized": [
                {
                    "sent": "\"The attackers used phishing emails to deliver malicious Microsoft Office documents created with the Royal Road Weaponizer, a tool widely used by Chinese nation-state threat actors.\"",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Cybersecurity firm Group-IB successfully defended against a targeted attack by the Chinese state-sponsored Tonto Team, one of the world's most advanced persistent threat (APT) actors.",
                    "is_evidence": 0
                },
                {
                    "sent": "Here are some of the key findings from Group-IB: \"In June 2022, the Group-IB Managed XDR solution detected and blocked an attempt to deliver a malicious email to Group-IB's employees.\"",
                    "is_evidence": 0
                },
                {
                    "sent": "However, companies like Group-IB are staying ahead of these threats by implementing effective cybersecurity measures and keeping up-to-date with the latest tactics used by APT actors.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Therefore, organizations in these sectors need to stay up to date with ever-evolving tools, tactics, and methods of threat actors and employ Group-IB Managed XDR for advanced threat detection and response.",
                    "is_evidence": 0
                },
                {
                    "sent": "Tonto Team will likely continue to target IT and cybersecurity companies through spear-phishing and the delivery of malicious documents using vulnerabilities and decoys.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        }
    ]
}