{
    "event_id": "143",
    "claim": "TeamTNT is a threat group that has primarily targeted cloud and containerized environments. The group as been active since at least October 2019 and has mainly focused its efforts on leveraging cloud and container resources to deploy cryptocurrency miners in victim environments.",
    "original_label": "true",
    "label": "true",
    "explain": "TeamTNT is a threat group that was known for primarily targeting the cloud and container environments around the world. This group has been documented to leverage the cloud and container resources by deploying cryptocurrency miners in the victim environments. While the group has been active since 2019 and announced it was quitting in 2021, our recent observations make it appear as if TeamTNT has returned — or a copycat group imitating the routines of TeamTNT — and has been deploying an XMRig cryptocurrency miner. Analysis of the attack patterns and other technical details of the code has also led us to believe that the routines are mimicking TeamTNT’s arsenal, but are likely deployed by another cryptocurrency mining group named WatchDog.We tracked the majority of these IP addresses to have established connections from China while one came from Germany, making a series of requests to the exposed Docker API as follows: The initial request made was to get the Docker version information.As seen in the User-Agent header field, this request seems like TeamTNT is using the legitimate utility ZGrab to scan for publicly exposed Docker API servers. Go-developed ZGrab is a banner-grabbing tool that is currently being deprecated. A newer version called ZGrab2 is the open-source tool currently available in GitHub. We observed the older utility being used in the malicious sample we analyzed. Once the request identifies the available servers, the routine moves to the next steps. A ping request checks if the API server is live.Once the ping response is positive, the attackers perform a request to deploy the /containers/create endpoint to deploy an alpine-based container with instructions to download and execute the malicious shell script. Once the container deployment is successful, the attacker requests the Docker Daemon API to attach to the container and start it.The cronb.sh script is the first payload deployed by the attacker. We analyzed this script performing many actions, downloading multiple shell scripts and an XMRIG miner, and compiling the Base64-encoded c code, among others. In this section, we summarize the actions performed by the script.The beginning functions of the script contains the command and control (C&C) server IP and port details.The check_exist function checks if the miner process is running on the defined port 1414 with the help of netstat.The m_command function’s script sets the path of wget, curl, and chattr utilities. This process renames the chattr utility to zzhcht, probably so that other miners or malware would not be able to use this utility.The threat actor also hijacks the various system binaries, creates custom processes, and renames them with a tnt prefix, or TNTcurl, curltnt, and tntrecht suffixes. In this function, the script also checks if the binaries tntcurl or curltnt exists or not, and adds their path as environment variables. This has also been documented previously and attributed to TeamTNT.The ins_function function calls three functions after validating the package managers used in the operating system (OS) to install tools like gcc, make, and kmod to compile and install the source codes of rootkit and process hider code.In this function, the script configures the network settings to use the IP addresses 8[.]8[.]8[.]8 and 8[.]8[.]4[.]4 as the domain name system (DNS) servers via updating /etc/resolv.conf file by changing the file permissions to make it mutable. The said addresses are Google DNS servers.The download_f function downloads the XMRig miner xm.tar as crypto and the configuration file config.json as [cmake].pid, which contains the pool server IP address under the /usr/share directory.The setup_s function installs the configuration file [cmake].pid as a service in the system under path .The makesshaxx function’s script adds the attacker’s secure shell (SSH) public key in the files /root/.ssh/authorized_keys and /root/.ssh/authorized_keys2. The SSH public key we found: ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmEFN80ELqVV9enSOn+05vOhtmmtuEoPFhompw+bTIaCDsU5Yn2yD77Yifc/yXh3O9mg76THr7vxomguO040VwQYf9+vtJ6CGtl7NamxT8LYFBgsgtJ9H48R9k6H0rqK5Srdb44PGtptZR7USzjb02EUq/15cZtfWnjP9pKTgscOvU6o1Jpos6kdlbwzNggdNrHxKqps0so3GC7tXv/GFlLVWEqJRqAVDOxK4Gl2iozqxJMO2d7TCNg7d3Rr3w4xIMNZm49DPzTWQcze5XciQyNoNvaopvp+UlceetnWxI1Kdswi0VNMZZOmhmsMAtirB3yR10DwH3NbEKy+ohYqBL root@puppetserver A quick Google search showed that this key was previously used in other scripts related to Docker container attacks.The clean_monitor function’s script disables various OS’ security and logging features: Clears the firewall rules from iptables Clears the bash history Disables SELinux, watchdog, AppArmor, and firewall service Uninstalls aegis (Alibaba’s cloud security agent), aliyun (Alibaba’s Cloud Monitor Service), and qcloud (Tencent Cloud's qcloud agents) services.The clean_cron function’s script makes the cron files mutable and removes all the existing cron jobs from /etc/crontab, /var/spool/cron, /etc/cron.d, and /var/spool/cron/crontabs to disrupt the existing malware functionalities, as well as the legitimate system functionalities.The lock_cron function’s script makes the files immutable again by changing the attributes of the cron files, reversing the previous action so no one else can change those.The exec_hide function’s script checks that the rootkit is installed first or not. If not present, then it calls another function hide_f() to install the rootkit. In the function hide_f(), it decodes the Base64 encoded .tar file and compiles it under the directory /usr/share/..hide, and installs it as a kernel module with the help of the insmod command.This is the other method the cybercriminals used to hide the processes via modifying the libc. This method uses an old technique to hide the specific process read in the /proc directory. The malicious code is encoded in Base64, the script decodes and compiles it as shared object file, and updates the /etc/ld.so.preload file.The clmo function’s script checks whether the current system is an instance in Alibaba cloud or not, disables the AliSecGuard, and stops aliyun and aegis services.This is the function responsible for lateral movement via SSH and deploys the b.sh file in the remote SSH server. This b.sh file is the same as this cronb.sh file. In the same system, it downloads the s.sh script and executes it. This script is responsible for: nstalling ZGrab, an application layer scanner, to scan the Docker services. Installing pnscan, a port scanner, to scan a whole subnet for a Redis server. Installing masscan, another port scanner, to scan for a Redis server. Installing various utilities from the OS package repositories like iptables, unhide, gcc, redis-tools, and Redis server, among others. Downloading the other supporting shell scripts c.sh and d.sh, and installs them as a service. There have also been observations on these tools as being a part of TeamTNT’s arsenal in previous attacks.As mentioned, s.sh installs various tools needed to infect and move around. The c.sh and d.sh scripts make use of those tools. The c.sh script allows the threat actor to perform these actions: Create a firewall rule in iptables for the Redis-server communication .Utilizes all the scanning tools downloaded by the previous script (s.sh). Adds the following cron job instruction into a .dat file:The d.sh script has the least number of instructions among all the shell scripts used in this routine. This script uses the ZGrab scanner to scan for the available Docker API servers on both TCP ports 2375 (for unencrypted communication with the daemon) and 2376 (for encrypted communication with the daemon) in the network. It then deploys the Alpine Docker image via docker API.The Trend Micro Vision One Workbench App helps analysts see the significant correlated events that are intelligently based on the occurrences that happened throughout the entire fleet of workloads. The left side of the diagram shows the summarized sequence of events happening one after another. Analysts can view the different fields of interest that are considered important and provide security value on the connections seen on the right. The app allows security teams to see the compromised assets and isolate those that can be potentially affected while patching procedures are ongoing.The threat actor goes through a series of actions for deploying the cryptocurrency miner. The routine abuses the Docker infrastructure to infect, download, and run various shell scripts using tools like ZGrab, massscan, pnscan, and Redis to spread in a worm-like fashion to install an XMRig. This attack uses tactics, techniques, and procedures (TTPs) consistent with those of TeamTNT’s, such as the banner and the use of the identified utilities. However, TeamTNT’s behavior is well-known by now, and this does not conclusively identify the group as the threat actor responsible for this sample. Currently, one of the domains used, oracle[.]zzhreceive[.]top, is linked with the cryptocurrency mining group WatchDog, which has been documented utilizing the same domain as TeamTNT. Researchers have also previously observed that “s3f815” and “b2f628” have been used in the directory name convention found in URLs, and the “1.0.4.tar.gz” label used in the file names used by this group. Moreover, since TeamTNT already announced that it was quitting, all these details show that either WatchDog is behind this campaign and likely using the name of TeamTNT, or someone else is mimicking the cybercriminal group. While we do not discount the possibility that TeamTNT can return and using the same routines as well, we will continue to monitor these threats and post updates accordingly.\n\n\n",
    "reports": [
        {
            "link": "https://blog.aquasec.com/new-malware-in-the-cloud-by-teamtnt/",
            "content": "In the beginning of 2020, TeamTNT emerged as a threat actor mainly targeting cloud environments including misconfigured Kubernetes clusters, Docker APIs, Kubernetes UI tools, Redis servers, and more. In the project Dock in the GitHub account, you can see a further link to TeamTNT since most of the code is strikingly similar to the attacks described here. In this attack, though, we see all the old tricks TeamTNT has used over the years including rootkits to hide their activity, cron jobs to gain persistence, cryptominers to hijack resources, ssh and keys theft to conduct lateral movement in the local and external network, and many other techniques seen in the past. In this blog we analyze these attacks and their possible connection to TeamTNT. Regardless of the question if TeamTNT is back or not, we strongly encourage organizations to empower their security teams with Cloud Native Application Protection Platform (CNAPP) solutions that cover various stages of the cloud development pipeline and enable greater visibility and context. What we discovered is that TeamTNT has been scanning for a misconfigured Docker Daemon and deploying alpine, a vanilla container image, with a command line to download a shell script (k.sh) to a C2 server (domain: whatwill[.]be on IP 93[.]95[.]229[.]203).The shell script is cloning a GitHub project from what seems to be a TeamTNT account.",
            "domain": "blog.aquasec.com",
            "tokenized": [
                {
                    "sent": "In the beginning of 2020, TeamTNT emerged as a threat actor mainly targeting cloud environments including misconfigured Kubernetes clusters, Docker APIs, Kubernetes UI tools, Redis servers, and more.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In the project Dock in the GitHub account, you can see a further link to TeamTNT since most of the code is strikingly similar to the attacks described here.",
                    "is_evidence": 0
                },
                {
                    "sent": "In this attack, though, we see all the old tricks TeamTNT has used over the years including rootkits to hide their activity, cron jobs to gain persistence, cryptominers to hijack resources, ssh and keys theft to conduct lateral movement in the local and external network, and many other techniques seen in the past.",
                    "is_evidence": 0
                },
                {
                    "sent": "In this blog we analyze these attacks and their possible connection to TeamTNT.",
                    "is_evidence": 0
                },
                {
                    "sent": "Regardless of the question if TeamTNT is back or not, we strongly encourage organizations to empower their security teams with Cloud Native Application Protection Platform (CNAPP) solutions that cover various stages of the cloud development pipeline and enable greater visibility and context.",
                    "is_evidence": 0
                },
                {
                    "sent": "What we discovered is that TeamTNT has been scanning for a misconfigured Docker Daemon and deploying alpine, a vanilla container image, with a command line to download a shell script (k.sh) to a C2 server (domain: whatwill[.]be on IP 93[.]95[.]229[.]203).The shell script is cloning a GitHub project from what seems to be a TeamTNT account.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://unit42.paloaltonetworks.com/black-t-cryptojacking-variant/",
            "content": "Black-T follows the traditional TeamTNT tactics, techniques and procedures (TTPs) of targeting exposed Docker daemon APIs and performing scanning and cryptojacking operations on vulnerable systems of affected organizations. By using the AWS credentials obtained from the exposed and compromised Docker daemon system, TeamTNT actors could use this system as a pivot point to gain access to additional cloud systems and resources that use the same AWS credentials and which are hosted within the system’s larger AWS environment. In order to protect cloud systems from TeamTNT’s Black-T cryptojacking malware, organizations should perform the following actions: Ensure that cloud environments are not exposing Docker daemon APIs or any other network service, which inadvertently exposes sensitive internal network services. TeamTNT is a cloud-focused cryptojacking group which targets exposed Docker daemon APIs. The Black-T script is downloaded from the TeamTNT domain, hxxps://teamtnt[.]red/BLACK-T/SetUpTheBLACK-T, to the compromised cloud system that maintained an exposed Docker daemon API. Upon successful identification and exploitation of the Docker daemon API, TeamTNT will drop the new cryptojacking variant Black-T. This variant installs up to three different types of network scanners (masscan, pnscan and zgrab), which are used to scan for additional exposed Docker daemon APIs.",
            "domain": "unit42.paloaltonetworks.com",
            "tokenized": [
                {
                    "sent": "Black-T follows the traditional TeamTNT tactics, techniques and procedures (TTPs) of targeting exposed Docker daemon APIs and performing scanning and cryptojacking operations on vulnerable systems of affected organizations.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "By using the AWS credentials obtained from the exposed and compromised Docker daemon system, TeamTNT actors could use this system as a pivot point to gain access to additional cloud systems and resources that use the same AWS credentials and which are hosted within the system’s larger AWS environment.",
                    "is_evidence": 0
                },
                {
                    "sent": "In order to protect cloud systems from TeamTNT’s Black-T cryptojacking malware, organizations should perform the following actions: Ensure that cloud environments are not exposing Docker daemon APIs or any other network service, which inadvertently exposes sensitive internal network services.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "TeamTNT is a cloud-focused cryptojacking group which targets exposed Docker daemon APIs.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The Black-T script is downloaded from the TeamTNT domain, hxxps://teamtnt[.]red/BLACK-T/SetUpTheBLACK-T, to the compromised cloud system that maintained an exposed Docker daemon API.",
                    "is_evidence": 0
                },
                {
                    "sent": "Upon successful identification and exploitation of the Docker daemon API, TeamTNT will drop the new cryptojacking variant Black-T. This variant installs up to three different types of network scanners (masscan, pnscan and zgrab), which are used to scan for additional exposed Docker daemon APIs.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.lacework.com/blog/taking-teamtnt-docker-images-offline/",
            "content": "Docker images containing TeamTNT malware are being hosted in public Docker repos via account takeovers. It is believed that TeamTNT leveraged this configuration file to upload malicious Docker images to this user’s Docker Hub account (T1525). TeamTNT continues to target cloud infrastructure in order to gain access, perform Cryptojacking operations and exfiltrate cloud secrets. TeamTNT leverages exposed Docker hub secrets within GitHub to stage malicious Docker images. TeamTNT targets exposed Docker API to deploy malicious images. Upon inspecting this Docker image, TeamTNT utilities were identified within containers from the Docker hub account “Megawebmaster”.",
            "domain": "www.lacework.com",
            "tokenized": [
                {
                    "sent": "Docker images containing TeamTNT malware are being hosted in public Docker repos via account takeovers.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "It is believed that TeamTNT leveraged this configuration file to upload malicious Docker images to this user’s Docker Hub account (T1525).",
                    "is_evidence": 0
                },
                {
                    "sent": "TeamTNT continues to target cloud infrastructure in order to gain access, perform Cryptojacking operations and exfiltrate cloud secrets.",
                    "is_evidence": 0
                },
                {
                    "sent": "TeamTNT leverages exposed Docker hub secrets within GitHub to stage malicious Docker images.",
                    "is_evidence": 0
                },
                {
                    "sent": "TeamTNT targets exposed Docker API to deploy malicious images.",
                    "is_evidence": 0
                },
                {
                    "sent": "Upon inspecting this Docker image, TeamTNT utilities were identified within containers from the Docker hub account “Megawebmaster”.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.tigera.io/blog/teamtnt-latest-ttps-targeting-kubernetes/",
            "content": "Evolving Tactics, Techniques and Procedures (TTPs) TeamTNT’s initial attack targeted an exposed, unprotected Docker API on the internet in order to run an Alpine Linux container. Mass internet scanning is part of TeamTNT’s general technique: identifying previous attack surfaces where they targeted Docker APIs. Since this first attack, TeamTNT has continuously evolved its tactics and added capabilities to expand and capture more available cloud attack surfaces. TeamTNT uses red teaming tools from projects like Peirates and BOtB that have container breakout and information scraping capabilities. Trend Micro later confirmed that these files were part of the first cryptojacking malware by TeamTNT, a cybercrime group that specializes in attacking the cloud—typically using a malicious Docker image—and has proven itself to be both resourceful and creative. With relative ease, TeamTNT quickly exploited the broader attack surface available in the cloud and started implementing new capabilities, with the end goal being cryptomining.",
            "domain": "www.tigera.io",
            "tokenized": [
                {
                    "sent": "Evolving Tactics, Techniques and Procedures (TTPs) TeamTNT’s initial attack targeted an exposed, unprotected Docker API on the internet in order to run an Alpine Linux container.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Mass internet scanning is part of TeamTNT’s general technique: identifying previous attack surfaces where they targeted Docker APIs.",
                    "is_evidence": 0
                },
                {
                    "sent": "Since this first attack, TeamTNT has continuously evolved its tactics and added capabilities to expand and capture more available cloud attack surfaces.",
                    "is_evidence": 0
                },
                {
                    "sent": "TeamTNT uses red teaming tools from projects like Peirates and BOtB that have container breakout and information scraping capabilities.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Trend Micro later confirmed that these files were part of the first cryptojacking malware by TeamTNT, a cybercrime group that specializes in attacking the cloud—typically using a malicious Docker image—and has proven itself to be both resourceful and creative.",
                    "is_evidence": 0
                },
                {
                    "sent": "With relative ease, TeamTNT quickly exploited the broader attack surface available in the cloud and started implementing new capabilities, with the end goal being cryptomining.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        }
    ]
}