{"url": "www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "text": "If you are what you eat, then so is your nursing baby. You want to give them only the best nutrition and avoid foods that may cause harm. But with so much conflicting information out there, it's not uncommon for breastfeeding parents to swear off entire food groups out of fear.\n\nGood news: The list of foods to avoid while breastfeeding isn't as long as you may have thought. Why? Because the mammary glands that produce your milk and your milk-producing cells help regulate how much of what you eat and drink actually reaches your baby through your milk.\n\nRead on to get the verdict on alcohol, caffeine, and other foods that were taboo during pregnancy before you start scratching anything off the menu while you're nursing.\n\nSpicy Food While Breastfeeding\n\nVerdict: Safe\n\nThere is no evidence that eating spicy foods, including garlic, causes colic, gas, or fussiness in babies. Not only is spicy food safe to eat while breastfeeding, but you don't have to worry about adding some heat to your favorite foods, says Paula Meier, PhD, director for clinical research and lactation in the neonatal intensive care unit at Rush University Medical Center in Chicago and president of the International Society for Research in Human Milk and Lactation.\n\nBy the time the baby is breastfeeding, Dr. Meier says, they are accustomed to the flavors their parent eats. \"If a mother has eaten a whole array of different foods during pregnancy, that changes the taste and smell of amniotic fluid that the baby is exposed to and is smelling in utero,\" she says. \"And, basically, the breastfeeding is the next step going from the amniotic fluid into the breast milk.\"\n\nIn fact, some items that parents choose to avoid while breastfeeding, such as spices and spicy foods, are actually enticing to babies. In the early '90s, researchers Julie Mennella and Gary Beauchamp performed a study in which mothers breastfeeding their babies were given a garlic pill while others were given a placebo. The babies nursed longer, sucked harder, and drank more garlic-scented milk than milk without garlic.\n\nParents often restrict their diet if they suspect a correlation between something they ate and the child's behavior—gassy, cranky, etc. But while that cause-and-effect might seem enough, Dr. Meier says she would want to see more direct evidence before making any diagnosis.\n\n\"To truly say that a baby had something that was milk-related, I would want to see issues with the stools not being normal,\" Dr. Meier explains. \"It's very, very rare that a baby would have something that would truly be a contraindication to the mother's breastfeeding.\"\n\nAlcohol While Breastfeeding\n\nVerdict: Safe in moderation\n\nWhile the Centers for Disease Control and Prevention still recommends pregnant people avoid consuming alcohol, once your baby is born, the rules on alcohol change! Having one to two alcoholic drinks a week—the equivalent of a 12-ounce beer, 4-ounce glass of wine, or 1 ounce of hard liquor—is safe, according to experts. While alcohol does pass through breast milk, it's usually in tiny amounts.\n\nIn terms of timing, keep this advice in mind: As soon as you don't feel the effects of alcohol anymore, it's safe to feed, says Liz Pevytoe, a registered nurse, certified lactation consultant, and founder of askthelactationconsultant.com.\n\nCaffeine While Breastfeeding\n\nVerdict: Safe in moderation\n\nConsuming coffee, tea, and caffeinated sodas in moderation is fine when you are breastfeeding, according to HealthyChildren.org. Breast milk usually contains less than 1% of the caffeine ingested by the parent. And if you drink no more than three cups of coffee spread throughout the day, there is little to no caffeine detected in the baby’s urine.\n\nHowever, if you feel that your infant becomes more fussy or irritable when you consume excessive amounts of caffeine (usually more than five caffeinated beverages per day), consider decreasing your intake or waiting to reintroduce caffeine until your infant is older.\n\nStudies have shown that by 3- to 6-months of age, most infants’ sleep wasn’t adversely affected by a breastfeeding parent's caffeine consumption.\n\n\"Based on the clinical evidence avail­able, I advise my patients to wait until their infant is at least three months old to reintroduce caffeine into their diet, and then watch their baby for any signs of discomfort or restlessness,\" says Alicia C. Simpson, MS, RD, IBCLC, LD, in an excerpt from her book, Boost Your Breast Milk: An All-In-One Guide for Nursing Mothers to Build a Healthy Milk Supply. \"For moms who work outside the home, I suggest that you always label any pumped milk that you have expressed after consum­ing caffeine to ensure that the infant is not given this milk right before naptime or bedtime.\"\n\nWhile coffee, tea, chocolate, and soda are obvious sources of caffeine, there are also significant amounts of caffeine in coffee- and chocolate-flavored foods and beverages. Even decaffeinated coffee has some caffeine in it, so keep this in mind if your baby is es­pecially sensitive to it.\n\nSushi While Breastfeeding\n\nVerdict: Safe in moderation\n\nIf you have been waiting patiently for 40 weeks to eat sushi, you can rest assured that sushi not containing high-mercury fish is considered safe while breastfeeding. This is due to the fact that the Listeria bacteria, which can be found in undercooked foods, is not transmitted readily through breast milk, according to Simpson.\n\nHowever, if you choose to eat one of these low-mercury sushi options while breastfeeding, keep in mind that no more than two to three servings (a maximum of twelve ounces) of low-mercury fish should be eaten in a week. Fish that tend to contain low levels of mercury include salmon, flounder, tilapia, trout, pollock, and catfish.\n\nHigh-Mercury Fish While Breastfeeding\n\nVerdict: Avoid\n\nWhen cooked in a healthy manner (such as baking or broiling), fish can be a nutrient-rich component of your diet. However, due to a wide array of factors, most fish and other seafood also contain unhealthy chemicals, particularly mercury. In the body, mercury can accumu­late and quickly rise to dangerous levels. High levels of mercury prin­cipally affect the central nervous system, causing neurological de­fects.\n\nFor this reason, the US Food and Drug Administration (FDA), Environmental Protection Agency (EPA), and WHO have all cau­tioned against the consumption of high-mercury foods for pregnant women, nursing mothers, and chil­dren. As mercury is considered by the WHO to be one of the top ten chemicals of major public health concern, there are also specific guidelines set forth by the EPA for healthy adults based on weight and gender.\n\nOn the list to avoid: tuna, shark, swordfish, mackerel, and tilefish all tend to have higher levels of mercury and should always be skipped while breastfeeding.", "images": ["https://www.parents.com/thmb/A-v54rrMH1bDPxLmH21_T8B7kbI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1202450273-2dc1feef886d498c8499ee344ef7b882.jpg", "https://www.parents.com/thmb/XcueV7Q40X86axlx-Re2rd3Ptw0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/4ThingstoAvoidWhenBreastfeedingSTILL-718379ed057f4131b99af96f1f335263.jpg", "https://www.parents.com/thmb/HafHOlvg0UVZ7WSw01ra2394CVw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/p_iStock_000003158936-b6b5ffea49c84dd599432819bf3a27a4.jpg", "https://www.parents.com/thmb/JcmJf_DGoT1yDT8NkDkrXhDl2wg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/211207-Illustrations-Black-Fetus-in-Utero-2000-4cfb977c8f634364a1b078962c7446ce.jpg", "https://www.parents.com/thmb/ytblgfJF7XiBXtbxYVaMNBgkImU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1267751436-2000-47e5e649e8a04ab89ce48291170f677a.jpg", "https://www.parents.com/thmb/TbXvD_3aG3zp4YzgHDaLzW_mx60=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Parents-GettyImages-1368174043-bed48c2902114a5f854877a1f0de3961.jpg", "https://www.parents.com/thmb/ylao6gdYNtn7rpvQA0sWm8dYgRo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1382274869-2000-ab491d9b1bef4947ad9ced2e81b29750.jpeg", "https://www.parents.com/thmb/7IcY9DN5xx8sdMG_Pjey77zAG-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/parents-update-best-prenatal-vitamins-tout-1427059d52f5462286a2b924e5fd4636.jpg", "https://www.parents.com/thmb/OoPCTdWoi1TzWN0BRtpJxW-_XbM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1305781865-2000-b41668aa4bc64411ae9bd1dded761a4f.jpg", "https://www.parents.com/thmb/xBiiRuxVnF-DDzS3sh1D6K6X2Ss=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-56295086-1ca4c661c62f47bba9ffe7cf4be75767.jpg", "https://www.parents.com/thmb/Krl0SHzLrT1M09dbbNFa0RZndMQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/BreastfeedingSupplies-AdobeStock_670098497-88172cf059c246bcb26551b7cfabac0f.jpeg", "https://www.parents.com/thmb/ckbJzQRBLxve6emqY8z9qUUOHUU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/fresh-salmon-with-spices-2c8b82deaff64490b6c19ff5cdd75832.jpg", "https://www.parents.com/thmb/Lu8qE33mxmcGf4hyZAqWfe5j4cw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Parents-GettyImages-1145284582-161e3519f4864f1281f58d7686165cbc.jpg", "https://www.parents.com/thmb/8SnUy6lfEm3xcGrHEasnZICpXYs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1157712696-6a34a82bce604ebe89c768fd91f00355.jpg", "https://www.parents.com/thmb/tkTIsY4CqIrOIKq3BTMOXLtHSrI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Parents_PregnancyTrackerLeadImage25-917e9b9c997b4443858fb10512e2d4d3.jpg", "https://www.parents.com/thmb/ozdk_Ql_Y7zI-ePKVf6skOzuUyM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Parents-GettyImages-1310067046-badd557b764e4f0299647b0bbd70b6e4.jpg", "https://www.parents.com/thmb/fz3s1GjLyFbCSkI188Vu6EaRqqw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/What20to20eat20when20trying20to20get20pregnant_STILL-33de3b6204704cb4afe1b4bf86e21034.jpg"], "top_img": "https://www.parents.com/thmb/ylao6gdYNtn7rpvQA0sWm8dYgRo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1382274869-2000-ab491d9b1bef4947ad9ced2e81b29750.jpeg", "keywords": [], "authors": ["Kate Silver", "Marra Francis"], "canonical_link": "https://www.parents.com/baby/care/what-foods-should-i-avoid-while-breastfeeding/", "title": "Foods to Avoid While Breastfeeding—And Ones That Are Safe", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From alcohol to sushi, caffeine to spicy food, get the final word on what you can and can't eat when you're breastfeeding.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PARENTS", "sailthru.author": "Kate Silver", "parsely-section": "Babies", "parsely-tags": "Parents,Babies", "article": {"section": "Parents", "author": "https://www.facebook.com/parents/"}, "fb": {"app_id": 206760937387333}, "og": {"type": "article", "site_name": "Parents", "url": "https://www.parents.com/baby/care/what-foods-should-i-avoid-while-breastfeeding/", "title": "Foods to Avoid While Breastfeeding—And Ones That Are Safe", "description": "From alcohol to sushi, caffeine to spicy food, get the final word on what you can and can't eat when you're breastfeeding.", "image": "https://www.parents.com/thmb/ylao6gdYNtn7rpvQA0sWm8dYgRo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1382274869-2000-ab491d9b1bef4947ad9ced2e81b29750.jpeg"}, "twitter": {"card": "summary_large_image", "site": "@parents", "title": "Foods to Avoid While Breastfeeding—And Ones That Are Safe", "description": "From alcohol to sushi, caffeine to spicy food, get the final word on what you can and can't eat when you're breastfeeding.", "image": "https://www.parents.com/thmb/NuDnXNVUpyuSwuRMyFW-9UlhF-s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1259x745:1261x747)/GettyImages-1382274869-2000-ab491d9b1bef4947ad9ced2e81b29750.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.165.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.165.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.165.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.165.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.165.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://www.parents.com", "summary": ""}