{"url": "http://www.newslocker.com/en-us/news/celebrity/chris-pratt-gushes-over-perfect-anna-faris-jokes-about-his-boob-sweat/", "text": "Drea De Matteo Shares How OnlyFans 'Saved' Her Life Drea De Matteo is opening up about her experience on OnlyFans.\n\nIn a new interview, the 52-year-old The Sopranos actress admitted that while she at first had hesitations about joining the adult subscription platform, it ended up saving her from financial ruin.\n\nKeep reading to find out more…After losing acting jobs and running low on money, Drea decided to sign up for OnlyFans and within just minutes of launching her account, she made a lifesaving amount of money.\n\n“They put me into f Read more\n\nWill Smith & Martin Lawrence Pal Around on Set of 'Bad Boys 4' After Filming Major Scene Will Smith is having a busy week on the set of Bad Boys 4.\n\nThe 55-year-old movie star was spotted having a great time on set with costar Martin Lawrence as they filmed in Miami, Florida on Wednesday (February 28).Dressed in monochromatic blue, Will and Martin, who wore a bomber jacket, reclined against a car. They were also photographed interacting with fans in between takes.Their day of hard work on set comes after Will was spotted filming a major scene earlier this week!Read more about Will S Read more\n\nColourPop Announces 'Twilight' Makeup Collection, & It Restocks on Leap Day ColourPop Cosmetics has created a makeup collection that Twilight lovers are dying to sink their teeth into.Fans of the beloved vampire franchise are getting the makeup collaboration of their dreams – a collection of products inspired by the popular film franchise starring Kristen Stewart, Robert Pattinson and Taylor Lautner!\n\nAfter selling out almost instantly earlier this year, the collection is restocking on Leap Day. We’ve got all of the details.\n\nHead inside to see ColourPop Cosm Read more\n\nJustin Timberlake Shares Big *NSYNC News While Teasing His New Album Justin Timberlake‘s about to make *NSYNC fans very happy!\n\nThe 43-year-old “Can’t Stop the Feeling” hitmaker took to social media on Wednesday (February 28) to tease details about his new album Everything I Thought It Was. In the process, he seemingly confirmed that *NSYNC was making an appearance on the tracklist.Keep reading to find out more…\n\nTaking to TikTok, Justin shared a new video reacting to a comment from a fan. The comment read: “Blink twice if *NSY Read more\n\nAli Wong & Boyfriend Bill Hader Keep Close on Morning Breakfast Date in Los Angeles Ali Wong and Bill Hader are enjoying a quiet breakfast date.\n\nThe cute couple linked arms as they left Brentwood’s Farmshop after grabbing a bite to eat on Wednesday morning (February 28) in Los Angeles.\n\nPHOTOS: Check out the latest pics of Ali Wong\n\nFor their morning outing, Ali, 41, wore a long black coat over a red and white striped shirt paired with tan pants while Bill, 45, sported a black jacket and gray sweatpants.\n\nThe couple’s breakfast outing comes just days after Ali won awa Read more\n\nNicholas Galitzine & Julianne Moore Rule the Red Carpet at 'Mary & George' Premiere Nicholas Galtizine and Julianne Moore rule over the red carpet at the premiere of their eye-popping new series Mary & George.\n\nThe costars posed together outside Banqueting House on Wednesday (February 28) in London, England.If you were unaware, the limited series centers on the pair who play “a treacherous mother and son who schemed, seduced and killed to conquer the Court of England and the bed of King James I.”\n\nKeep reading to find out more…\n\nJulianne brings Mary Villier Read more\n\nPalace Issues New Kate Middleton Update Amid Concerns About Her Extended Absence Kensington Palace issued a new update on Princess Catherine (aka Kate Middleton) amid her extended absence from the public eye.The 42-year-old Princess of Wales underwent a “planned abdominal surgery” earlier this year. At the time, it was confirmed that she would be taking a break to recover.However, as the weeks go on, there have been increased concerns about her wellbeing. Kensington Palace issued a statement on her recovery this week after her husband Prince William dropped out Read more\n\nAdam Sandler Reveals One Celeb Who Makes Him 'A Little Jumpy' To Be Around Adam Sandler is a celebrity to a lot of celebrities, after being in the business for decades!\n\nHowever, the 57-year-old funny man has revealed that there is one star who makes him nervous to be around.\n\nThe reason this person makes him “a little jumpy” actually has to do with his daughters, Sadie and Sunny.\n\nKeep reading to find out who…\n\n“You know what, Taylor Swift, because what she means to my kids, I get it a little jumpy,” Adam revealed on SiriusXM’s Conan Read more\n\nChris Evans Dating History Revealed: Every Rumored Romance & Confirmed Ex-Girlfriend! Chris Evans‘ love life is definitely a popular subject among fans!\n\nThe 42-year-old Captain America actor got people talking at the end of 2022 with his latest romance, and it all had to do with a Halloween post about pumpkins. Find out what originally happened!\n\nWe’re taking a look back at all the famous ladies he has been with in relationships, as well as some of the heavily rumored romances.\n\nClick through the slideshow to see all of the famous women Chris Evans has dated over the y Read more\n\nZoe Lister-Jones Comes Out as Queer After Divorce, Reveals New Relationship With Sammi Cohen Zoe Lister-Jones is coming out.\n\nThe 41-year-old actress and filmmaker spoke to THR at the Spirit Awards on Sunday (February 25), where she opened up about her romantic life.\n\n“I’m here, I’m queer, I have some fear but I’m working through it,” she told the outlet as she revealed her new relationship with filmmaker Sammi Cohen.\n\nKeep reading to find out more…\n\nThe announcement comes after her divorce from artist and filmmaker Daryl Wein, who she was married to fr Read more\n\nRichard Lewis Dead - 'Curb Your Enthusiasm' Comedian Was 76 Comedian and actor Richard Lewis has sadly died at the age of 76.\n\n“Richard Lewis passed away peacefully at his home in Los Angeles last night after suffering a heart attack. His wife, Joyce Lapinsky, thanks everyone for all the love, friendship and support and asks for privacy at this time,” his rep confirmed to TV Line.\n\nMost recently, he appeared in HBO’s hit comedy Curb Your Enthusiasm alongside Larry David. He’s also been known for other TV and film projects, like Rob Read more", "images": ["http://www.newslocker.com/images/share-twitter.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017321/rs_600x600-170421134134-600.Anna-Faris-Chris-Pratt-Hollywood-Star.ms.042117.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2024/02/29/310390783_725.jpg", "https://img4.newslocker.com/2024/02/29/310388945_725.jpg", "https://img4.newslocker.com/2024/02/29/310388949_725.jpg", "https://img4.newslocker.com/2024/02/29/310388962_725.jpg", "https://img4.newslocker.com/2024/02/29/310388961_725.jpg", "https://img4.newslocker.com/2024/02/29/310378737_350.jpg", "https://img4.newslocker.com/2024/02/29/310388943_725.jpg", "https://img4.newslocker.com/2024/02/29/310388956_725.jpg", "https://img4.newslocker.com/2024/02/29/310388952_725.jpg", "https://img4.newslocker.com/2024/02/29/310388948_725.jpg", "https://img4.newslocker.com/2024/02/29/310390784_725.jpg", "https://img4.newslocker.com/2024/02/29/310388955_725.jpg", "https://img4.newslocker.com/2024/02/29/310388953_725.jpg", "https://img4.newslocker.com/2024/02/29/310376367_350.jpg", "https://img4.newslocker.com/2024/02/29/310388951_725.jpg", "https://img4.newslocker.com/2024/02/29/310376366_350.jpg", "https://img4.newslocker.com/2024/02/29/310388954_725.jpg", "https://img4.newslocker.com/2024/02/29/310388959_725.jpg", "https://img4.newslocker.com/2024/02/29/310390782_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/share-linkedin.png", "https://img4.newslocker.com/2024/02/29/310388950_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img4.newslocker.com/2024/02/29/310376368_350.jpg", "https://img4.newslocker.com/2024/02/29/310388957_725.jpg", "https://img4.newslocker.com/2024/02/29/310388963_725.jpg", "https://img4.newslocker.com/2024/02/29/310388960_725.jpg", "https://img4.newslocker.com/2024/02/29/310390780_725.jpg", "https://img4.newslocker.com/2024/02/29/310388947_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img4.newslocker.com/2024/02/29/310390781_725.jpg", "https://img4.newslocker.com/2024/02/29/310388958_725.jpg", "https://img4.newslocker.com/2024/02/29/310388944_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017321/rs_600x600-170421134134-600.Anna-Faris-Chris-Pratt-Hollywood-Star.ms.042117.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/chris-pratt-gushes-over-perfect-anna-faris-jokes-about-his-boob-sweat/", "title": "Chris Pratt Gushes Over \"Perfect\" Anna Faris, Jokes About His \"Boob Sweat\"", "meta_data": {"description": "Just this morning, Anna Faris revealed what she finds so sexy about her husband Chris Pratt at the unveiling of his star on the Hollywood Walk of Fame.So when I caught up with him after...", "og": {"title": "Chris Pratt Gushes Over Perfect Anna Faris, Jokes About His Boob Sweat - Celebrity news - NewsLocker", "description": "Just this morning, Anna Faris revealed what she finds so sexy about her husband Chris Pratt at the unveiling of his star on the Hollywood Walk of Fame.So when I caught up with him after...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/chris-pratt-gushes-over-perfect-anna-faris-jokes-about-his-boob-sweat/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017321/rs_600x600-170421134134-600.Anna-Faris-Chris-Pratt-Hollywood-Star.ms.042117.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492811760.0, "source": "http://www.newslocker.com", "summary": ""}