{"url": "www.thehollywoodgossip.com/slideshows/caitlyn-jenner-14-stunning-quotes-from-her-memoir/", "text": "Caitlyn Jenner says she doesn’t really talk to the Kardashians anymore.\n\nAnd the Kardashians have said they don’t really want to talk to Caitlyn, either, mostly due to things she wrote about herself and her family in her new memoir, “The Secrets of My Life.”\n\nWith this book making many headlines and stirring up quite a few controversies, we bought ourselves a copy and jotted down the most revealing Caitlyn Jenner quotes, stories and revelations.\n\nScroll through each below…\n\nShe tried on her mom’s dresses as a child 1 “Even then, I felt the sense of freedom that I would experience 30 or 40 years later in hotel rooms and lobbies.”\n\nFollowing the 1976 Olympics, Jenner dressed in drag for a skit on a Bob Hope special 2 “I have to be careful not to show too much enthusiasm, so I play it cool, guy’s guys dressing up like a woman… Our wigs and dresses are purposely ridiculous. But the red heels I think not only look good on me but also fit, so I steal them after the show.”\n\nHe came out to his first wife by accident 3 “I told Chrystie in 1973 about my gender issues. It wasn’t by choice: she was putting clothes away and noticed a rubber band on one of the hooks of her bra. When she asked me about it, my first response was noncommittal.”\n\nHer marriage to second wife, Linda, ended when she caught him in women’s clothing 4 “In that room I felt she was revolted by me. I know she did not mean to, but her reaction was my greatest fear realized.”\n\nA friend once spotted Caitlyn, dressed in drag while driving his Porsche, forcing Jenner to say he was wearing a costume for Halloween 5 “I’m driving on Santa Monica Boulevard… and am at a stoplight when my next-door neighbor pulls up to me. I can tell he is surprised… it was a close call.”\n\nShe uses household items to help her look more feminine, such as when it comes to sticking her wig on tightly 6 “There is only one drawback to Krazy Glue: it can sometimes stick to your skin so much that it takes a little piece of skin with it when you pull it off.”\n\nIn the 1980s, Jenner set aside a bedroom in her home strictly for her women’s clothing collection 7 “My mom visits me once, sees them, and is happy I have a girlfriend.”\n\nA revelation in 1989 prompted her marriage to Kris 8 (Getty) “I stop going through transition in 1989. I can’t do this to my kids. I can’t do this to me. I can’t do this to society. It is not ready. I have to get back in the game. I have to once again establish Bruce as the dominant presence, no matter how much I loathe him. I need cover again…. Which is when Kris Kardashian and Bruce Jenner improbably find each other.”\n\nKris knew Bruce was transgender from day one … according to Caitlyn 9 (Getty) “Let’s not kid ourselves – everyone wants to know, Kris and I [had] good and frequent sex at the beginning,” Caitlyn says, describing the sex as “imbued with love” but admits she wasn’t “entirely comfortable” with the act of making love to Kris Jenner. “I tell Kris about my gender issues before I make love to her. This will always be a subject of dispute between us. She insists that she was taken by surprise by my ultimate transition to Caitlyn, which obviously means in her mind that she did not know enough.”\n\nWhen Caitlyn married Kris, she underwent breast reduction surgery, telling the doctors her boobs were the result of steroid use 10 (Getty) “The procedure is easy. He basically liposuctions them out, and from the vantage point of looking like a normal father I do look much better. But from the vantage point of myself I am sad.”\n\nDuring her marriage to Kris, his other half controls nearly everything 11 “I do not have a checking account. I have a credit card, but purchases are carefully pored over. Kris is incredibly generous – on her terms.”\n\nShe hid in the closet … literally 12 “I have bought makeup how-to books,” Cait recalls. “I keep the [makeup] books, along with my meager collection of clothing, in a small closet with a lock in the back of my closet. Kris and I have negotiated this,” she recalls of that time period, “since she is terrified, as I am, of the kids finding something.”\n\nPost-marriage to Kris, Caitlyn left her four oldest kids behind 13 “I had to do whatever it took to make them a part of my life. I needed to assert myself. But I could not. So I let go of them, which is a softer way of saying I abandoned them. Because I did abandon them.”\n\nCaitlyn believes O.J. Simpson was a killer and says Robert Kardashian agreed 14 (Getty) “[Robert Kardashian] said, ‘I would’ve been okay with it if they had gotten him in the first trial.’ The implication was obvious that he believed O.J. was guilty. [O.J.] was the most narcissistic, egocentric, neediest a–hole in the world of sports I had ever seen, and I had seen a lot of them. I believe he got away with two savage murders.”\n\nThis is what Jenner said Kris told her about being transgender: 15 “Take Caitlyn on the road — but she is not to play in our home or hometown.”\n\nWhy did Caitlyn push the Kardashians aside when she came out? 16 “The Kardashian side feels slighted by their noticeable absence. They are right to feel slighted. They were slighted on purpose because of research showing that any time a Kardashian is on television, many in the public tend to think it is a publicity stunt to make money…. After all of the time it took to get here, I needed to make clear that this was real, this is my life and not some publicity stunt.”\n\nShe chose to officially/physically reassign her gender because… 17 “I just want to have all the right parts. I am also tired of tucking in the damn thing all the time.”\n\nShe’s not focused on her sex life, even if the public is 18 (Getty) “I don’t have the appetite for [sex], which is why the public’s obsession over [my gender confirmation surgery] is annoying. It hearkens back to this misperception that people transition because of their sexual desires.”", "images": ["https://cdn.thehollywoodgossip.com/uploads/2024/02/thg-placeholder.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201692%202560'%3E%3Crect%20width='1692'%20height='2560'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20500'%3E%3Crect%20width='500'%20height='500'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E", "http://cdn.thehollywoodgossip.com/uploads/2022/02/thg-black.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/02/thg-placeholder-335x335.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/02/0223_hannahgosselin_02_crop-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2024/02/Porsha-Williams-1-80x80.jpg", "http://cdn.thehollywoodgossip.com/uploads/2017/01/caitlyn-jenner-in-red-scaled.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/02/0222_wendywilliams_header-80x80.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2080%2080'%3E%3Crect%20width='80'%20height='80'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E", "https://cdn.thehollywoodgossip.com/uploads/2023/10/1004_rhobh_s13_05-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2024/02/0223_andrewlincoln_header-80x80.jpg", "http://cdn.thehollywoodgossip.com/uploads/2017/01/caitlyn-jenner-strikes-a-pose-scaled.jpg", "https://cdn.thehollywoodgossip.com/uploads/2023/10/GettyImages-1095004178-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/02/0223_princeharry_princewilliam_header-80x80.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20335%20335'%3E%3Crect%20width='335'%20height='335'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201781%202560'%3E%3Crect%20width='1781'%20height='2560'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E", "https://cdn.thehollywoodgossip.com/uploads/2023/02/0209_jingerduggar_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-black-150x150.jpg"], "top_img": "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-black-150x150.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.thehollywoodgossip.com/slideshows/caitlyn-jenner-14-stunning-quotes-from-her-memoir/", "title": "Caitlyn Jenner: Read the 19 Most Stunning Quotes From Her Memoir", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Caitlyn Jenner: Read the 19 Most Stunning Quotes From Her Memoir", "description": "Caitlyn Jenner says she doesn't really talk to the Kardashians anymore. And the Kardashians have said they don't really want to talk to Caitlyn, either, mostly due to things she wrote about herself and her family", "url": "https://www.thehollywoodgossip.com/slideshows/caitlyn-jenner-14-stunning-quotes-from-her-memoir/", "site_name": "The Hollywood Gossip", "updated_time": "2022-04-04T19:49:22+00:00"}, "article": {"published_time": "2017-04-25T17:42:25+00:00", "modified_time": "2022-04-04T19:49:22+00:00"}, "twitter": {"card": "summary_large_image", "title": "Caitlyn Jenner: Read the 19 Most Stunning Quotes From Her Memoir", "description": "Caitlyn Jenner says she doesn't really talk to the Kardashians anymore. And the Kardashians have said they don't really want to talk to Caitlyn, either, mostly due to things she wrote about herself and her family", "label1": "Est. reading time", "data1": "6 minutes"}, "description": "Caitlyn Jenner says she doesn't really talk to the Kardashians anymore. And the Kardashians have said they don't really want to talk to Caitlyn,", "generator": "WordPress 6.1.1", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-black-300x300.jpg"}, "movies": [], "publish_date": 1493142145.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}