{"url": "https://www.nowtolove.com.au/celebrity/celeb-news/david-beckham-cheating-rebecca-loos-49125", "text": "The world’s most famous soccer player marries a superstar pop singer, what could possibly go wrong?\n\nAlmost ever since David and Victoria Beckham’s 1999 nuptials, their relationship has been plagued by tales of alleged affairs, most famously the purported affair between David and his former assistant, Rebecca Loos.\n\nVictoria and David Beckham have finally opened up about the cheating roomers in his 2023 Netflix docuseries, ‘Beckham’.\n\nThe couple have always been quick to deny the cheating rumours and 20 years later, whether he did it or not is no longer the issue.\n\nVictoria opened the conversation by revealing, “It was the hardest period because it felt like the world was against us. Here’s the thing – we were against each other if I’m being completely honest,”\n\nDavid and Victoria tried to show a united front in the face of fresh cheating rumours although Victoria reveals during this picture the couple were against each other. (Credit: Getty)\n\n“But when we were in Spain, it didn’t really feel like we had each other either… And that’s sad. I can’t even begin to tell you how hard it was and how it affected me. It was a nightmare.”\n\nThe couple had put up a united front until September, 2003 when he was spotted at a nightclub in Madrid with Rebecca. Then the rumours start.\n\nDavid explained that he felt physically ill when asked if it affected his performance on the field, admitting that there, “were some days I thought, ‘How am I going to go to work? How am I going to go on that training pitch and look as if nothing is wrong?”\n\n“Victoria is everything to me, to see her hurt was incredibly difficult, but we’re fighters and at that time we needed to fight for each other, we needed to fight for our family.”\n\nVictoria admitted, “It was the most unhappy I have ever been in my entire life.”\n\nDavid Beckham got his start at Manchester United, famous for his goal from the halfway line in his own half. It had never been done. (Credit: Getty)\n\nDavid’s alleged affair with assistant Rebecca Loos\n\nIn 2003, David was in the prime of his football career. The England Captain had been sold by his home club Manchester United to Spain’s Real Madrid, for a whopping price. And while his star had never been brighter, a shock was soon to hit the Beckham family.\n\nIn September of that year, David was spotted with a woman at a nightclub in Madrid. The woman was later identified as his assistant Rebecca Loos.\n\nSubsequently, the rumour mill kick-started into overdrive, churning out tales that the Beckham marriage was in trouble, which David denied.\n\nThe now-defunct News Of The World, published a story from “a source” outlining several sexual encounters David and Loos allegedly had after that night at the club.\n\nThey also reported the two exchanged racy texts. The story claimed Victoria contacted the assistant, warning her to stay away.\n\nRebecca Loos reportedly had an affair with David Beckham while the pair were working together in Spain. (Credit: Getty)\n\nRebecca Loos’ brother’s statement\n\nLoos brother then surprised British tabloids by claiming his sister had confirmed to him that she’d had an affair with David in Spain.\n\n“Rebecca phoned home early this morning. I am overwhelmed with shock,” Loos’ brother John Charles told the Daily Mail in April 2004.\n\n“Rebecca was upset when she parted company with David and Victoria last year. She became very down and cried a lot. At times she looked heartbroken. I thought it was because of professional reasons. But now I am beginning to understand there must have been more to it.”\n\nRebecca Loos, Victoria Beckham and her son Romeo watch David play for Real Madrid back in 2003. (Credit: Getty)\n\nWhile explosive allegations of David’s infidelity flew, Victoria reportedly packed up their two children and flew to Switzerland, where David was to meet them from Madrid. Spokespeople for the family said the trip was a long-planned getaway and not a plan to escape media attention.\n\nDavid’s statement on alleged affair\n\nIn response to Loos’ brother’s comments, David released a statement.\n\n“During the past few months I have become accustomed to reading more and more ludicrous stories about my private life,” it read.\n\n“What appeared this morning is just one further example. The simple truth is that I am very happily married. I have a wonderful wife and two very special kids. There is nothing any third party can do to change these facts.”\n\nDuring the time of the cheating rumours, the couple had two children, Brooklyn and Romeo. (Credit: Getty)\n\nRebecca Loos’ tell-all\n\nRebecca gave an explosive tell-all interview with SKY TV alleging her professional relationship turned romantic with David as he grew lonely in Madrid.\n\n“I think the chemistry between David and I was so strong and people were not happy because I was being very unprofessional and he’s a married man,” she said at the time.\n\n“He is very generous lover. He gives a lot. He pleases. He knows what you want. It’s all about you and not so much about him. It’s nice.”\n\nWhen asked about the Beckham’s intention to involved layers, Loos replied, “What are they consulting their lawyers for? What can they do? I think they have worked very hard at getting the image they have and I think they will do everything they can to maintain it.”\n\n“So whether that involves having happy shots taken or calling their lawyers it’s up to them. I am 100 percent sure of what I am talking about, there no doubt in my mind I have no reason to lie — why should I? I am just here to tell you my experience. He knows the truth and I know the truth.”\n\nAgain, Victoria and David vehemently denied Loos’ story calling it “absurd and unsubstantiated”.\n\nVictoria and her two sons, Brooklyn and Romeo relocated to Spain so the family could be together with David.\n\nThe couple have weathered allegations of affairs time and time again. (Credit: Getty)\n\nThe Beckham’s sue\n\nFollowing the months and months of stories of alleged infidelities, the soccer player and his wife turned to their lawyers, seeking justice.\n\nIn 2004, they filed a lawsuit against News of the World, after a story was published claiming David also had an affair with a beautician named Danielle Heath.\n\nThe couple then amended the complaint in 2005 to include another story by the publisher which detailed quotes from the couple’s former-nanny Abbie Gibson, that the Beckham marriage was a lie. They also sued the nanny for breach of confidence.\n\n“We are sick and tired of people trying to make money at the expense of our family,” the Beckhams said in a statement.\n\nThe ultimate power-couple. (Credit: Getty)\n\nWhere is Rebecca Loos now?\n\nFourteen years after her alleged affair with David Beckham, Rebecca Loos has completely turned her life around.\n\nAfter being dismissed from her position at Real Madrid, Loos went on to star on a range of reality TV shows.\n\nThe Spanish-born beauty eventually fell in love with medical adviser Sven Christjar Skaiaa, who worked on one of the shows she appeared on.\n\nRebecca Loos has kept a low profile after accusing David Beckham of cheating on his wife. (Credit: Instagram)\n\nShe is now married to Sven and shares two sons with him. The family live a low-key life in Norway which Loos frequently writes about on her blog.\n\nDavid and Victoria renewed their vows between 2003-2007 while they were living in Spain and went on a whirlwind 24-hour honeymoon. The couple now have four gorgeous children and are stronger than ever.", "images": ["https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696466288206_Landscape-NTL.jpg?resize=1200%2C1001&ssl=1", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/womensday_adobe_express-01.svg", "https://www.nowtolove.com.au/wp-content/themes/express/assets/images/placeholder.jpg", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2024/02/01/1706756325837_Hero-2024-02-01T135843.256.png?resize=720%2C405&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/Now/2018/06/12/49112/MAIN.jpg?resize=380%2C304&ssl=1", "https://www.nowtolove.com.au/wp-content/themes/express/assets/images/are-logo.svg", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696463043462_Portrait-NTL.jpg?resize=1200%2C1430&ssl=1", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/35_Mag-Cover-Image-1.png", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/OLAY-HTL-lead.jpg?resize=720%2C405&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/Now/2018/06/09/49099/UPDATED-UPDATED-MIAN.jpg?resize=380%2C304&ssl=1", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/t5_adobe_express.svg", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696466419918_Portrait-NTL3.jpg?resize=1200%2C1430&ssl=1", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/Vector.svg", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/tvweek_adobe_express-01.svg", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2018/06/12/1528774232461_Loos.jpg?resize=600%2C800&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696467167049_Header-NTL.jpg?resize=1200%2C630&ssl=1", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/PTL-logo-3.svg", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696466407950_Portrait-NTL2.jpg?resize=1200%2C1430&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/2023/10/1473211760584_Rebecca-Loos-and-Victoria-Beckham.jpg?resize=1920%2C1600&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696466282015_Portrait-NTL1.jpg?resize=1200%2C1430&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696466558077_fam.JPG?resize=555%2C574&ssl=1", "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/Now/2022/04/08/43702/herobeckhams-(2).png?resize=760%2C608&ssl=1", "https://secure.gravatar.com/avatar/d41d8cd98f00b204e9800998ecf8427e?d=mm&s=128"], "top_img": "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696467167049_Header-NTL.jpg?resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Bettina Tyrrell", "Grace Goumas", "Now To Love Team"], "canonical_link": "https://www.nowtolove.com.au/celebrity/celebrity-news/david-beckham-cheating-rebecca-loos-49125/", "title": "David and Victoria Beckham address affair after 20 years", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "David and Victoria Beckham address affair with Rebecca Loos for the first time after 20 years. \"The most unhappy I have ever been in my entire life.\"", "og": {"locale": "en_US", "type": "article", "title": "The Beckham bombshell: Everything you need to know about David Beckham's alleged cheating scandal", "description": "David and Victoria Beckham address affair with Rebecca Loos for the first time after 20 years. \"The most unhappy I have ever been in my entire life.\"", "url": "https://www.nowtolove.com.au/celebrity/celebrity-news/david-beckham-cheating-rebecca-loos-49125/", "site_name": "Now To Love", "image": {"identifier": "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696467167049_Header-NTL.jpg?resize=1200%2C630&ssl=1", "width": 1200, "height": 630, "type": "image/jpeg"}}, "article": {"published_time": "2023-10-05T00:45:00+00:00", "modified_time": "2024-02-03T16:33:46+00:00"}, "twitter": {"card": "summary_large_image", "label1": "Est. reading time", "data1": "6 minutes", "label2": "Written by", "data2": "Bettina Tyrrell"}, "sailthru.date": "2023-10-05 00:45:00", "sailthru.title": "Victoria Beckham address David Beckham’s cheating scandal in new docuseries ‘Beckham’", "sailthru.tags": ",Woman's Day", "sailthru.author": "Bettina Tyrrell", "sailthru.description": "<p>The couple finally addresses the affair head-on.</p>", "sailthru.image.full": "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696467167049_Header-NTL.jpg?fit=1920%2C1180&ssl=1", "sailthru.image.thumb": "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/now/2023/10/05/1696467167049_Header-NTL.jpg?fit=50%2C31&ssl=1", "msapplication-TileImage": "https://i0.wp.com/www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/cropped-FavIcon.png?fit=270%2C270&ssl=1"}, "movies": [], "publish_date": 1696466700.0, "source": "https://www.nowtolove.com.au", "summary": ""}