[
    "claim":"TEMP.Veles is a Russia-based threat group that has targeted critical infrastructure. The group has been observed utilizing TRITON, a malware framework designed to manipulate industrial safety systems.",
    "explain":"Actions to Take Today to Protect Energy Sector Networks: • Implement and ensure robust network segmentation between IT and ICS networks. • Enforce MFA to authenticate to a system. • Manage the creation of, modification of, use of—and permissions associated with—privileged accounts. This joint Cybersecurity Advisory (CSA)—coauthored by the Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the Department of Energy (DOE)—provides information on multiple intrusion campaigns conducted by state-sponsored Russian cyber actors from 2011 to 2018 and targeted U.S. and international Energy Sector organizations. CISA, the FBI, and DOE responded to these campaigns with appropriate action in and around the time that they occurred. CISA, the FBI, and DOE are sharing this information in order to highlight historical tactics, techniques, and procedures (TTPs) used by adversaries to target U.S. and international Energy Sector organizations. On March 24, 2022, the U.S. Department of Justice unsealed indictments of three Russian Federal Security Service (FSB) officers and a Russian Federation Central Scientific Research Institute of Chemistry and Mechanics (TsNIIKhM) employee for their involvement in the following intrusion campaigns against U.S. and international oil refineries, nuclear facilities, and energy companies.Global Energy Sector Intrusion Campaign, 2011 to 2018: the FSB conducted a multi-stage campaign in which they gained remote access to U.S. and international Energy Sector networks, deployed ICS-focused malware, and collected and exfiltrated enterprise and ICS-related data. One of the indicted FSB officers was involved in campaign activity that involved deploying Havex malware to victim networks. The other two indicted FSB officers were involved in activity targeting U.S. Energy Sector networks from 2016 through 2018. Compromise of Middle East-based Energy Sector organization with TRITON Malware, 2017: Russian cyber actors with ties to the TsNIIKhM gained access to and leveraged TRITON (also known as HatMan) malware to manipulate a foreign oil refinery’s ICS controllers. TRITON was designed to specifically target Schneider Electric’s Triconex Tricon safety systems and is capable of disrupting those systems. Schneider Electric has issued a patch to mitigate the risk of the TRITON malware’s attack vector; however, network defenders should install the patch and remain vigilant against these threat actors’ TTPs. The indicted TsNIIKhM cyber actor is charged with attempt to access U.S. protected computer networks and to cause damage to an energy facility. The indicted TsNIIKhM cyber actor was a co-conspirator in the deployment of the TRITON malware in 2017. This CSA provides the TTPs used by indicted FSB and TsNIIKhM actors in cyber operations against the global Energy Sector. Specifically, this advisory maps TTPs used in the global Energy Sector campaign and the compromise of the Middle East-based Energy Sector organization to the MITRE ATT&CK for Enterprise and ATT&CK for ICS frameworks. CISA, the FBI, and DOE assess that state-sponsored Russian cyber operations continue to pose a threat to U.S. Energy Sector networks. CISA, the FBI, and DOE urge the Energy Sector and other critical infrastructure organizations to apply the recommendations listed in the Mitigations section of this advisory and Appendix A to reduce the risk of compromise. For more information on Russian state-sponsored malicious cyber activity, see CISA's Russia Cyber Threat Overview and Advisories webpage. For more information on the threat of Russian state-sponsored malicious cyber actors to U.S. critical infrastructure as well as additional mitigation recommendations, see joint CSA Understanding and Mitigating Russian State-Sponsored Cyber Threats to U.S. Critical Infrastructure and CISA's Shields Up Technical Guidance webpage. If you have information on state-sponsored Russian cyber operations targeting U.S. critical infrastructure, contact the Department of State’s (DOS) Rewards for Justice program. You may be eligible for a reward of up to $10 million, which DOS is offering for information leading to the identification or location of any person who, while acting under the direction or control of a foreign government, participates in malicious cyber activity against U.S. critical infrastructure in violation of the Computer Fraud and Abuse Act (CFAA). Contact +1-202-702-7843 on WhatsApp, Signal, or Telegram, or send information via the Rewards for Justice secure Tor-based tips line located on the Dark Web. For more details refer to rewardsforjustice.net.From at least 2011 through 2018, the FSB (also known as Berserk Bear, Energetic Bear, TeamSpy, Dragonfly, Havex, Crouching Yeti, and Koala) conducted an intrusion campaign against international and U.S. Energy Sector organizations. The threat actor gained remote access to and deployed malware designed to collect ICS-related information on compromised Energy Sector networks, and exfiltrated enterprise and ICS data. Beginning in 2013 and continuing through 2014, the threat actor leveraged Havex malware on Energy Sector networks. The threat actor gained access to these victim networks via spearphishing emails, redirects to compromised websites, and malicious versions of legitimate software updates on multiple ICS vendor websites. The new software updates contained installations of Havex malware, which infected systems of users who downloaded the compromised updates. Havex is a remote access Trojan (RAT) that communicates with a command and control (C2) server. The C2 server deploys payloads that enumerate all collected network resources and uses the Open Platform Communications (OPC) standard to gather information about connected control systems devices and resources within the network. Havex allowed the actor to install additional malware and extract data, including system information, lists of files and installed programs, e-mail address books, and virtual private network (VPN) configuration files. The Havex payload can cause common OPC platforms to crash, which could cause a denial-of-service condition on applications that rely on OPC communications. Note: for additional information on Havex, see to CISA ICS Advisory ICS Focused Malware and CISA ICS Alert ICS Focused Malware (Update A). Beginning in 2016, the threat actor began widely targeting U.S. Energy Sector networks. The actor conducted these attacks in two stages: first targeting third-party commercial organizations (such as vendors, integrators, and suppliers) and then targeting Energy Sector organizations. The threat actor used the compromised third-party infrastructure to conduct spearphishing, watering hole, and supply chain attacks to harvest Energy Sector credentials and to pivot to Energy Sector enterprise networks. After obtaining access to the U.S. Energy Sector networks, the actor conducted network discovery, moved laterally, gained persistence, then collected and exfiltrated information pertaining to ICS from the enterprise, and possibly operational technology (OT), environments. Exfiltrated information included: vendor information, reference documents, ICS architecture, and layout diagrams. In 2017, Russian cyber actors with ties to TsNIIKhM gained access to and manipulated a foreign oil refinery’s safety devices. TsNIIKhM actors used TRITON malware on the ICS controllers, which resulted in the refinery shutting down for several days. TRITON is a custom-built, sophisticated, multi-stage malware affecting Schneider Electric’s Triconex Tricon, a safety programmable logic controller (PLC) (also referred to as a safety instrumented system [SIS]), which monitors industrial processes to prevent hazardous conditions. TRITON is capable of directly interacting with, remotely controlling, and compromising these safety systems. As these systems are used in a large number of environments, the capacity to disable, inhibit, or modify the ability of a process to fail safely could result in physical consequences.TRITON malware affects Triconex Tricon PLCs by modifying in-memory firmware to add additional programming. The extra functionality allows an attacker to read/modify memory contents and execute custom code, disabling the safety system. TRITON malware has multiple components, including a custom Python script, four Python modules, and malicious shellcode that contains an injector and a payload. For detailed information on TRITON’s components, refer to CISA Malware Analysis Report (MAR): HatMan: Safety System Targeted Malware (Update B).",
    {
        "report_id": "report_0",
        "link":"https://www.dragos.com/threat/xenotime/",
        "sentences": [
            "Intelligence suggests the group has been active since at least 2014 and is presently operating in multiple facilities targeting safety systems beyond Triconex.",
            "TRISIS was an escalation of the type of attacks historically targeting ICS systems.",
            "Targeting a safety system indicates significant damage and loss of human life were either intentional or acceptable goals of the attack, a consequence not seen in previous disruptive attacks such as the 2016 CRASHOVERRIDE malware that caused a power loss in Ukraine.",
            "The group created a custom malware framework and tailormade credential gathering tools, but an apparent misconfiguration prevented the attack from executing properly.",
            "The incident represented a shift in the capabilities and consequences of ICS malware.",
            "They enable engineers and operators to safely control and possibly shutdown processes before a major incident occurs."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://blog.cyberproof.com/blog/a-look-at-advanced-persistent-threats-apts-related-to-russian-proxies",
        "sentences": [
            "A second execution example took place in 2020, with APT29 - a threat actor linked to Russia identified as setting up new infrastructure and malware while using custom tools and techniques.",
            "Attack on the Winter Olympics In 2018, a cyber campaign linked to Russian proxies demonstrated a high level of operational security when attackers used a total of 14 various techniques designed to disrupt the opening ceremony of the Winter Olympics held in South Korea.",
            "CyberProof’s proactive detection measures The ten techniques most favored by the Russian-related groups are System Information Discovery (T1082), Windows Command Shell (T1059.003), Web Protocols (T1071.001), Ingress Tool Transfer (T1105),",
            "Hypothesis 2: APTs associated with Russian proxies conduct attacks using a greater number of techniques APTs linked to Russian proxies carry out more sophisticated attacks using a wider range of techniques to achieve their goals.",
            "Threat actors associated with Russian proxies successfully mastered diverse methods and use a higher number of techniques in each attack."
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://medium.com/mitre-engage/part-two-a-deeper-dive-into-russian-ics-threats-sandworm-dragonfly-and-xenotime-48927e02b2fa",
        "sentences": [
            "As the Russian cyber threat escalates, we hope defenders can use these insights to start exploring the art of possibly when it comes to using denial, deception, and adversary engagement in their own organization.",
            "By understanding the profile of the Russian threat actors described above, organizations can tailor their deceptive practices to take advantage of the adversary’s exposed weaknesses.",
            "Each of these three APTs seem to fill a different role within Russia’s infrastructure hacking: Sandworm is one of Russia’s most destructive hacking teams, responsible for attacks which shut off Ukrainian power grids in 2015 and 2016; Dragonfly appears to primarily be an intelligence gathering threat actor observed in a large number of Industrial Control System (ICS) networks but never reported escalating to disruptive or destructive attacks; and finally, XENOTIME, the most elusive of the three, exhibits targeting behavior characterized by an ability to tailor malware to specific industrial control systems, as evidenced by their Trisis/Triton malware that affected Saudi pipeline safety systems.",
            "In our previous blog post we examined the history and TTPs associated with Russia’s disruption of critical infrastructure.",
            "In this blog post will take a deeper dive into the particulars of the three most prominent Russian critical infrastructure threat actors: Sandworm, Dragonfly and XENOTIME.",
            "Sharing this intelligence with other defenders plays an important role in the united front against Russia’s cyberspace sabotage and espionage operations."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://securityaffairs.com/77345/malware/triton-cniihm-institute.html",
        "sentences": [
            "FireEye also discovered that one IP address registered to the Russian research institute was involved in the Triton attacks.",
            "FireEye collected strong evidence suggesting that the Russian CNIIHM institute has been involved in the development of some of the tools used in the Triton attack.",
            "Investigation of this testing activity reveals multiple independent ties to Russia, CNIIHM, and a specific person in Moscow.",
            "Once gained access to the SIS system, the threat actor deployed the TRITON malware, a circumstance that indicates that attackers had a knowledge of such systems.",
            "Security experts from FireEye found evidence that links the development of the Triton malware (aka Trisis and HatMan) to a Russian government research institute.",
            "The experts discovered that a PDB path contained in a tested file included a string that appears to be an online moniker associated with a Russia-based individual active in Russian information security communities since at least 2011."
        ]
    }
]