claim： Since July 2015, the Army Lions Organization (APT-C-38) has launched an organized, planned and targeted uninterrupted attack in the Middle East. 
explain：Since July 2015, the Army Lions Organization (APT-C-38) has launched an organized, planned and targeted uninterrupted attack in the Middle East. Its attack platform is Windows and Android. Up to now, 360 Beaconlab has captured 25 Android platform attack samples, 4 Windows platform attack samples, and 16 C2 domain names. In May 2018, Kaspersky security vendor published the report " Who's who in the Zoo ", the first time to disclose the organization as an unaffiliated espionage organization focused on the Middle East target, and named ZooPark, the attack weapon involved contains four iterations The version of the Android-side RAT, load delivery methods include puddles and Telegram channels. In 2019, 360 Campfire Lab captured the latest attack activity of the Saber Lions organization. In addition to discovering Android-side attacks, it also found that the organization had Windows-side attacks, and the Android-side RAT still belongs to the fourth generation. We combine the geopolitical factors of the APT attack, the language used by the attacking organization, and the historical attack activities initiated by the organization. The analysis considers the organization to be an APT organization in the background of a country in the Middle East in West Asia. In addition, we would like to thank our brother team----360 Advanced Threat Response Team for the completion of the Windows side RAT content of this report. Because of the main target of the Saber-Like organization, the Kurdish target is a Kurdish country in the Middle East and West Asia. In addition, the Windows side RAT contains multiple "Saber" under the PDB path, and the Asian lion is the representative animal of the Middle East. Some of the other characteristics of the organization and the 360 naming rules for the APT organization, we named the organization the Saber Lion (APT-C-38). The way the saber lion organizes the payload delivery is mainly the puddle attack and the Telegram channel. It should be noted that after the organization was first leaked in early May 2018, the attacking organization used a new batch of network infrastructure at the end of the month.Two Arab news newspaper websites (Annahar, Kuwait and Al-Nahar, Egypt), which are popular in the Middle East, have been found to have been used by the organization for puddle attacks.In addition to the above two puddle attacks against the designated Arab countries in the Middle East, we also found that the organization used the Telegram channel to spread the Kurdish people in the Middle East when attacking its main target (such as the election of the Kurdistan Province before the Islamic Parliament). Attacks and attacks in the Kurwana Nanda quarter of Kurdistan Province, etc.). It should be noted that on May 23, 2018, a new batch of network infrastructure was applied. The latest mobile attack load was deployed in one of the servers in March 2019. There are 4 intermediate servers and 3 of them. It still survives and resolves to the same IP, and these servers act as intermediate servers for the PC and mobile RATs. The Saber lion organization mainly uses the following two induction methods in this operation:For better avoidance, it is noticed that in addition to masquerading the file icon, the normal APP interface will be displayed when the RAT starts. Currently, the four-initiative version of the Android RAT will display the normal interface after running, but Espionage in the background is turned on at runtime or when a specified broadcast is received. As of now, the Saber has been using different RATs for Android and Windows platforms. After analysis, we believe that the latest Android RAT and PC RAT should be purchased from the same commercial development organization, one of the developers nicknamed "Apasec ". The Android side uses a total of four iterations of the RAT. In this report, we only introduce the fourth-generation RAT used by the latest attack activities. We are called UnitMM. The RAT is currently only available in the saber lion organization. For other versions of the RAT, refer to the information. The Kaspersky Security Vendor Report mentioned earlier in this report. The fourth generation RAT of the UnitMM Saber Lion organization. We named it UnitMM based on the class name and database name used by the RAT. The latest version of UnitMM controls dozens of feature configurations to steal SMS, contacts, geolocation, browser bookmarks and search history, clipboard information, externally specified application data, capture photos/video/audio A variety of malicious behaviors. In addition, UnitMM can also interact in response to specified instructions from C2. A RAT has been discovered on the Windows side. We have been named SpecialSaber. The RAT is currently only available in the Army Lions organization, with a total of four. SpecialSaber This is a RAT that has not been exposed before. According to the directory name under the latest version of the PDB path, we are named SpecialSaber. It has detection and killing (including Bitdefender, Kaspersky, Avira, Avast, AVG, ClamWin, ESET, Norton, McAfee, Panda, Symantec), stealing a variety of browser information, a variety of mailbox information, user account information, disk file information, etc. With a variety of malicious behaviors such as keyloggers and screenshots. After stealing various information, it will be saved in the file's own working directory. The file name is randomly generated š string, and the file is stored in the specified format. By comparing the UnitMM RAT on the Android side with the SpecialSaber RAT on the Windows side, we see that the two adopt a similar approach in the C2 communication link, and the information stolen by the two has a special commonality. We think that the two should come from the same business. Development organization. In addition, we found a developer named "Apasec" in the path of a PDB. We found that the name appeared in the C2 panels of the organization's mobile terminal many times. This finding further verifies our judgment. Up to now, 360 Campfire Labs has found that there are 7 countries affected by the attack of the Saber Lions, of which Iran is the most affected. This is related to the attack on the Kurds who found the country during our analysis. It doesn't matter. Based on the attacker's special attacks on the attack, the language used, and the geopolitical factors of the APT attack, we summarized the following views of the attack organization: In summary, 360 Campfire Lab believes that the attacker is an APT organization from a country in the Middle East in West Asia.In recent years, we have seen that APT attacks have evolved with the times. The PC side is no longer a unique target. More and more attack organizations will also use the mobile end as another necessary target for attacks, and even invest frequently. The cyber war under the background of some countries in the Middle East and the Asia Pacific region. APT attacks are developing rapidly, especially the development of mobile attacks. We have seen that some of the attacking organizations in the past few years are still relatively rudimentary. Even some security vendors use kittens and other names to name them to show low respect for the attacking capabilities of the corresponding attacking organizations. However, as the attack gains value and the attack organization increases its investment, we see that the attack is more and more complex, and the pertinence and effectiveness are getting stronger. If the former kitten is used as an example, it is like a young one. The kitten gradually became a mature lion. This saber lion organization is undoubtedly a typical representative of the development of APT attacks. Based on the special background of the organization and the current situation of its affiliated countries, we believe that the organization's attack may have a new round of changes.
[
    {
	link：https://usa.kaspersky.com/about/press-releases/2018_zoopark-new-android-based-malware
        "report_id": "report_0",
        "sentences": [
            "Based on the news topics that the attackers used to lure victims into installing the malware, members of the United Nations Relief and Works Agency are among the possible targets of the ZooPark malware.",
            "In total, Kaspersky Lab researchers were able to identify at least four generations of the espionage malware related to the ZooPark family, which has been active since at least 2015.",
            "Kaspersky Lab researchers have discovered ZooPark, a sophisticated cyberespionage campaign that has been targeting Android device users based in Middle Eastern countries for several years.",
            "Some of the malicious ZooPark apps are being distributed from news and political websites popular in specific parts of the Middle East.",
            "The investigation suggests that the attackers are focusing on users based in Egypt, Jordan, Morocco, Lebanon and Iran.",
            "“The ZooPark APT, actively spying on targets in Middle Eastern countries, is one such example, but it is certainly not the only one.”"
        ]
    },
    {
	link：https://www.kaspersky.com/blog/zoopark-attacks/22389/
        "report_id": "report_1",
        "sentences": [
            "Finally, in some cases, the malware pretends to be an “all-in-one” messenger.",
            "For example, Android users interested in current events in the Middle East are at risk of getting a whole menagerie — ZooPark spyware — on their phones.",
            "For more details about the technical aspects of ZooPark, see the post on Securelist.",
            "The current, fourth version of this Trojan can steal almost any information from your smartphone, from contacts to call logs and info you enter by keyboard.",
            "ZooPark Trojan spyware is used for targeted attacks — in other words, it’s not sent out randomly to ensnare just anyone; it aims for a specific audience.",
            "ZooPark spreads by two main channels: drive-by downloads and Telegram."
        ]
    },
    {
	link：https://www.kaspersky.com/about/press-releases/2018_zoopark-new-android-based-malware
        "report_id": "report_2",
        "sentences": [
            "Based on the news topics that the attackers used to lure victims into installing the malware, members of the United Nations Relief and Works Agency are among the possible targets of the ZooPark malware.",
            "In total, Kaspersky Lab researchers were able to identify at least four generations of the espionage malware related to the ZooPark family, which has been active since at least 2015.",
            "Kaspersky Lab researchers have discovered ZooPark, a sophisticated cyberespionage campaign, which for several years has been targeting users of Android devices based in several Middle Eastern countries.",
            "The ZooPark APT, actively spying on targets in Middle Eastern countries, is one such example, but it is certainly not the only one,” - said Alexey Firsh, security expert at Kaspersky Lab.",
            "The investigation suggests that the attackers are focusing on users based in Egypt, Jordan, Morocco, Lebanon and Iran."
        ]
    },
    {
	link:https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/05/03114450/ZooPark_for_public_final_edit.pdf
        "report_id": "report_3",
        "sentences": [
            "In particular, one of the samples (ac4402e04de0949d7beed975db84e594) mimics the An Nahar official mobile application, which makes us believe the malware was probably distributed in a similar way through the legitimate site.",
            "Since this attack is very targeted, we can assume the developers paid special attention to work on outdated devices that are vulnerable to this “insecure random” attack.",
            "The malware used in ZooPark operations spans across multiple versions, with the attackers including new features in each iteration.",
            "The threat actors behind ZooPark infect Android devices using several generations of malware we label from v1-v4, with v4 being the most recent version deployed in 2017.",
            "This version has a huge internal configuration containing dozens of parameters that regulate the malicious activities.",
            "ZooPark is a cyberespionage operation that has been focusing on Middle Eastern targets since at least June 2015."
        ]
    }
]