[
    "claim":"APT10 (MenuPass Group): New Tools, Global Campaign Latest Manifestation of Longstanding Threat.",
    "explain":"APT10 (MenuPass Group) is a Chinese cyber espionage group that FireEye has tracked since 2009. They have historically targeted construction and engineering, aerospace, and telecom firms, and governments in the United States, Europe, and Japan. We believe that the targeting of these industries has been in support of Chinese national security goals, including acquiring valuable military and intelligence information as well as the theft of confidential business data to support Chinese corporations. PwC and BAE recently issued a joint blog detailing extensive APT10 activity. In June 2016, FireEye iSIGHT intelligence first reported that APT10 expanded their operations. The group was initially detected targeting a Japanese university, and more widespread targeting in Japan was subsequently uncovered. Further collaboration between FireEye as a Service (FaaS), Mandiant and FireEye iSIGHT intelligence uncovered additional victims worldwide, a new suite of tools and novel techniques. Leveraging its global footprint, FireEye has detected APT10 activity across six continents in 2016 and 2017. APT10 has targeted or compromised manufacturing companies in India, Japan and Northern Europe; a mining company in South America; and multiple IT service providers worldwide. We believe these companies are a mix of final targets and organizations that could provide a foothold in a final target. APT10 unveiled new tools in its 2016/2017 activity. In addition to the continued use of SOGU, the current wave of intrusions has involved new tools we believe are unique to APT10. HAYMAKER and SNUGRIDE have been used as first stage backdoors, while BUGJUICE and a customized version of the open source QUASARRAT have been used as second stage backdoors. These new pieces of malware show that APT10 is devoting resources to capability development and innovation. HAYMAKER is a backdoor that can download and execute additional payloads in the form of modules. It also conducts basic victim profiling activity, collecting the computer name, running process IDs, %TEMP% directory path and version of Internet Explorer. It communicates encoded system information to a single hard coded command and control (C2) server, using the system’s default User-Agent string. BUGJUICE is a backdoor that is executed by launching a benign file and then hijacking the search order to load a malicious dll into it. That malicious dll then loads encrypted shellcode from the binary, which is decrypted and runs the final BUGJUICE payload. BUGJUICE defaults to TCP using a custom binary protocol to communicate with the C2, but can also use HTTP and HTTPs if directed by the C2. It has the capability to find files, enumerate drives, exfiltrate data, take screenshots and provide a reverse shell. SNUGRIDE is a backdoor that communicates with its C2 server through HTTP requests. Messages are encrypted using AES with a static key. The malware’s capabilities include taking a system survey, access to the filesystem, executing commands and a reverse shell. Persistence is maintained through a Run registry key. QUASARRAT is an open-source RAT. The versions used by APT10 (1.3.4.0, 2.0.0.0, and 2.0.0.1) are not available via the public GitHub page, indicating that APT10 has further customized the open source version. The 2.0 versions require a dropper to decipher and launch the AES encrypted QUASARRAT payload. QUASARRAT is a fully functional .NET backdoor that has been used by multiple cyber espionage groups in the past. This recent APT10 activity has included both traditional spear phishing and access to victim’s networks through service providers. (For more information on infection via service providers see M-Trends 2016). APT10 spear phishes have been relatively unsophisticated, leveraging .lnk files within archives, files with double extensions (e.g. “[Redacted]_Group_Meeting_Document_20170222_doc_.exe) and in some cases simply identically named decoy documents and malicious In addition to the spear phishes, FireEye ISIGHT Intelligence has observed APT10 accessing victims through global service providers. Service providers have significant access to customer networks, enabling an attacker who had compromised a service provider to move laterally into the network of the service provider’s customer. In addition, web traffic between a service provider’s customer and a service provider is likely to be viewed as benign by network defenders at the customer, allowing the attacker to exfiltrate data stealthily. A notable instance of this observed by FireEye involved a SOGU backdoor that was set to communicate with its C2 through a server belonging to the victim’s service provider. These commands included setting persistence on the victim’s system. The actor then tested connectivity to an IP managed by the victim’s service provider. Once connectivity to the service provider IP was verified, the actor established the service provider IP as a proxy for the victim’s SOGU backdoor. This effectively routes SOGU malware traffic through the victim’s service provider, which likely indicates a foothold on the service provider’s network. The tactic also serves to mask malicious C2 and exfiltration traffic and make it appear innocuous. APT10 is a threat to organizations worldwide. Their abuse of access to service provider networks demonstrates that peripheral organizations continue to be of interest to a malicious actor – especially those seeking alternative angles of attack. We believe the pace of APT10 operations may slow following the public disclosure by the PwC/BAE blog; however, we believe they will return to their large-scale operations, potentially employing new tactics, techniques and procedures.",
    {
        "report_id": "report_0",
        "link":"https://cyware.com/resources/research-and-analysis/apt10-a-chinese-threat-on-a-global-espionage-mission-56fe",
        "sentences": [
            "APT10, just like other China-based entities, targets entities that are aligned with the geopolitical interests of that nation.",
            "At the beginning of 2022, a Taiwan-based security agency linked APT10 to attacks exploiting a vulnerability in a security product that was used by around 80% of organizations in the Taiwanese financial sector.",
            "Believed to be active since 2006, APT10 is a Chinese state-sponsored cyberespionage group, possibly connected to the Chinese Ministry of State Security (MSS).",
            "Eventually, it turned out that the same group that the U.S. government agencies have been tracking as APT10.",
            "In September, a mysterious threat hunting group named Intrusion Truth reported that APT10 is associated with the Chinese intelligence agency, particularly China’s Ministry of State Security (MSS).",
            "In mid-2019, German software maker TeamViewer disclosed that it was targeted by a China-linked threat actor, possibly APT10, back in 2016."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://www.ncsc.gov.uk/news/apt10-continuing-target-uk-organisations",
        "sentences": [
            "Foreign Secretary, Jeremy Hunt said: “This campaign is one of the most significant and widespread cyber intrusions against the UK and allies uncovered to date, targeting trade secrets and economies around the world.",
            "In December 2018, the UK and its allies announced that a group known as APT10 acted on behalf of the Chinese Ministry of State Security to carry out a malicious cyber campaign targeting intellectual property and sensitive commercial data in Europe, Asia and the US.",
            "Since then it has targeted healthcare, defence, aerospace, government, heavy industry/mining, Managed Service Providers (MSPs) and IT industries, among many other sectors, for the likely purpose of intellectual property theft.",
            "The NCSC is aware of current malicious activity affecting UK organisations across a broad range of sectors, likely conducted by APT10.",
            "They go against the commitments made to the UK in 2015, and, as part of the G20, not to conduct or support cyber-enabled theft of intellectual property or trade secrets.",
            "”APT10 (also known as Stone Panda, MenuPass and Red Apollo) is a threat actor acting on behalf of the Chinese Ministry of State Security who are known to have been active since at least 2009."
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://www.picussecurity.com/resource/blog/muddywater-apt-group",
        "sentences": [
            "A41APT is a long-running espionage campaign with activities detected from March 2019.",
            "AP10 is believed to be a part of the Tianjin bureau of the Chinese Ministry of State Security .",
            "APT10 has mainly targeted 30+ countries in Asia, Europe, North America, and Africa.",
            "APT10 utilizes a bunch of tools in its attack campaigns, including BloodHound, China Chopper, Cobalt Strike, Derusbi, Mimikatz, PowerSploit, PowerBiew, pwdump, ShaspSploit, PsExec, and certutil.",
            "Another payload is SodaMaster that downloads malicious DLLs or shellcode and executes the downloaded payloads like P8RAT.Picus Threat Library consists of 44 threats of the APT10 (menuPass) threat group, including: APT10 Threat Group Attack Scenario ChChes Trojan used by menuPass (Stone Panda) APT Campaign Redleaves RAT Malware used in menuPass Campaign PlugX (Korplug) RAT used by menuPass (Stone Panda)",
            "Picus Labs has updated the Picus Threat Library with new attack methods for malware samples used in the A41APT espionage campaign of the APT10 (also known as Cloud Hopper, Red Apollo, CNVX, Stone Panda, MenuPass, and Potassium) Advanced Persistent Threat (APT) Group, operating since 2006."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://cybermaterial.com/apt10/",
        "sentences": [
            "APT10 is a Chinese cyber espionage group that FireEye has tracked since 2009.",
            "How they work: This recent APT10 activity has included both traditional spear phishing and access to victim’s networks through service providers.",
            "In addition to the spear phishes, FireEye Threat Intelligence has observed APT10 accessing victims through global service providers.",
            "Motivation: Espionage Associated malware: ANEL, ChChes, Cobalt Strike, PlugX, Poison Ivy, QuasarRAT, QuasarRAT Loader, RedLeaves Attack vectors: This recent APT10 activity has included both traditional spear phishing and access to victim’s networks through managed service providers.",
            "Name: Stone Panda (CrowdStrike), APT 10 (Mandiant), menuPass Team (Symantec), menuPass (Palo Alto, FireEye), Red Apollo (PWC), CVNX (BAE Systems), Potassium (Microsoft), Hogfish (iDefense), Happyyongzi (FireEye), Cicada (Symantec), Bronze Riverside (SecureWorks), CTG-5938 (SecureWorks), ATK 41 (Thales), TA429 (Proofpoint), ITG01 (IBM) Location: China Suspected attribution: State-sponsored, Tianjin bureau of the Chinese Ministry of State Security, Huaying Haitai Date of initial activity: 2006-2009 Targets: Construction and engineering, aerospace, and telecom firms, and governments in the United States, Europe, and Japan.",
            "We believe that the targeting of these industries has been in support of Chinese national security goals, including acquiring valuable military and intelligence information as well as the theft of confidential business data to support Chinese corporations."
        ]
    }
]