[
    "claim":"APT39: An Iranian Cyber Espionage Group Focused on Personal Information",
    "explain":"In December 2018, FireEye identified APT39 as an Iranian cyber espionage group responsible for widespread theft of personal information. We have tracked activity linked to this group since November 2014 in order to protect organizations from APT39 activity to date. APT39’s focus on the widespread theft of personal information sets it apart from other Iranian groups FireEye tracks, which have been linked to influence operations, disruptive attacks, and other threats. APT39 likely focuses on personal information to support monitoring, tracking, or surveillance operations that serve Iran’s national priorities, or potentially to create additional accesses and vectors to facilitate future campaigns. APT39 was created to bring together previous activities and methods used by this actor, and its activities largely align with a group publicly referred to as "Chafer." However, there are differences in what has been publicly reported due to the variances in how organizations track activity. APT39 primarily leverages the SEAWEED and CACHEMONEY backdoors along with a specific variant of the POWBAT backdoor. While APT39's targeting scope is global, its activities are concentrated in the Middle East. APT39 has prioritized the telecommunications sector, with additional targeting of the travel industry and IT firms that support it and the high-tech industry. The countries and industries targeted by APT39 are depicted in Figure 1. Operational Intent APT39's focus on the telecommunications and travel industries suggests intent to perform monitoring, tracking, or surveillance operations against specific individuals, collect proprietary or customer data for commercial or operational purposes that serve strategic requirements related to national priorities, or create additional accesses and vectors to facilitate future campaigns. Government entities targeting suggests a potential secondary intent to collect geopolitical data that may benefit nation-state decision making. Targeting data supports the belief that APT39's key mission is to track or monitor targets of interest, collect personal information, including travel itineraries, and gather customer data from telecommunications firms. We have moderate confidence APT39 operations are conducted in support of Iranian national interests based on regional targeting patterns focused in the Middle East, infrastructure, timing, and similarities to APT34, a group that loosely aligns with activity publicly reported as “OilRig”. While APT39 and APT34 share some similarities, including malware distribution methods, POWBAT backdoor use, infrastructure nomenclature, and targeting overlaps, we consider APT39 to be distinct from APT34 given its use of a different POWBAT variant. It is possible that these groups work together or share resources at some level. APT39 uses a variety of custom and publicly available malware and tools at all stages of the attack lifecycle. For initial compromise, FireEye Intelligence has observed APT39 leverage spear phishing emails with malicious attachments and/or hyperlinks typically resulting in a POWBAT infection. APT39 frequently registers and leverages domains that masquerade as legitimate web services and organizations that are relevant to the intended target. Furthermore, this group has routinely identified and exploited vulnerable web servers of targeted organizations to install web shells, such as ANTAK and ASPXSPY, and used stolen legitimate credentials to compromise externally facing Outlook Web Access (OWA) resources. Establish Foothold, Escalate Privileges, and Internal Reconnaissance Post-compromise, APT39 leverages custom backdoors such as SEAWEED, CACHEMONEY, and a unique variant of POWBAT to establish a foothold in a target environment. During privilege escalation, freely available tools such as Mimikatz and Ncrack have been observed, in addition to legitimate tools such as Windows Credential Editor and ProcDump. Internal reconnaissance has been performed using custom scripts and both freely available and custom tools such as the port scanner, BLUETORCH. Lateral Movement, Maintain Presence, and Complete Mission APT39 facilitates lateral movement through myriad tools such as Remote Desktop Protocol (RDP), Secure Shell (SSH), PsExec, RemCom, and xCmdSvc. Custom tools such as REDTRIP, PINKTRIP, and BLUETRIP have also been used to create SOCKS5 proxies between infected hosts. In addition to using RDP for lateral movement, APT39 has used this protocol to maintain persistence in a victim environment. To complete its mission, APT39 typically archives stolen data with compression tools such as WinRAR or 7-Zip. There are some indications that APT39 demonstrated a penchant for operational security to bypass detection efforts by network defenders, including the use of a modified version of Mimikatz that was repacked to thwart anti-virus detection in one case, as well as another instance when after gaining initial access APT39 performed credential harvesting outside of a compromised entity's environment to avoid detection.We believe APT39's significant targeting of the telecommunications and travel industries reflects efforts to collect personal information on targets of interest and customer data for the purposes of surveillance to facilitate future operations. Telecommunications firms are attractive targets given that they store large amounts of personal and customer information, provide access to critical infrastructure used for communications, and enable access to a wide range of potential targets across multiple verticals. APT39's targeting not only represents a threat to known targeted industries, but it extends to these organizations' clientele, which includes a wide variety of sectors and individuals on a global scale. APT39's activity showcases Iran's potential global operational reach and how it uses cyber operations as a low-cost and effective tool to facilitate the collection of key data on perceived national security threats and gain advantages against regional and global rivals.",
    {
        "report_id": "report_0",
        "link":"https://apt.etda.or.th/cgi-bin/showcard.cgi?g=Chafer%2C%20APT%2039&n=1",
        "sentences": [
            " APT39 was created to bring together previous activities and methods used by this actor, and its activities largely align with a group publicly referred to as “Chafer.”",
            "APT39 has prioritized the telecommunications sector, with additional targeting of the travel industry and IT firms that support it and the high-tech industry.",
            "APT39 primarily leverages the SEAWEED and CACHEMONEY backdoors along with a specific variant of the POWBAT backdoor.",
            "APT39’s focus on the telecommunications and travel industries suggests intent to perform monitoring, tracking, or surveillance operations against specific individuals, collect proprietary or customer data for commercial or operational purposes that serve strategic requirements related to national priorities, or create additional accesses and vectors to facilitate future campaigns.",
            "Targeting data supports the belief that APT39’s key mission is to track or monitor targets of interest, collect personal information, including travel itineraries, and gather customer data from telecommunications firms.",
            "While APT39’s targeting scope is global, its activities are concentrated in the Middle East."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://medium.com/@huntressofthreats/unveiling-the-elusive-apt39-a-guide-to-threat-hunting-9be58edc2862",
        "sentences": [
            "APT39 utilizes a combination of social engineering, spear-phishing, and custom malware to gain access to sensitive data and carry out long-term campaigns.",
            "APT39, also known as Chafer, is a state-sponsored threat group with a history of conducting cyber-espionage campaigns primarily targeting Middle Eastern entities, especially in the United Arab Emirates, Saudi Arabia, and the United States.",
            "Among these sophisticated adversaries, APT39 has emerged as a notorious Iranian-linked threat group known for its espionage activities and targeted attacks on government, defense, and financial sectors.",
            "By employing Splunk queries and YARA rules, organizations can enhance their detection capabilities, identify suspicious activities, and respond swiftly to APT39 threats.",
            "In this blog, we will embark on a journey of threat hunting for APT39, featuring real-world examples, Splunk queries, and YARA rules to empower organizations in defending against this formidable APT group.",
            "Remember, a vigilant and proactive approach to threat hunting is the key to unmasking APT39 and safeguarding your network from its espionage activities."
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://www.infinitumit.com.tr/en/iran-supported-apt-group-apt39-chafer/",
        "sentences": [
            "APT39 differs from other threat groups in that it is an APT group that focuses on capturing personal information of corporate personnel.",
            "APT39 uses various backdoor software as well as tools and software developed for different purposes and used by security experts.",
            "Although APT39 has global targets, it is particularly focused on the Middle East.",
            "In particular, individuals and institutions that pose a danger to Iran or have any personal information that could be valuable if captured are targeted by the group.",
            "Iranian Backed APT Group APT39: Chafer Especially those who are after sensitive personal data of anti-Iranian institution employees APT39; chafer, REMIX KITTEN And COBALT HICKMAN It is known by names such as.",
            "The APT group, which carries out cyber espionage activities for the interests of Iran, has also targeted Turkey before."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/chafer-latest-attacks-reveal-heightened-ambitions",
        "sentences": [
            "At the time, many of its targets were individuals located in Iran, and it had already begun compromising telecom providers as well as airline companies in the Middle East region.",
            "Chafer appears to be primarily engaged in surveillance and tracking of individuals, with most of its attacks likely carried out to gather information on targets or facilitate surveillance.",
            "Chafer has been active since at least July 2014 and its activities were first exposed by Symantec in December 2015, when it was found to be conducting targeted surveillance of domestic and international targets.",
            "Chafer, the Iran-based targeted attack group, mounted further operations throughout 2017, attacking more organizations in the Middle East and beyond, and deploying several new tools.",
            "Iran-based group remains highly active and is moving up the telecoms and transport supply chain to facilitate widescale surveillance of targets.",
            "One of the organizations compromised by Chafer in 2017 was a telecoms services provider in the Middle East, which sells its solutions to multiple telecoms operators in the region."
        ]
    }
]