{
    "event_id": "030",
    "claim": "North Korea's Kimsuky Evolves into Full-Fledged, Prolific APT43.",
    "original_label": "true",
    "label": "true",
    "explain": "In cyberattacks against the US, South Korea, and Japan, the group (aka APT43 or Thallium) is using advanced social engineering and cryptomining tactics that set it apart from other threat actors. Cybercriminal group Kimsuky has evolved into a full-fledged, persistent threat, carrying out “unusually aggressive” social-engineering attacks aimed at gathering intelligence, and stealing and laundering cryptocurrency to support the North Korean government. Researchers from Mandiant have tracked a number of changes to the activity of the group, which they call APT43, in a series of rapid-fire attacks against targets in the US, South Korea, and Japan, they revealed in a report published today. Kimsuky, also tracked as Thallium, has been on various researchers' radar screens since 2018, and its previous activity has been widely reported. In earlier attacks, the group mainly focused on conducting cyber espionage against research institutions, geo-political think tanks, and — particularly during the height of the pandemic — pharmaceutical companies. The group typically used spear-phishing campaigns to lure in users and then installed various public and non-public malware, including spyware, onto targeted devices, which were often Android-based smartphones. In fact, Kimsuky was identified as recently as earlier this month leveraging malicious Chrome browser extensions and Android app-store services to target individuals conducting research on the inter-Korean conflict. Now, however, Mandiant researchers have found that APT43 is evolving in several ways. For one, the group is now following in the shoes of other North Korean APTs and branching out beyond mere cyber espionage to steal cryptocurrency, the researchers have found. In addition to using the ill-gotten currency to fund the regime of Kim Jong-un, as other groups do, APT43 also uses it to bolster its own activities, they said. The group is even going the extra step of laundering the crypto through legitimate cloud-mining services so it comes out as clean currency and is difficult to track — an activity that might be used by other groups, but has flown under the radar until now, the researchers said. “The washing of funds and the 'how' has been the missing piece of the equation,” notes Michael Barnhart, Mandiant principal analyst at Google Cloud. “We have indications that APT43 utilizes specific hash rental services to launder these funds by mining for different cryptocurrencies.” For a small fee, these services provide hash power, which APT43 uses to mine cryptocurrency to a wallet selected by the buyer without any blockchain-based association to the buyer's original payments. This allows the APT to use stolen funds to mine for a different cryptocurrency, the researchers said. By spending very little, threat actors walk away with untracked, clean currency to do as they wish, Barnhart explains. Moreover, APT43 — while technologically unsophisticated — relies on advanced and persistent social-engineering tactics in which threat actors create convincing fake personas and exhibit patience in building relationships with targets over several weeks without using malware, the researchers said. “I've never seen an APT quite as successful with such novel techniques,” Barnhart notes. “They pretend to be subject-matter experts or reporters and ask targeted questions — often with the promise of quoting the victim in a report or news article — and successfully gain feedback.” Indeed, in some instances, attackers successfully convinced targeted victims to send over proprietary, geopolitical analysis and research without deploying malware at all, the researchers said. This deviates from standard procedure for most threat groups, allowing APT43 to expend little effort or resources in building malware and gaining the information they are seeking in a low-fi way — by merely asking victims for it, Barnhart notes. APT43 has shifted its targets, and the malware it uses, in campaigns over the years in response to the demands of the North Korean government and the cyberespionage activities it requires of the group, according to Mandiant. “APT43 ultimately modifies its targeting and tactics, techniques, and procedures (TTPs) to suit its sponsors, including carrying out financially-motivated cybercrime as needed to support the regime,” the researchers said in the report. For example, prior to October 2020, the group primarily targeted US and South Korean government offices, diplomatic organizations, and think tank-related entities with a stake in foreign policy and security issues affecting the Korean peninsula. Over the next year, however, the group shifted its focus to COVID-19 response efforts in North Korea by targeting health-related verticals and pharmaceutical companies in South Korea, the US, Europe, and Japan. One notable difference that has emerged between the group and other North Korean threat actors is a recent shift to expand, targeting “everyday users” based on “the sheer velocity and volume of attacks,” says Joe Dobson, Mandiant principal analyst. “By spreading their attack out across hundreds, if not thousands, of victims, their activity becomes less noticeable and harder to track than hitting one large target,“ he says. ”Their pace of execution, combined with their success rate, is alarming.” APT43 is aiming its high-volume activity at entities and organizations in government, business services, and manufacturing as well as think tanks and organizations in education and research related to geopolitical and nuclear policy in the US, South Korea, and Japan, the researchers said. Given its advanced social-engineering tactics and tendency to go after both specific individuals and wider-net targets, researchers advised organizations that may be at risk to share with their employees “a greater understanding of cyber hygiene and heightened awareness,” Barnhart says. “It's important to make personnel aware of this threat actor's TTPs,” Barnhart says. He adds that the APT's spoofed emails are highly convincing, which makes them difficult to spot, even for savvy users; thus, organizations at risk should be on high alert.\n\n\n",
    "reports": [
        {
            "link": "https://www.mandiant.com/resources/blog/apt43-north-korea-cybercrime-espionage",
            "content": "APT43 operations have at times, overlapped with those of other North Korean cyber espionage operators. Although spear-phishing and credential collection against government, military, and diplomatic organizations have been core taskings for the group, APT43 ultimately modifies its targeting and tactics, techniques and procedures to suit its sponsors, including carrying out financially-motivated cybercrime as needed to support the regime. Campaigns attributed to APT43 include strategic intelligence collection aligned with Pyongyang’s geopolitical interests, credential harvesting and social engineering to support espionage activities, and financially-motivated cybercrime to fund operations. Mandiant assesses with high confidence that APT43 is a moderately-sophisticated cyber operator that supports the interests of the North Korean regime. We assess with high confidence that APT43 is a state-sponsored cyber operator that acts in support of the North Korean government’s wider geopolitical aims. We consider cyber espionage to be the primary mission for APT43 and available data indicates that the group’s other activities are carried out to support collecting strategic intelligence.",
            "domain": "www.mandiant.com",
            "tokenized": [
                {
                    "sent": "APT43 operations have at times, overlapped with those of other North Korean cyber espionage operators.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Although spear-phishing and credential collection against government, military, and diplomatic organizations have been core taskings for the group, APT43 ultimately modifies its targeting and tactics, techniques and procedures to suit its sponsors, including carrying out financially-motivated cybercrime as needed to support the regime.",
                    "is_evidence": 0
                },
                {
                    "sent": "Campaigns attributed to APT43 include strategic intelligence collection aligned with Pyongyang’s geopolitical interests, credential harvesting and social engineering to support espionage activities, and financially-motivated cybercrime to fund operations.",
                    "is_evidence": 0
                },
                {
                    "sent": "Mandiant assesses with high confidence that APT43 is a moderately-sophisticated cyber operator that supports the interests of the North Korean regime.",
                    "is_evidence": 0
                },
                {
                    "sent": "We assess with high confidence that APT43 is a state-sponsored cyber operator that acts in support of the North Korean government’s wider geopolitical aims.",
                    "is_evidence": 0
                },
                {
                    "sent": "We consider cyber espionage to be the primary mission for APT43 and available data indicates that the group’s other activities are carried out to support collecting strategic intelligence.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.csoonline.com/article/574919/north-korean-threat-actor-apt43-pivots-back-to-strategic-cyberespionage.html/",
            "content": "APT43 specializes in credential harvesting and social engineering with a focus on foreign policy and nuclear security issues, topics that align with North Korea’s strategic nuclear goals. Aside from South Korea and the US which sit at the top of the North Korean government’s intelligence collection activities, APT43 has also targeted organizations and individuals from Japan and Europe. However, another team that security researchers call APT43, Kimsuky, or Thallium has been carrying out cyberespionage and cybercrime operations at the behest of the North Korean government since at least 2018. The APT43 group is highly adept at using social engineering to target individuals and extract sensitive information.“Barring a drastic change in North Korea’s national priorities, we expect that APT43 will remain highly prolific in carrying out espionage campaigns and financially motivated activities supporting these interests,” the Mandian researchers said. “We believe North Korea has become increasingly dependent on its cyber capabilities and, APT43’s persistent and continuously developing operations reflect the country’s sustained investment and reliance on groups like APT43.”",
            "domain": "www.csoonline.com",
            "tokenized": [
                {
                    "sent": "APT43 specializes in credential harvesting and social engineering with a focus on foreign policy and nuclear security issues, topics that align with North Korea’s strategic nuclear goals.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Aside from South Korea and the US which sit at the top of the North Korean government’s intelligence collection activities, APT43 has also targeted organizations and individuals from Japan and Europe.",
                    "is_evidence": 0
                },
                {
                    "sent": "However, another team that security researchers call APT43, Kimsuky, or Thallium has been carrying out cyberespionage and cybercrime operations at the behest of the North Korean government since at least 2018.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The APT43 group is highly adept at using social engineering to target individuals and extract sensitive information.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "“Barring a drastic change in North Korea’s national priorities, we expect that APT43 will remain highly prolific in carrying out espionage campaigns and financially motivated activities supporting these interests,” the Mandian researchers said.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "“We believe North Korea has become increasingly dependent on its cyber capabilities and, APT43’s persistent and continuously developing operations reflect the country’s sustained investment and reliance on groups like APT43.”",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.axios.com/2023/03/28/mandiant-apt43-north-korea-cyber-threat/",
            "content": "APT43 has been seen using cryptocurrency services to launder stolen currency, suggesting the group has been involved in the string of recent attacks. Details: APT43 engages in two types of cyber activity: Spear-phishing email campaigns to harvest specific targets' credentials and high-value research, and cryptocurrency firm hacks to get funds for its own operations. Driving the news: Mandiant, a threat intelligence firm owned by Google, said in a report today that APT43 has been engaging in espionage campaigns to support the North Korean regime. In the spear-phishing attacks, APT43 poses as reporters and researchers to trick employees at U.S. defense and research organizations, as well as South Korea-based think tanks, into clicking on a malicious email link or responding with key intel. Researchers have identified a new state-backed hacking group in North Korea: APT43. The big picture: Mandiant has \"moderate confidence\" that APT43 is specifically linked to North Korea's foreign intelligence service.",
            "domain": "threatcop.com",
            "tokenized": [
                {
                    "sent": "APT43 has been seen using cryptocurrency services to launder stolen currency, suggesting the group has been involved in the string of recent attacks.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Details: APT43 engages in two types of cyber activity: Spear-phishing email campaigns to harvest specific targets' credentials and high-value research, and cryptocurrency firm hacks to get funds for its own operations.",
                    "is_evidence": 0
                },
                {
                    "sent": "Driving the news: Mandiant, a threat intelligence firm owned by Google, said in a report today that APT43 has been engaging in espionage campaigns to support the North Korean regime.",
                    "is_evidence": 0
                },
                {
                    "sent": "In the spear-phishing attacks, APT43 poses as reporters and researchers to trick employees at U.S. defense and research organizations, as well as South Korea-based think tanks, into clicking on a malicious email link or responding with key intel.",
                    "is_evidence": 0
                },
                {
                    "sent": "Researchers have identified a new state-backed hacking group in North Korea: APT43.",
                    "is_evidence": 0
                },
                {
                    "sent": "The big picture: Mandiant has \"moderate confidence\" that APT43 is specifically linked to North Korea's foreign intelligence service.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://blog.virustotal.com/2023/04/apt43-investigation-into-north-korean.html/",
            "content": "As recently reported by our Mandiant's colleagues, APT43 is a threat actor believed to be associated with North Korea. sDuring our analysis of the samples, we observed that several of them belonged to two different collections created by AlienVaultOTX: APT43: North Korean Group Uses Cybercrime to Fund Espionage Operations and Analysis of Smoke Screen in APT campaign aimed at Korea and America. Mandiant’s report mentions kimsuky as being used by multiple companies in their public statements on APT43’s activities. The group uses a variety of techniques and tools to conduct espionage, sabotage, and theft operations, including spear phishing and credential harvesting. This blog post sheds light on the activities of APT43, a threat actor operating on behalf of the North Korean regime. This is not surprising, given that South Korea is (probably) the primary target of APT43, as pointed out by Mandiant.",
            "domain": "blog.virustotal.com",
            "tokenized": [
                {
                    "sent": "As recently reported by our Mandiant's colleagues, APT43 is a threat actor believed to be associated with North Korea.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "During our analysis of the samples, we observed that several of them belonged to two different collections created by AlienVaultOTX: APT43: North Korean Group Uses Cybercrime to Fund Espionage Operations and Analysis of Smoke Screen in APT campaign aimed at Korea and America.",
                    "is_evidence": 0
                },
                {
                    "sent": "Mandiant’s report mentions kimsuky as being used by multiple companies in their public statements on APT43’s activities.",
                    "is_evidence": 0
                },
                {
                    "sent": "The group uses a variety of techniques and tools to conduct espionage, sabotage, and theft operations, including spear phishing and credential harvesting.",
                    "is_evidence": 0
                },
                {
                    "sent": "This blog post sheds light on the activities of APT43, a threat actor operating on behalf of the North Korean regime.",
                    "is_evidence": 0
                },
                {
                    "sent": "This is not surprising, given that South Korea is (probably) the primary target of APT43, as pointed out by Mandiant.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}