{
    "event_id": "056",
    "claim": "BRONZE UNION was one of the most prolific and active targeted threat groups tracked by CTU researchers in 2017 and 2018.",
    "original_label": "true",
    "label": "true",
    "explain": "Secureworks® Counter Threat Unit™ (CTU) researchers have tracked the activities of the BRONZE UNION threat group (also known as Emissary Panda, APT 27, and LuckyMouse) since 2013. CTU™ analysis suggests that BRONZE UNION is located in the People's Republic of China. The threat group has historically leveraged a variety of publicly available and self-developed tools to gain access to targeted networks in pursuit of its political and military intelligence-collection objectives. In 2018, CTU researchers identified evidence of BRONZE UNION leveraging tools that have been publicly available for years. However, the variants used in 2018 included updated code.In mid-2018, CTU researchers observed BRONZE UNION deploying an updated version of the ZxShell remote access trojan (RAT). ZxShell was developed in 2006 by the persona “LZX”, who then publicly released the source code in 2007. Although various threat actors have created different variations of the RAT, the version used by BRONZE UNION in 2018 contained some previously unobserved properties that suggest the threat group's capabilities continue to evolve: Figure 1 shows a session captured by Red Cloak™ where a BRONZE UNION threat actor launched a remote shell using ZxShell. Like ZxShell, publicly available Gh0st RAT source code led to the emergence of several different variants. In a 2018 campaign, BRONZE UNION likely deployed modified Gh0st RAT malware to multiple systems within a compromised environment that were important to the threat actors' objective. When executed with administrator privileges, the Gh0st RAT binary file was written to %System%\\FastUserSwitchingCompatibilitysex.dll. The installer then created a Windows service and associated service dynamic link library (DLL) chosen from the names listed in Table 1.This Gh0st RAT sample communicated with IP address 43 . 242 . 35 . 16 on TCP port 443, although the traffic is a custom binary protocol and not HTTPS. The malware author also modified the standard Gh0st RAT headers to obfuscate the network traffic (see Figure 2)Bytes 0-4, which are typically known as the Gh0st RAT “identifier,” are randomized in this case. Bytes 5-8 indicate the packet size, and bytes 9-12 indicate the zlib-decompressed packet size. In a departure from previous Gh0st RAT versions, the five bytes at the end of this packet are an XOR key, which must be applied to the packet data before the zlib decompression can be performed. The XOR key is different for each execution of the malware. Once the packet is decoded and decompressed, the data shown in Figure 3 is visible.The first byte of Figure 3 shows the value 0x66, which is the Gh0st RAT code for “login”. After sending the initial phone-home request, Gh0st RAT exchanges 22-byte 'command' packets with its command and control (C2) server. Once again, the first five bytes are randomized and the zlib-compressed part of the packet is XOR-encoded, but the same identifiable structure remains. In the example command packet shown in Figure 4, the first five bytes are the randomized header and the next eight bytes show the compressed and uncompressed size of the data. The XOR key for this packet is 0x7c. In addition to publicly available tools, BRONZE UNION has also used proprietary remote access tools such as SysUpdate and HyperBro since 2016. Despite self-developed tools generally benefitting from lower detection rates than publicly available tools, the threat actors appear to use their own tools more sparingly after securing consistent network access. SysUpdate is a multi-stage malware used exclusively by BRONZE UNION. It has been delivered by multiple methods. In one instance observed by CTU researchers, it was downloaded by a malicious Word document using the Dynamic Data Exchange (DDE) embedded command method. In another incident, the threat actor manually deployed SysUpdate via previously stolen credentials after gaining access to the environment. In a third case, it was delivered via a redirect from a strategic web compromise (SWC). Regardless of the delivery method, the payload is a WinRAR self-extracting (SFX) file that installs the SysUpdate stage 1 payload.SysUpdate stage 1 has no capability beyond downloading the second payload file, SysUpdate Main (see Figure 6). SysUpdate Main employs HTTP communications and uses the hard-coded User-Agent “Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/34.0.1847.116 Safari/537.36”. It downloads a file named m.bin using the HTTP GET method and injects this file into a new svchost.exe process without saving the file to disk. After performing this download, SysUpdate Main reverts to its binary protocol for any additional commands from the C2 server, beaconing every three minutes. The SysUpdate Main file analyzed by CTU researchers included remote access capabilities such as managing files and processes, launching a command shell, interacting with services, taking screenshots, and uploading and downloading additional malware payloads. SysUpdate is flexible malware, as capabilities can be easily introduced and withdrawn by supplying a new payload file. The operator could remove second-stage capabilities at any time and revert to the first stage by supplying a replacement payload file. By withdrawing second-stage payloads when not in use, operators can limit exposure of their full capabilities if the malicious activity is detected. BRONZE UNION was one of the most prolific and active targeted threat groups tracked by CTU researchers in 2017 and 2018. The threat actors have access to a wide range of tools, so they can operate flexibly and select tools appropriate for intrusion challenges. During complex intrusion scenarios, the threat actors leverage their proprietary tools, which offer custom functionality and lower detection rates. They appear to prefer using widely available tools and web shells to maintain access to networks over longer periods. After accessing a network, the threat actors are adept at circumventing common security controls, escalating privileges, and maintaining their access to high-value systems over long periods of time.\n\n\n",
    "reports": [
        {
            "link": "https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/",
            "content": "During the investigation we found several tools such as password dumpers, Monero cryptocurrency miners, portable executable (PE) injectors and a modified version of Gh0st RAT. Even though Bitdefender and TrendMicro have published reports [1] [2] describing some of the tools used by the group, we were not able to find any references to this specific modified version of Gh0st RAT. From our research, we believe that the perpetrator hasn’t shown any advanced technical capabilities in this attack. Most of the available plugins are based on the Gh0st RAT source code and a summary of them can be found below:The network traffic between the victim and the attacker is encrypted using Rivest Cipher 4 (RC4). One of the protocols in the list is named, according to the malware authors, ‘WINNET’ but this is not supported yet and an error message is displayed. Therefore, the purpose of this blog is to briefly describe the modified Gh0st RAT version that is used by the group.",
            "domain": "unit42.paloaltonetworks.com",
            "tokenized": [
                {
                    "sent": "During the investigation we found several tools such as password dumpers, Monero cryptocurrency miners, portable executable (PE) injectors and a modified version of Gh0st RAT.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Even though Bitdefender and TrendMicro have published reports [1] [2] describing some of the tools used by the group, we were not able to find any references to this specific modified version of Gh0st RAT.",
                    "is_evidence": 0
                },
                {
                    "sent": "From our research, we believe that the perpetrator hasn’t shown any advanced technical capabilities in this attack.",
                    "is_evidence": 0
                },
                {
                    "sent": "Most of the available plugins are based on the Gh0st RAT source code and a summary of them can be found below:The network traffic between the victim and the attacker is encrypted using Rivest Cipher 4 (RC4).",
                    "is_evidence": 0
                },
                {
                    "sent": "One of the protocols in the list is named, according to the malware authors, ‘WINNET’ but this is not supported yet and an error message is displayed.",
                    "is_evidence": 0
                },
                {
                    "sent": "Therefore, the purpose of this blog is to briefly describe the modified Gh0st RAT version that is used by the group.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://blog.sekoia.io/luckymouse-uses-a-backdoored-electron-app-to-target-macos/",
            "content": "Even when we observed LuckyMouse using weaponized documents with CVE-2017-118822 (Microsoft Office Equation Editor, widely used by Chinese-speaking actors since December 2017), we can´t prove they were related to this particular attack. In March 2018 we detected an ongoing campaign targeting a national data center in the Central Asia that we believe has been active since autumn 2017. The TTPs for this campaign are quite common for Chinese-speaking actors, where they typically provide new solid wrappers (launcher and decompressor protected with shikata_ga_nai in this case) around their RATs (HyperBro). The operators used the HyperBro Trojan as their last-stage in-memory remote administration tool (RAT). The tools found in this campaign, such as the HyperBro Trojan, are regularly used by a variety of Chinese-speaking actors. We believe this access was abused, for example, by inserting malicious scripts in the country’s official websites in order to conduct watering hole attacks.",
            "domain": "blog.sekoia.io",
            "tokenized": [
                {
                    "sent": "Even when we observed LuckyMouse using weaponized documents with CVE-2017-118822 (Microsoft Office Equation Editor, widely used by Chinese-speaking actors since December 2017), we can´t prove they were related to this particular attack.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In March 2018 we detected an ongoing campaign targeting a national data center in the Central Asia that we believe has been active since autumn 2017.",
                    "is_evidence": 0
                },
                {
                    "sent": "The TTPs for this campaign are quite common for Chinese-speaking actors, where they typically provide new solid wrappers (launcher and decompressor protected with shikata_ga_nai in this case) around their RATs (HyperBro).",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The operators used the HyperBro Trojan as their last-stage in-memory remote administration tool (RAT).",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The tools found in this campaign, such as the HyperBro Trojan, are regularly used by a variety of Chinese-speaking actors.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "We believe this access was abused, for example, by inserting malicious scripts in the country’s official websites in order to conduct watering hole attacks.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.threatminer.org/_reports/2018/LuckyMousehitsnationaldatacentertoorganizecountry-levelwaterholingcampaign-Securelist.pdf/",
            "content": "As this application’s use in China appears low, it is plausible it was developed as a targeted surveillance tool. During a review of the HyberBro Command and Control (C2) infrastructure linked to China-nexus LuckyMouse intrusion set, SEKOIA spotted an unusual connection with an application. Finally, as documented by ESET, compromised messaging applications were already leveraged by LuckyMouse in past activities and this Intrusion Set was observed using Dean Edwards Javascript packer in previous watering hole campaigns. However, as this Intrusion Set was mostly observed continuously carrying out espionage activities, notably against the technology and governmental sectors, SEKOIA assess this hypothesis is unlikely. In 2020, our ESET fellows uncovered compromised versions of Able Desktop, a messaging application widely used in Mongolia in the “StealthyTrident” operation. Infrastructure links were established between China-nexus Intrusion Set LuckyMouse and this operation.",
            "domain": "www.threatminer.org",
            "tokenized": [
                {
                    "sent": "As this application’s use in China appears low, it is plausible it was developed as a targeted surveillance tool.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "During a review of the HyberBro Command and Control (C2) infrastructure linked to China-nexus LuckyMouse intrusion set, SEKOIA spotted an unusual connection with an application.",
                    "is_evidence": 0
                },
                {
                    "sent": "Finally, as documented by ESET, compromised messaging applications were already leveraged by LuckyMouse in past activities and this Intrusion Set was observed using Dean Edwards Javascript packer in previous watering hole campaigns.",
                    "is_evidence": 0
                },
                {
                    "sent": "However, as this Intrusion Set was mostly observed continuously carrying out espionage activities, notably against the technology and governmental sectors, SEKOIA assess this hypothesis is unlikely.",
                    "is_evidence": 0
                },
                {
                    "sent": "In 2020, our ESET fellows uncovered compromised versions of Able Desktop, a messaging application widely used in Mongolia in the “StealthyTrident” operation.",
                    "is_evidence": 0
                },
                {
                    "sent": "Infrastructure links were established between China-nexus Intrusion Set LuckyMouse and this operation.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/april/decoding-network-data-from-a-gh0st-rat-variant/?Month=4&Year=2018/",
            "content": "Based on the functionality of the various tools uploaded to the webshells, we believe the threat actors breach the SharePoint servers to use as a beachhead, then attempt to move laterally across the network via stolen credentials and exploiting vulnerabilities. For more information on the Cyber Threat Alliance, visitwww.cyberthreatalliance.org. However, several of the tools uploaded to the webshells appear to be custom made and likely related to the Emissary Panda threat group. In April 2019, Unit 42 observed the Emissary Panda (AKA APT27, TG-3390, Bronze Union, Lucky Mouse) threat group installing webshells on Sharepoint servers to compromise Government Organizations of two different countries in the Middle East. Many of the tools uploaded to these webshells are hacking tools that are publicly accessible and could be used by multiple threat actors. The Emissary Panda threat group loaded the China Chopper webshell onto SharePoint servers at two Government organizations in the Middle East, which we believe with high confidence involved exploiting a remote code execution vulnerability in SharePoint tracked in CVE-2019-0604.",
            "domain": "www.nccgroup.trust",
            "tokenized": [
                {
                    "sent": "Based on the functionality of the various tools uploaded to the webshells, we believe the threat actors breach the SharePoint servers to use as a beachhead, then attempt to move laterally across the network via stolen credentials and exploiting vulnerabilities.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "For more information on the Cyber Threat Alliance, visitwww.cyberthreatalliance.org.",
                    "is_evidence": 0
                },
                {
                    "sent": "However, several of the tools uploaded to the webshells appear to be custom made and likely related to the Emissary Panda threat group.",
                    "is_evidence": 0
                },
                {
                    "sent": "In April 2019, Unit 42 observed the Emissary Panda (AKA APT27, TG-3390, Bronze Union, Lucky Mouse) threat group installing webshells on Sharepoint servers to compromise Government Organizations of two different countries in the Middle East.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Many of the tools uploaded to these webshells are hacking tools that are publicly accessible and could be used by multiple threat actors.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Emissary Panda threat group loaded the China Chopper webshell onto SharePoint servers at two Government organizations in the Middle East, which we believe with high confidence involved exploiting a remote code execution vulnerability in SharePoint tracked in CVE-2019-0604.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}