{
    "event_id": "096",
    "claim": "APT37 is a threat actor heavily focused on targeting entities in South Korea. It is constantly updating its tactics, techniques and procedures as is evident from the multiple file types used in the initial stages by it.",
    "original_label": "true",
    "label": "true",
    "explain": "Figure 9 shows a decoy file related to the Hanwha General Insurance - a major insurer in South Korea. This decoy file was sent along with the CHM file in an archive file - BoanMail.rar It is well-known that APT37 uses a Chinotto PowerShell-based backdoor which is deployed on the endpoint through a malicious Windows help file (CHM). These CHM files are distributed inside archive files. Most of these archive files contain two components - the malicious CHM file and the decoy file to be displayed to the victim. In most cases, the decoy files are password-protected. The password to open the decoy file is displayed by the CHM file. Figure 10 below shows an example of code inside the CHM file which is responsible for displaying the decoy file to the victim, downloading a malicious HTA file from the attacker's server and executing it.So far in most of the campaigns of APT37 deploying Chinotto PowerShell backdoor, they have leveraged CHM files distributed inside archive files. Interestingly, on March 15th 2023, around the time of our investigation, the threat actor uploaded a malicious Microsoft Excel Add-in to the GitHub repository. This Add-in is an XLL file. XLL files are DLLs which function as an add-in for the Microsoft Excel application. We haven't seen this attack vector used by APT37 before and we believe this to be the first case being documented.For the purpose of technical analysis, we will use the XLL file with MD5 hash: 82d58de096f53e4df84d6f67975a8dda XLL files get activated when they are loaded by the MS Excel application. There are various callback functions provided by Microsoft which allow the XLL file to communicate with the Excel application. One of the most common functions is xlAutoOpen() which is called as soon as the DLL is loaded and activated by the MS excel application. Figure 11 below shows the code present in the XLL file in our case. Below are the main steps performed by this XLL file.We recovered some LNK files from the GitHub repository which were uploaded in August 2022 and apparently used in in-the-wild attacks around the same timeframe. These LNK files were present inside RAR archives. Along with the LNK file, an HTML file was present masquerading as a sign-in page of the South Korean company - LG. The two LNK files we observed, both used dual extensions - “html.lnk” and “pdf.lnk”. These LNK files were used to execute MSHTA and download the malicious HTA file from the attacker's server. Rest of the attack-chain is similar to other cases which finally leads to the Chinotto PowerShell-based backdoor. We analyzed the metadata of the LNK file with LECmd tool and noticed that both the LNK files were generated on a Virtual Machine running VMWare and with a Mac address of: 00:0c:29:41:1b:1c Since the threat actor reused the same Virtual Machine to generate multiple payloads, this information could be useful for threat hunting and threat attribution purposes in future. Figure 12 and 13 show the outputs of LECmd tool highlighting the target command executed by the LNK and other important metadata.In March 2022, a macro-based MS office Word file was uploaded to the GitHub repository. This macro would launch MSHTA to download the PowerShell-based Chinotto backdoor as well. The target URL from where the HTA file is fetched is also the same as the previous case. This shows that the threat actor uses multiple initial file formats and attack vectors to deploy the same backdoor.Another attack vector used by APT37 to deploy Chinotto PowerShell-based backdoor on the endpoint is using HWP files with embedded OLE objects. These OLE objects contain a malicious PE32 binary which executes MSHTA to download a PowerShell-based backdoor from the C2 server. When viewed with Hancom Office, the embedded OLE objects take the form of a clickable element in the document's body. APT37 makes use of misleading bait images to entice the user to click on the OLE object elements, an action required to cause the execution of the malicious PE payloads inside these objects.Figure 16: Malicious HWP document by APT37. The Korean-language dialog is fake - it’s in fact an OLE object represented by a static image of a dialog. When it’s clicked, a real dialog pops up - prompting the user to confirm the execution of the payload.As we discussed in this blog, APT37 is a threat actor heavily focused on targeting entities in South Korea. It is constantly updating its tactics, techniques and procedures as is evident from the multiple file types used in the initial stages by it. The themes used by this threat actor range from geopolitics, current events, education to finance and insurance. It is also particularly interested in current events and activities related to the Korean peninsula. We will continue monitoring the activities of this threat actor and ensure our customers are protected against APT37.\n\n\n",
    "reports": [
        {
            "link": "https://blog.talosintelligence.com/korea-in-crosshairs/",
            "content": "Because the attacker was careful about who they attacked, we were unable to obtain this file during our analysis. Given the regional file format used there is a chance that somelsecuritly software suites may not handle them well, and this may have provided an evasioncase for the attacker. The attackers exploited CVE-2017-0199 in order to download and execute a malicious HTA document inside of Microsoft Office. The purpose of the malicious documents was to install andto execute ROKRAT, a remote administration tool (RAT). This document was a decoy aimed to entice the user to open malicious documents embedded further down the page. This specific resource containsmalicious shellcode used by the malware.",
            "domain": "blog.talosintelligence.com",
            "tokenized": [
                {
                    "sent": "Because the attacker was careful about who they attacked, we were unable to obtain this file during our analysis.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Given the regional file format used there is a chance that somelsecuritly software suites may not handle them well, and this may have provided an evasioncase for the attacker.",
                    "is_evidence": 0
                },
                {
                    "sent": "The attackers exploited CVE-2017-0199 in order to download and execute a malicious HTA document inside of Microsoft Office.",
                    "is_evidence": 0
                },
                {
                    "sent": "The purpose of the malicious documents was to install andto execute ROKRAT, a remote administration tool (RAT).",
                    "is_evidence": 0
                },
                {
                    "sent": "This document was a decoy aimed to entice the user to open malicious documents embedded further down the page.",
                    "is_evidence": 0
                },
                {
                    "sent": "This specific resource containsmalicious shellcode used by the malware.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://blog.talosintelligence.com/navrat/",
            "content": "Here is the content of the file:The executed shellcode will first perform a decoding routine designed to download an additional payload from the internet. If a malicious document is opened, a remote access trojan that we're calling \"NavRAT\" is downloaded, which can perform various actions on the victim machine, including command execution, and has keylogging capabilities. The approach is close to the techniques used by Group123 attacks we have observed and written about over the past 18 months or so: the shellcode contains similarities, the final payload is malicious shellcode located in an image hosted on a compromised website, and the author uses an open platform as the C2 server. The malware's author logs every action to a file (encoded). The uploaded file(s) are sent by email, and the downloaded files are retrieved from an email attachment We have already observed malware using free email platforms for abuse, but this is the first time we have identified a malware that uses Naver — which is known for its popularity in South Korea. This object is used to execute malicious shellcode on the system.",
            "domain": "blog.talosintelligence.com",
            "tokenized": [
                {
                    "sent": "Here is the content of the file:The executed shellcode will first perform a decoding routine designed to download an additional payload from the internet.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "If a malicious document is opened, a remote access trojan that we're calling \"NavRAT\" is downloaded, which can perform various actions on the victim machine, including command execution, and has keylogging capabilities.",
                    "is_evidence": 0
                },
                {
                    "sent": "The approach is close to the techniques used by Group123 attacks we have observed and written about over the past 18 months or so: the shellcode contains similarities, the final payload is malicious shellcode located in an image hosted on a compromised website, and the author uses an open platform as the C2 server.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The malware's author logs every action to a file (encoded).",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The uploaded file(s) are sent by email, and the downloaded files are retrieved from an email attachment We have already observed malware using free email platforms for abuse, but this is the first time we have identified a malware that uses Naver — which is known for its popularity in South Korea.",
                    "is_evidence": 0
                },
                {
                    "sent": "This object is used to execute malicious shellcode on the system.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://ti.dbappsecurity.com.cn/apt/report/dcaad044d9ed82922a44c5f9e9baed10.pdf/",
            "content": "It is a commonly used backdoor, and was used as recently as March 2018.One kind of malware used by Red Eyes group destroys all data on the hard disk when executed. Malware is executed if the user clicks on the file. Most of the malware took the form of document files, droppers, or backdoors. One of the characteristics of malware from this group is that it uses a program database (PDB) text string. The actual malware is encrypted and a similar decryption code is found in its variants. This group of hackers attempted to attack an ICT company in May 2015 by disguising malware as a security update (malware removal and patch update) for the Hancom Office suite, which includes Hangul (md5 : 89c3254aa577d3788f0f402fe6e5a855).In January 2016, this group distributed malware (md5: 06ae5d62d56f21cd2676989743b9626c) purporting to discuss countermeasures to North Korea's nuclear weapons program, “Truth and countermeasures on North Korea's hydrogen bomb game.hwp”.",
            "domain": "ti.dbappsecurity.com.cn",
            "tokenized": [
                {
                    "sent": "It is a commonly used backdoor, and was used as recently as March 2018.One kind of malware used by Red Eyes group destroys all data on the hard disk when executed.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Malware is executed if the user clicks on the file.",
                    "is_evidence": 0
                },
                {
                    "sent": "Most of the malware took the form of document files, droppers, or backdoors.",
                    "is_evidence": 0
                },
                {
                    "sent": "One of the characteristics of malware from this group is that it uses a program database (PDB) text string.",
                    "is_evidence": 0
                },
                {
                    "sent": "The actual malware is encrypted and a similar decryption code is found in its variants.",
                    "is_evidence": 0
                },
                {
                    "sent": "This group of hackers attempted to attack an ICT company in May 2015 by disguising malware as a security update (malware removal and patch update) for the Hancom Office suite, which includes Hangul (md5 : 89c3254aa577d3788f0f402fe6e5a855).In January 2016, this group distributed malware (md5: 06ae5d62d56f21cd2676989743b9626c) purporting to discuss countermeasures to North Korea's nuclear weapons program, “Truth and countermeasures on North Korea's hydrogen bomb game.hwp”.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.mandiant.com/resources/reports/apt37-reaper-overlooked-north-korean-actor/",
            "content": "Along with custom malware used for espionage purposes, APT37 also has access to destructive malware. In April 2017, APT37 targeted South Korean military and government organizations with the DOGCALL backdoor and RUHAPPY wiper malware. In one instance, APT37 weaponized a video downloader application with KARAE malware that was indiscriminately distributed to South Korean victims through torrent websites. Once opened, the malicious document communicated with a compromised website, most likely to surreptitiously download and install a backdoor called SHUTTERSPEED (MD5: 7c2ebfc7960aac6f8d58b37e3f092a9c). The tool would enable APT37 to collect system information, take screenshots and download additional malicious files to the victim computer. Their malware is characterized by a focus on stealing information from victims, with many set up to automatically exfiltrate data of interest.",
            "domain": "www.mandiant.com",
            "tokenized": [
                {
                    "sent": "Along with custom malware used for espionage purposes, APT37 also has access to destructive malware.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In April 2017, APT37 targeted South Korean military and government organizations with the DOGCALL backdoor and RUHAPPY wiper malware.",
                    "is_evidence": 0
                },
                {
                    "sent": "In one instance, APT37 weaponized a video downloader application with KARAE malware that was indiscriminately distributed to South Korean victims through torrent websites.",
                    "is_evidence": 0
                },
                {
                    "sent": "Once opened, the malicious document communicated with a compromised website, most likely to surreptitiously download and install a backdoor called SHUTTERSPEED (MD5: 7c2ebfc7960aac6f8d58b37e3f092a9c).",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The tool would enable APT37 to collect system information, take screenshots and download additional malicious files to the victim computer.",
                    "is_evidence": 0
                },
                {
                    "sent": "Their malware is characterized by a focus on stealing information from victims, with many set up to automatically exfiltrate data of interest.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}