{
    "event_id": "098",
    "claim": "APT39 is an Iranian Cyber Espionage Group Focused on Personal Information.",
    "original_label": "true",
    "label": "true",
    "explain": "In December 2018, FireEye identified APT39 as an Iranian cyber espionage group responsible for widespread theft of personal information. We have tracked activity linked to this group since November 2014 in order to protect organizations from APT39 activity to date. APT39’s focus on the widespread theft of personal information sets it apart from other Iranian groups FireEye tracks, which have been linked to influence operations, disruptive attacks, and other threats. APT39 likely focuses on personal information to support monitoring, tracking, or surveillance operations that serve Iran’s national priorities, or potentially to create additional accesses and vectors to facilitate future campaigns. APT39 was created to bring together previous activities and methods used by this actor, and its activities largely align with a group publicly referred to as “Chafer.” However, there are differences in what has been publicly reported due to the variances in how organizations track activity. APT39 primarily leverages the SEAWEED and CACHEMONEY backdoors along with a specific variant of the POWBAT backdoor. While APT39's targeting scope is global, its activities are concentrated in the Middle East. APT39 has prioritized the telecommunications sector, with additional targeting of the travel industry and IT firms that support it and the high-tech industry. The countries and industries targeted by APT39 are depicted in Figure 1.APT39's focus on the telecommunications and travel industries suggests intent to perform monitoring, tracking, or surveillance operations against specific individuals, collect proprietary or customer data for commercial or operational purposes that serve strategic requirements related to national priorities, or create additional accesses and vectors to facilitate future campaigns. Government entities targeting suggests a potential secondary intent to collect geopolitical data that may benefit nation-state decision making. Targeting data supports the belief that APT39's key mission is to track or monitor targets of interest, collect personal information, including travel itineraries, and gather customer data from telecommunications firms.APT39 uses a variety of custom and publicly available malware and tools at all stages of the attack lifecycle.For initial compromise, FireEye Intelligence has observed APT39 leverage spear phishing emails with malicious attachments and/or hyperlinks typically resulting in a POWBAT infection. APT39 frequently registers and leverages domains that masquerade as legitimate web services and organizations that are relevant to the intended target. Furthermore, this group has routinely identified and exploited vulnerable web servers of targeted organizations to install web shells, such as ANTAK and ASPXSPY, and used stolen legitimate credentials to compromise externally facing Outlook Web Access (OWA) resources.Post-compromise, APT39 leverages custom backdoors such as SEAWEED, CACHEMONEY, and a unique variant of POWBAT to establish a foothold in a target environment. During privilege escalation, freely available tools such as Mimikatz and Ncrack have been observed, in addition to legitimate tools such as Windows Credential Editor and ProcDump. Internal reconnaissance has been performed using custom scripts and both freely available and custom tools such as the port scanner, BLUETORCH.APT39 facilitates lateral movement through myriad tools such as Remote Desktop Protocol (RDP), Secure Shell (SSH), PsExec, RemCom, and xCmdSvc. Custom tools such as REDTRIP, PINKTRIP, and BLUETRIP have also been used to create SOCKS5 proxies between infected hosts. In addition to using RDP for lateral movement, APT39 has used this protocol to maintain persistence in a victim environment. To complete its mission, APT39 typically archives stolen data with compression tools such as WinRAR or 7-Zip.There are some indications that APT39 demonstrated a penchant for operational security to bypass detection efforts by network defenders, including the use of a modified version of Mimikatz that was repacked to thwart anti-virus detection in one case, as well as another instance when after gaining initial access APT39 performed credential harvesting outside of a compromised entity's environment to avoid detection.We believe APT39's significant targeting of the telecommunications and travel industries reflects efforts to collect personal information on targets of interest and customer data for the purposes of surveillance to facilitate future operations. Telecommunications firms are attractive targets given that they store large amounts of personal and customer information, provide access to critical infrastructure used for communications, and enable access to a wide range of potential targets across multiple verticals. APT39's targeting not only represents a threat to known targeted industries, but it extends to these organizations' clientele, which includes a wide variety of sectors and individuals on a global scale. APT39's activity showcases Iran's potential global operational reach and how it uses cyber operations as a low-cost and effective tool to facilitate the collection of key data on perceived national security threats and gain advantages against regional and global rivals.\n\n\n",
    "reports": [
        {
            "link": "https://www.bitdefender.com/files/News/CaseStudies/study/332/Bitdefender-Whitepaper-Chafer-creat4491-en-EN-interactive.pdf/",
            "content": "Bitdefender has spotted the group targeting critical infrastructure from the Middle East, presumably for intelligence gathering. Bitdefender researchers have found attacks conducted by this actor in the Middle East region, dating back to 2018. Chafer APT is a threat group with an apparent Iranian link. It is known to be active since 2014, focusing on cyber espionage campaigns. Once the victims were compromised, attackers started to bring reconnaissance tools for network scanning (“xnet. One of those components, “snmp.exe”, is also present on some of the victims in Kuwait, under the name “imjpuexa.exe”, linking these attacks to the same threat actors.",
            "domain": "www.bitdefender.com",
            "tokenized": [
                {
                    "sent": "Bitdefender has spotted the group targeting critical infrastructure from the Middle East, presumably for intelligence gathering.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Bitdefender researchers have found attacks conducted by this actor in the Middle East region, dating back to 2018.",
                    "is_evidence": 0
                },
                {
                    "sent": "Chafer APT is a threat group with an apparent Iranian link.",
                    "is_evidence": 0
                },
                {
                    "sent": "It is known to be active since 2014, focusing on cyber espionage campaigns.",
                    "is_evidence": 0
                },
                {
                    "sent": "Once the victims were compromised, attackers started to bring reconnaissance tools for network scanning (“xnet.",
                    "is_evidence": 0
                },
                {
                    "sent": "One of those components, “snmp.exe”, is also present on some of the victims in Kuwait, under the name “imjpuexa.exe”, linking these attacks to the same threat actors.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://securelist.com/chafer-used-remexi-malware/89538/",
            "content": "Activity of the Chafer APT group has been observed since at least 2015, but based on things like compilation timestamps and C&C registration, it’s possible they have been active for even longer. Interestingly, the FBI website for wanted cybercriminals includes two Iranians called Mohammad Reza, although this could be a common name or even a false flag. The attackers were using an improved version of Remexi in what the victimology suggests might be a domestic cyber-espionage operation. This blogpost is based in our original report shared with our APT Intelligence Reporting customers last November 2018. Throughout the autumn of 2018 we analyzed a long-standing (and still active at that time) cyber-espionage campaign that was primarily targeting foreign diplomatic entities based in Iran. Traditionally, Chafer has been focusing on targets inside Iran,although their interests clearly include other countries in the Middle East.",
            "domain": "securelist.com",
            "tokenized": [
                {
                    "sent": "Activity of the Chafer APT group has been observed since at least 2015, but based on things like compilation timestamps and C&C registration, it’s possible they have been active for even longer.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Interestingly, the FBI website for wanted cybercriminals includes two Iranians called Mohammad Reza, although this could be a common name or even a false flag.",
                    "is_evidence": 0
                },
                {
                    "sent": "The attackers were using an improved version of Remexi in what the victimology suggests might be a domestic cyber-espionage operation.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "This blogpost is based in our original report shared with our APT Intelligence Reporting customers last November 2018.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Throughout the autumn of 2018 we analyzed a long-standing (and still active at that time) cyber-espionage campaign that was primarily targeting foreign diplomatic entities based in Iran.",
                    "is_evidence": 0
                },
                {
                    "sent": "Traditionally, Chafer has been focusing on targets inside Iran,although their interests clearly include other countries in the Middle East.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/chafer-latest-attacks-reveal-heightened-ambitions/",
            "content": "Alongside evidence of compromise of the organization tself,$ymantec also found a copy of one of the company's own fles, relating to its messagingsoftware, on a staging server used by Chafer. By limiting their use of malware, groups such as Chafer hope to be lessconspicuous on a victim's network and, if discovered, make their attack more difficult to attribute. Chafer, the lran-based targeted attack group, mounted further operations throwghout 2017, aacking more organizations in the Midle East and beyond,and deploying several new tools. One of the organizations compromised by Chafer in 2017 was a telecoms services provider inthe Middle East, which ses its solutions to multipletelecoms operators in the reglon. The group staged a number of ambitious new attacks last year,includingthe compromise of a major telecoms servicesprowlder in the region. chafer appears to be primarlyengaged in survellance and tracking ofindiiduals, with most of its attacks likely carried out to gather information on targets or faclltate survellance Chafer has been active since at least July 2014 and its activities were first exposed by Symantec in Decamber 2015htips./www.symantec.com/connect/blogg/iran-based-attackers-use-back- door-threats-spy*middle-eastern-targets), when it was found to beconducting targeted survellance of domestic and internationaltargets.",
            "domain": "symantec-enterprise-blogs.security.com",
            "tokenized": [
                {
                    "sent": "Alongside evidence of compromise of the organization tself,$ymantec also found a copy of one of the company's own fles, relating to its messagingsoftware, on a staging server used by Chafer.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "By limiting their use of malware, groups such as Chafer hope to be lessconspicuous on a victim's network and, if discovered, make their attack more difficult to attribute.",
                    "is_evidence": 0
                },
                {
                    "sent": "Chafer, the lran-based targeted attack group, mounted further operations throwghout 2017, aacking more organizations in the Midle East and beyond,and deploying several new tools.",
                    "is_evidence": 0
                },
                {
                    "sent": "One of the organizations compromised by Chafer in 2017 was a telecoms services provider inthe Middle East, which ses its solutions to multipletelecoms operators in the reglon.",
                    "is_evidence": 0
                },
                {
                    "sent": "The group staged a number of ambitious new attacks last year,includingthe compromise of a major telecoms servicesprowlder in the region.",
                    "is_evidence": 0
                },
                {
                    "sent": "chafer appears to be primarlyengaged in survellance and tracking ofindiiduals, with most of its attacks likely carried out to gather information on targets or faclltate survellance Chafer has been active since at least July 2014 and its activities were first exposed by Symantec in Decamber 2015htips./www.symantec.com/connect/blogg/iran-based-attackers-use-back- door-threats-spy*middle-eastern-targets), when it was found to beconducting targeted survellance of domestic and internationaltargets.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://attack.mitre.org/docs/training-cti/FireEye%20APT39%20-%20original%20report.pdf/",
            "content": "APT39 likely focuses on personal information to support monitoring, tracking, or surveillance operations that serve Iran’s national priorities, or potentially to create additional accesses and vectors to facilitate future campaigns. APT39's activity showcases Iran's potential global operational reach and how it uses cyber operations as a low-cost and effective tool to facilitate the collection of key data on perceived national security threats and gain advantages against regional and global rivals. APT39’s focus on the widespread theft of personal information sets it apart from other Iranian groups FireEye tracks, which have been linked to influence operations, disruptive attacks, and other threats. In December 2018, FireEye identified APT39 as an Iranian cyber espionage group responsible for widespread theft of personal information. We believe APT39's significant targeting of the telecommunications and travel industries reflects efforts to collect personal information on targets of interest and customer data for the purposes of surveillance to facilitate future operations. We have moderate confidence APT39 operations are conducted in support of Iranian national interests based on regional targeting patterns focused in the Middle East, infrastructure, timing, and similarities to APT34, a group that loosely aligns with activity publicly reported as “OilRig”.",
            "domain": "attack.mitre.org",
            "tokenized": [
                {
                    "sent": "APT39 likely focuses on personal information to support monitoring, tracking, or surveillance operations that serve Iran’s national priorities, or potentially to create additional accesses and vectors to facilitate future campaigns.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "APT39's activity showcases Iran's potential global operational reach and how it uses cyber operations as a low-cost and effective tool to facilitate the collection of key data on perceived national security threats and gain advantages against regional and global rivals.",
                    "is_evidence": 1
                },
                {
                    "sent": "APT39’s focus on the widespread theft of personal information sets it apart from other Iranian groups FireEye tracks, which have been linked to influence operations, disruptive attacks, and other threats.",
                    "is_evidence": 0
                },
                {
                    "sent": "In December 2018, FireEye identified APT39 as an Iranian cyber espionage group responsible for widespread theft of personal information.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "We believe APT39's significant targeting of the telecommunications and travel industries reflects efforts to collect personal information on targets of interest and customer data for the purposes of surveillance to facilitate future operations.",
                    "is_evidence": 0
                },
                {
                    "sent": "We have moderate confidence APT39 operations are conducted in support of Iranian national interests based on regional targeting patterns focused in the Middle East, infrastructure, timing, and similarities to APT34, a group that loosely aligns with activity publicly reported as “OilRig”.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}