{
    "event_id": "116",
    "claim": "The Carbanak group, which has a long track record of compromising infrastructure belonging to financial institutions, is still active.",
    "original_label": "true",
    "label": "true",
    "explain": "In mid-2018, Bitdefender researchers investigated a targeted attack on an Eastern European financial institution, gaining new insights and creating a complete event timeline showing how the infamous group Carbanak infiltrates organizations, how it moves laterally across the infrastructure, and the time it takes to set up the actual heist. The initial point of compromise found in our investigation involved the use of spear-phishing emails with malicious URLs and tainted documents rigged to download a Cobalt Strike beacon component. Within hours of compromise, the cybercriminal group would begin to move laterally across the infrastructure, identify critical documents and prepare them for exfiltration, and try to access the organization’s ATM and banking applications. Bitdefender’s forensic analysis revealed some key compromise tactics.Several spear-phishing campaigns attributed to Carbanak, all occurring between March and May 2018, were analyzed by security researchers in 2018. These campaigns impersonated emails from high-profile organizations, such as IBM or European Central Bank, but also cybersecurity companies. While most forensic investigations focus on offering a highly technical analysis of the payloads used by the Carbanak group, Bitdefender’s investigation offers a complete timeline of events, from the moment the email reached the victim’s inbox to the moment of the heist.One of the most prolific APT-style cyberattacks, specifically targeting the financial sector, is known as Carbanak. Discovered in 2014, the campaign quickly gained notoriety after compromising the security systems of 100 banks in 40 countries and stealing up to $1 billion in the process. Banks in countries such as Russia, the United Kingdom, the Netherlands, Spain, Romania, Belarus, Poland, Estonia, Bulgaria, Georgia, Moldova, Kyrgyzstan, Armenia, Taiwan and Malaysia have allegedly been targeted with spear-phishing emails, luring victims into clicking malicious URLs and executing booby-trapped documents. The same group is believed to have also been using the Cobalt Strike framework to run sophisticated campaigns, plotting and performing financial heists of financial institutions. Following an investigation led by law enforcement in cooperation with cybersecurity companies, the leader of the group was apprehended in Alicante, Spain, on March 26th, 2018. However, this action doesn’t appear to have made a dent in the cybercriminal organization, as subsequent spear-phishing campaigns seem to have been reported from March until May 2018.A Carbanak trademark in cyberattacks remains the use of Cobalt Strike – a powerful pentesting tool designed for exploiting and executing malicious code, simulating post-exploitation actions of advanced threat actors – which allows them to infiltrate the organization, move laterally, exfiltrate data, and deploy anti-forensic and evasion tools. While the end results of such an attack can be easily assessed in financial losses, little information has been publicly available until now on how the attack occurs step-by-step within a compromised organization.The APT-style cybercriminal group has a long track record of successfully targeting financial institutions around the world to either cash out at ATMs or perform wire transfers using the bank’s internal systems. The spear-phishing emails sent to the financial institutions either end up with victims downloading a tampered document meant to download the Cobalt Strike beacon or to exploit several unpatched Remote Code Execution Vulnerabilities and deploy a backdoor. Once the user attempts to open the attached documents, scripts (Fig. 1) embedded within the files are dropped on the disk and automatically executed in the background. This is a popular technique, sometimes associated with advanced persistent threats (APTs) attributed to nation-sponsored threat actors.Designed for stealth infiltration within the targeted system, the attacks use reconnaissance tools designed to assess the state of the victim’s workstation and determine what tools should be downloaded next, or even open decoy documents similar to the one in Fig.2, to avoid drawing victims’ suspicion.Bitdefender’s forensics and investigation team was contacted to look into a security incident that started in May 2018 with an email received by two of the bank’s employees. As previously mentioned, the date coincides with a Carbanak spear-phishing campaign. The attack target was to gain access to banking systems and eventually withdraw funds in cash from ATMs. The pattern exhibited by attackers and their lateral movements across the infrastructure show that they knew what types of information to look for and they were skilled at evasion techniques. Judging by the way the adversaries interacted with different systems, the targeted hosts and the documents prepared for exfiltration, it appears that the cybercriminal group focused initially on mapping the internal processes and applications of the affected institution. They displayed a deep understanding of the nature and location of the data they sought. They were able to maintain a low network footprint and avoid suspicion by using selected single workstations as a hub for centralizing collected information and for communication with their command & control server, outside the regular working hours of the bank. After compromising the first victim, the aggressors’ next goal was to find admin-level credentials that would allow them to move across the entire infrastructure. By performing all these operations outside business hours and limiting their interaction to only a handful of systems, the cybercriminal group minimized the detection opportunities.A carefully executed network reconnaissance and lateral movement plan was unfolding during this time. What follows is a timeline of events that started with the initial spear-phising email.At this point, the adversary had the ability to download and execute new payloads, download additional scripts, run shell commands to move laterally in the infrastructure, and delete files from the system and cleaning registry keys to leave fewer forensics traces. In this phase, attackers compromised additional network endpoints, gathering data and using one of the endpoints for collecting and storing internal documents that appeared of interest.Lateral movements and intelligence collection continue, while attackers also target and compromise additional internal hosts and servers that will be used during the actual heist. Between Day 30 to 46, over a period of 17 days, a series of archives were created containing manuals, guides and training materials for different applications. The information gathered was archived and organized in different folders. This information was relevant in planning the attack on the bank and, potentially, other banks that share similar systems. The cybercriminal group could be actively improving its understanding of internal banking systems by collecting and studying this type of information, in an attempt to make their attacks more efficient and stealthier. Their specialization in compromising banking infrastructures could be a direct consequence of intelligence collected and assimilated after each attack on previous financial institutions. This level of intimate knowledge of how banking applications work based on stolen documentation, helps them quickly achieve their purpose, which is to access and transfer financial assets. The more information they have on the inner workings of banking applications, the easier it becomes to pull off surgical cyber heists and avoid security tripwires.Starting on Day 33, attackers connected to servers and hosts with access to banking applications. The connections were initiated from workstations that had activity after regular office hours. The workstations used to connect to these machines were logged in from and controlled by a workstation that was not part of the legitimate corporate infrastructure. The system belonged to the adversary and accessed the organization network through a VPN tunnel established by the Cobalt Strike beacon component, to contact the internal corporate network systems. These command & control connections last between 20 minutes and one hour on average, based on the logs available for forensic investigation. The documents prepared for exfiltration, which were relevant to the internal applications, as well as the connections to banking applications after regular office hours, point to a financially motivated attack. Below is a complete lateral movement timeline that includes all major events related to what infrastructure assets were compromised and when. Marked in red are the three major milestones achieved during the attack: the moment the domain controller was compromised, the moment documents started being stored on an internal endpoint, and when the threat actors first connected to a host with access to banking applications . This lateral movement timeline was compiled based on forensic evidence correlated from several analyzed systems and network events. It is the most relevant blueprint, revealing a complete attack timeline and behavior of the notorious financial cyber-criminal group when inside an infrastructure belonging to a financial organization.Below is a detailed analysis of the key indicators of compromise that helped build the APT timeline. It includes an event timeline compiled from two workstations used in the attack: the one used to compromise the domain controller and the one used to store all the network-collected data. The following events help paint a clear picture of actions immediately after the spear-phishing email attachment was opened, and show how the threat actors move laterally across the infrastructure and how they gathered relevant documentation. The “swift-fraud[.]com/documents/94563784.doc” URL was opened from the body of an email received in a spearphishing campaign targeting financial institutions. The Bitdefender research team obtained the document from our Threat Intelligence feeds and started analyzing it. According to other threat reports, the same URL has been used in delivering other tainted documents, potentially part of similar campaigns aimed at other financial institutions. This suggests the cybercriminal group may have been delivering multiple documents to victims, potentially laced with other exploits or droppers. The attack flow leaves behind a temporary file, which was found on two of the systems analyzed in the incident response. This temporary file was created on the filesystem after the opening of the original document file, downloaded from the malicious URL mentioned above. Analysis of the document on one of the systems reveals the steps involved in compromising the targeted system via the spear phishing email. The document contains four objects that are dropped on the filesystem of the victim:The DLL Dropper downloaded on step four was not found on the file system and has the role of decrypting and dropping yet another JavaScript Dropper on the system. The decrypted JavaScript will be saved at the path “%APPDATA%\\.txt” where registry_value = “HKEY_CURRENT_USER\\Software\\Microsoft\\Notepad[USERNAME]\\303F1428C3F”. Before exiting, the DLL will self-delete. The file “303F1428C3F.txt” (eb561d46c6283c632df88bd20ade6df4) can be found at the path C:\\Users\\[redacted]\\ AppData\\Roaming\\303F1428C3F.txt. Also, the file was obfuscated and encrypted with RC4. After decryption, the binary tried to download a JavaScript backdoor from the Command and Control server (C&C) “nl[.][redacted][.]kz/robots.txt” and saved the file to “%APPDATA%\\9D01CA.txt”. The backdoor “%APPDATA%\\9D01CA.txt” was then executed via “regsrv32” (ex. “regsvr32 /S /N /U /I:path_backdoor scrobj”). The file “9D01CA.txt” sent an initial fingerprint of the system compromised which contained the name of the antivirus solution installed on the system, the local IP address, username, computername and OS version. After this communication, the component waited for instructions from the C&C “nl[.][redacted][.]kz/api/v1”. The traffic with the C&C was encrypted and the commands received from the C&C would split into five types.All files mentioned in this stage of the attack were created on the system on Day 0 at around 16:49, when the first download link was accessed. It is worth mentioning that a binary executable named “rad353F7.tmp”, which appeared on the system at a later date, Day 6, was most certainly downloaded on the system by the Javascript Backdoor “9D01CA.txt”. Day 0 at 16:48:58 marks the touchdown of a decoy file on two systems. This file is a decoy because it acts as a normal document file while the malicious payload is being dropped on the system. On one of the two workstations, the decoy file has the creation time of Day 0 at 16:49:09 (10 seconds later than the other workstation) and the path C:\\Users\\[redacted]\\AppData\\Local\\ Temp\\cqHfjCkTtMwG.doc. This system shows more stages of the attack, because the adversary used this machine to perform lateral movement and compromise a domain administrator account within two hours of the initial compromise. After the compromise of the domain administrator account, a network discovery is performed and systems start to be logged on via remote desktop protocol to reach the objective of infiltrating the network and gathering information. Below is a complete timeline of events recorded on the workstation that was used to compromise the domain administrator account employed by attackers throughout the lateral movement process.The Cobalt Strike beacon is a malicious agent implant that, once dropped on a compromised system, calls back to the attacker and checks for new commands to be executed on the compromised system. This versatile tool can support two types of communication mechanisms: asynchronous and interactive. The asynchronous mode keeps commands in a queue and, when the beacon connects to a C&C, it downloads commands, executes them, and finally reports results to the C&C server. This can be particularly useful when trying to keep a low network footprint and not trigger any alarms by constantly “chatting” back and forth with the C&C server. While the asynchronous communication mode is also known as “low and slow”, in the sense that it becomes inactive when an internet connection is not present, the interactive communication mode offers real-time interaction with the compromised workstation. Overall framework capabilities include, but are not limited to, executing shell commands, uploading and downloading files, recording keystrokes and taking screenshots, escalating privileges, deploying exploits, bypassing User Account Control (UAC), and even deploying memory scraping tools, such as Mimikatz, or enumerating Active Directory (AD) hosts. By supporting malleable communication with the C&C server, it can help attackers blend malicious traffic as legitimate, by allowing them to transform and store data, interpret it backwards, and extract and recover that data from a transaction. Cobalt Strike Framework capabilities.The Carbanak group, which has a long track record of compromising infrastructure belonging to financial institutions, is still active. Its purpose remains to manipulate financial assets, such as transferring funds from bank accounts or taking over ATM infrastructures and instructing them to dispense cash at predetermined time intervals. Bitdefender’s investigation shows the attackers’ main methods remain to quietly infiltrate the infrastructure by establishing a foothold on an employee’s system, then move laterally across the infrastructure or elevate privileges to find critical systems that manage financial transactions or ATM networks. This attack falls in line with previous objectives observed in past attacks on other financial institutions, as the cybercriminal organization targeted the ATM network to reach systems belonging to key people within the organization who have access to ATM systems. If the attack had succeeded, it would have given hackers control over the ATM network, while money mules would have been standing by the ATM machines at pre-set time intervals to cash them out. They could have also been able to reset the cash-out limit on ATMs, using a predetermined / preauthorized card. This way, money mules could have extracted the same amount over and over, without the ATMs reporting any transactions to the bank. It is not uncommon in a targeted attack for phishing emails to bypass anti-spam solutions deployed at the mail server level, which is why it is good practice to deploy an in-depth security model that ensures URL filtering, behavior-based detection techniques and sandboxing, aside from classical anti-malware solutions. An enterprise-level solution that looks at both network traffic and endpoint behavior would observe lateral movements by the attacker and flag them for review by a security analyst. The damage observed throughout the investigation process was limited to access of internal documents on the compromised systems and user account credentials leaked.\n\n\n",
    "reports": [
        {
            "link": "https://community.netwitness.com/t5/netwitness-community-blog/the-shadows-of-ghosts-inside-the-response-of-a-unique-carbanak/ba-p/518668/",
            "content": "Several intrusions associated with the CARBANAK actors have been reported within the lastyear, describing compromises of organizations within bankingm,financialm,hospitality..and restaurant, verticals. The intelligence surroundingDrecent CARBANAK incidents indicate that phishing attacks @ have been the group'sprimary method of initial compromise. TheCARBANAK actions illustrated in this post and associated paper were observed withother RSA clients as recently as November 2017, with the methods and intelligencesupplied by these publications having been used successfully to detect and trackattacker activities. This intrusion presented substantial challenges due to:The attackers' toolset was a mix of custom tools, freely available code, and open sourcesoftware utilities. This intrusion was successfully discovered, investigated, contained, eradicated, and remediated only due to the following reasons: While a first look at the tools used in this engagement may appear simplistic, upon reviewDof the entire intrusion, it becomes quickly apparent that each of them was purpose-chosenwith an overall operationalized capability in mind. While the attackers used more than 30 unique samples of malware and tools, they alsodemonstrated a normalization across Windows and Linux with respect to their toolset.",
            "domain": "community.netwitness.com",
            "tokenized": [
                {
                    "sent": "Several intrusions associated with the CARBANAK actors have been reported within the lastyear, describing compromises of organizations within bankingm,financialm,hospitality..and restaurant, verticals.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The intelligence surroundingDrecent CARBANAK incidents indicate that phishing attacks @ have been the group'sprimary method of initial compromise.",
                    "is_evidence": 0
                },
                {
                    "sent": "TheCARBANAK actions illustrated in this post and associated paper were observed withother RSA clients as recently as November 2017, with the methods and intelligencesupplied by these publications having been used successfully to detect and trackattacker activities.",
                    "is_evidence": 0
                },
                {
                    "sent": "This intrusion presented substantial challenges due to:The attackers' toolset was a mix of custom tools, freely available code, and open sourcesoftware utilities.",
                    "is_evidence": 0
                },
                {
                    "sent": "This intrusion was successfully discovered, investigated, contained, eradicated, and remediated only due to the following reasons: While a first look at the tools used in this engagement may appear simplistic, upon reviewDof the entire intrusion, it becomes quickly apparent that each of them was purpose-chosenwith an overall operationalized capability in mind.",
                    "is_evidence": 0
                },
                {
                    "sent": "While the attackers used more than 30 unique samples of malware and tools, they alsodemonstrated a normalization across Windows and Linux with respect to their toolset.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://krebsonsecurity.com/wp-content/uploads/2015/02/Carbanak_APT_eng.pdf/",
            "content": "An analysis of the campaign has revealed that the initial infections were achieved using spear phishing emails that appeared to be legitimate banking communications, with Microsoft Word 97 – 2003 (.doc) and Control Panel Applet (.CPL). As such, they represent a new and disturbing trend in the cybercrime market of increasing attack sophistication. Despite increased awareness of cybercrime within the financial services sector, it appears that spear phishing attacks and old exploits (for which patches have been disseminated) remain effective against larger companies. From late 2013 onwards, several banks and financial institutions have been attacked by an unknown group of cybercriminals. The spear phishing email messages appeared legitimate and in some cases were sent from compromised coworkers´ accounts. We believe that the Carbanak campaign is a clear indicator of a new era in cybercrime in which criminals use APT techniques directly against the financial industry instead of through its customers.",
            "domain": "krebsonsecurity.com",
            "tokenized": [
                {
                    "sent": "An analysis of the campaign has revealed that the initial infections were achieved using spear phishing emails that appeared to be legitimate banking communications, with Microsoft Word 97 – 2003 (.doc) and Control Panel Applet (.CPL)",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "As such, they represent a new and disturbing trend in the cybercrime market of increasing attack sophistication.",
                    "is_evidence": 0
                },
                {
                    "sent": "Despite increased awareness of cybercrime within the financial services sector, it appears that spear phishing attacks and old exploits (for which patches have been disseminated) remain effective against larger companies.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "From late 2013 onwards, several banks and financial institutions have been attacked by an unknown group of cybercriminals.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The spear phishing email messages appeared legitimate and in some cases were sent from compromised coworkers´ accounts.",
                    "is_evidence": 0
                },
                {
                    "sent": "We believe that the Carbanak campaign is a clear indicator of a new era in cybercrime in which criminals use APT techniques directly against the financial industry instead of through its customers.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.europol.europa.eu/media-press/newsroom/news/mastermind-behind-eur-1-billion-cyber-bank-robbery-arrested-in-spain/",
            "content": "Europol’s European Cybercrime Centre (EC3) facilitated the exchange of information, hosted operational meetings, provided digital forensic and malware analysis support and deployed experts on-the-spot in Spain during the action day. From then onwards, the crime syndicate focused their efforts into developing an even more sophisticated wave of attacks by using tailor-made malware based on the Cobalt Strike penetration testing software. It clearly goes beyond raising awareness on cybersecurity and demonstrates the value of our partnership with the cybercrime specialists at Europol. Since 2013, the cybercrime gang have attempted to attack banks, e-payment systems and financial institutions using pieces of malware they designed, known as Carbanak and Cobalt. The criminals would send out to bank employees spear phishing emails with a malicious attachment impersonating legitimate companies. The organised crime group started its high-tech criminal activities in late 2013 by launching the Anunak malware campaign that targeted financial transfers and ATM networks of financial institutions around the world.",
            "domain": "www.europol.europa.eu",
            "tokenized": [
                {
                    "sent": "Europol’s European Cybercrime Centre (EC3) facilitated the exchange of information, hosted operational meetings, provided digital forensic and malware analysis support and deployed experts on-the-spot in Spain during the action day.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "From then onwards, the crime syndicate focused their efforts into developing an even more sophisticated wave of attacks by using tailor-made malware based on the Cobalt Strike penetration testing software.",
                    "is_evidence": 0
                },
                {
                    "sent": "It clearly goes beyond raising awareness on cybersecurity and demonstrates the value of our partnership with the cybercrime specialists at Europol.",
                    "is_evidence": 0
                },
                {
                    "sent": "Since 2013, the cybercrime gang have attempted to attack banks, e-payment systems and financial institutions using pieces of malware they designed, known as Carbanak and Cobalt.",
                    "is_evidence": 0
                },
                {
                    "sent": "The criminals would send out to bank employees spear phishing emails with a malicious attachment impersonating legitimate companies.",
                    "is_evidence": 0
                },
                {
                    "sent": "The organised crime group started its high-tech criminal activities in late 2013 by launching the Anunak malware campaign that targeted financial transfers and ATM networks of financial institutions around the world.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.threatminer.org/_reports/2017/the-shadows-of-ghosts-carbanak-report_RSA.pdf/",
            "content": "By reviewing additional context around what we know of this attacker communication, this query can be narrowed significantly. In researching this white paper, the majority of intelligence and incident reports reviewed described phishing and malicious document-related tactics being utilized by CARBANAK actors as a method of initial compromise. Included are the details regarding the observed intrusion vector, entrenchment techniques, actions-on-objective, lateral movement tools and methods, unique malicious files, and behavioral indicators utilized in the identification, tracking and response of this actor group. The CARBANAK attackers conducted actions through a variety of networkcommunication methods. The incident discussed in this report illustrates the dangers present within this approach once attackers begin utilizing these systems against organizations. The intelligence surrounding recent CARBANAK incidents indicate that phishing attacks have been the group’s primary method of initial compromise.",
            "domain": "www.threatminer.org",
            "tokenized": [
                {
                    "sent": "By reviewing additional context around what we know of this attacker communication, this query can be narrowed significantly.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In researching this white paper, the majority of intelligence and incident reports reviewed described phishing and malicious document-related tactics being utilized by CARBANAK actors as a method of initial compromise.",
                    "is_evidence": 0
                },
                {
                    "sent": "Included are the details regarding the observed intrusion vector, entrenchment techniques, actions-on-objective, lateral movement tools and methods, unique malicious files, and behavioral indicators utilized in the identification, tracking and response of this actor group.",
                    "is_evidence": 0
                },
                {
                    "sent": "The CARBANAK attackers conducted actions through a variety of networkcommunication methods.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The incident discussed in this report illustrates the dangers present within this approach once attackers begin utilizing these systems against organizations.",
                    "is_evidence": 0
                },
                {
                    "sent": "The intelligence surrounding recent CARBANAK incidents indicate that phishing attacks have been the group’s primary method of initial compromise.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}