{
    "event_id": "198",
    "claim": "Inception Framework: Alive and Well, and Hiding Behind Proxies, The group has targeted multiple industries and governmental entities primarily in Russia, but has also been active in the United States and throughout Europe, Asia, Africa, and the Middle East.",
    "original_label": "true",
    "label": "true",
    "explain": "The cyber espionage group known as the Inception Framework has significantly developed its operations over the past three years, rolling out stealthy new tools and cleverly leveraging the cloud and the Internet of Things (IoT) in order to make its activities harder to detect. Since 2014, Symantec has found evidence of a steady stream of attacks from the Inception Framework targeted at organizations on several continents. As time has gone by, the group has become ever more secretive, hiding behind an increasingly complex framework of proxies and cloud services.The Inception Framework has been active since at least May 2014 and its activities were first exposed by Blue Coat (now part of Symantec) in December 2014. Right from the start, the group stood out because of its use of an advanced, highly automated framework to support its targeted attacks. This level of sophistication is rarely seen, even in the targeted attacks sphere. The nature of Inception’s targets, from 2014 right through to today, along with the capabilities of its tools, indicate that espionage is the primary motive of this groups In 2014, Inception was compromising targeted organizations using spear-phishing emails, which masqueraded as legitimate emails concerning international policy, upcoming conferences, and specific sectoral interests of the targeted organization. More than half of the group’s earlier targets were in the Energy or Defense sectors, but it also targeted organizations in the Consultancy/Security, Aerospace, Research, and Media sectors, in addition to embassies. Its activities ranged across the globe, with targets located in South Africa, Kenya, the United Kingdom, Malaysia, Suriname, along with several other European and Middle Eastern countries. Word documents attached to Inception’s spear-phishing emails leveraged two Microsoft Office vulnerabilities (CVE-2014-1761 and CVE-2012-0158) to install malware on the recipient’s computer. The malware had a multi-staged structure that began with a malicious RTF document and ended with an in-memory DLL payload that communicated, via the WebDAV protocol, with a command and control (C&C) address from a legitimate cloud service provider (CloudMe.com). The name “Inception” comes from the group’s many levels of obfuscation and indirection it employed in delivering this payload. Further layers of obfuscation emerged when Blue Coat was able to determine that the attackers were communicating with CloudMe.com through a hacked network of compromised routers, the majority of which were located in South Korea.Following its exposure in late 2014, Inception fell quiet. However, this turned out to be only a brief hiatus and, by April 2015, there had been a resurgence in activity. Attacks have continued since then, right through to 2017.In the intervening years, the Inception Framework has evolved, adding additional layers of obfuscation in a bid to avoid detection. The group is using new types of lure documents in its spear-phishing campaigns and its malware has expanded to use new types of plugins. Inception has also increased its use of the cloud, and diversified the range of cloud providers it uses for C&C purposes.The locations of Inception’s targets have shifted since 2014, but the group continues to have a global reach. Russia accounted for the largest number of attacks between 2015 and 2017, followed by Ukraine, Moldova, Belgium, Iran, and France.Since 2014, the Inception Framework has steadily changed its tools and techniques. In its early attacks, the group’s malware payload (with the exception of plugins) was fully contained within an exploit document emailed to the victim. In more recent activity, these spear-phishing attacks are now a two-stage process. The group will first email the target a malicious “Reconnaissance document” which, if opened, will fingerprint the target computer, gathering information on what software it is running and whether that software is up to date. Several days later, Inception will send a second spear-phishing email to the target, with another malicious document attached. This document is designed to retrieve a remote RTF file, which contains the exploit, and open it on the target’s computer. Shortly after this RTF document is opened, the remaining stages of the Inception malware are found executing on the system. The loader DLL is responsible for decrypting and injecting the core payload DLL into memory, from an encrypted file present on disk. The core payload DLL's main function is to gather system information, execute other malware in the form of plugins, and update itself. It accesses C&C via WebDAV hosted on legitimate cloud storage providers. The use of an initial reconnaissance document allows Inception to profile the target’s computer and potentially customize any subsequent malicious document to exploit known vulnerabilities in unpatched software on the computer. By breaking its attacks up into distinct stages, Inception also makes them harder to detect. For investigators to trace an attack, each stage will have be uncovered and referenced to the other stages.Inception’s malware is modular and the attackers will load plugins based on requirements for each attack. The group has used a range of plugins in recent attacks, some of which are improved versions of plugins used in 2014, while others were previously unseen. File hunting plugin: The most frequently used plugin, similar to one used in 2014. Often used to collect Office files from temporary internet history. Detailed survey plugin: Used to gather domain membership, processes/loaded modules, hardware enumeration, installed products, logical and mapped drive information. Evolution of earlier plugin used in 2014. Browser plugin: Used to steal browser history, stored passwords and sessions. Works with Internet Explorer, Chrome, Opera, Firefox, Torch, and Yandex. File listing plugin: Works on local or remote drives and can map additional paths when given credentials.Since 2014, Inception has widened its use of cloud service providers for C&C purposes. Whereas previously it relied on one service provider (CloudMe.com), more recently it has employed a least five cloud service providers Leveraging the cloud for C&C has a number of advantages for groups like Inception. Any C&C communications will involve encrypted traffic to a known website, meaning it is less likely to raise flags on targeted networks. Legitimate cloud services are not likely to be blacklisted. Varying the cloud service provider used adds a further degree of stealth. Once it became known Inception was using a single provider, any traffic to that provider may have attracted additional scrutiny. Symantec has notified all cloud providers affected. Where possible Symantec has provided details on the C&C accounts used by Inception to the affected cloud providers. The accounts in questions have been deleted or disabled.Inception is continuing to use chains of infected routers to act as proxies and mask communications between the attackers and the cloud service providers they use. Certain router manufacturers have UPnP listening on WAN as a default configuration. Akamai research has found that there are 765,000 devices vulnerable to this attack. These routers are hijacked by Inception and configured to forward traffic from one port to another host on the internet. Abuse of this service requires no custom malware to be injected on the routers and can be used at scale very easily. Inception strings chains of these routers together to create multiple proxies to hide behind.Every connection builds different chains of infected routers and once the connection is complete, it cleans up after itself. In several cases, Symantec has been able to follow the entire chain of compromised routers and found it led to a virtual private server (VPS), meaning the attackers have employed an additional layer of security by routing communications through rented hosting servers.Inception has an ongoing interest in mobile devices and has previously developed malware to infect Android (Android.Lastacloud), iOS (IOS.Lastaccoud) and BlackBerry devices (BBOS.Lastacloud). Mobile malware continues to be deployed and the group has made some modifications to its Android malware. The malware is spread via SMS messages and emails containing malicious links. Once installed, it uses user profile pages on online forums as dead drops for its C&C.Even prior to its discovery in 2014, Inception went to great lengths both to avoid detection and conceal its location. Exposure hasn’t deterred the group. Instead, it has redoubled its efforts, adding more layers of obfuscation to an already complex attack framework. Its persistence, stealth, and global reach mean the group continues to pose an ongoing risk to organizations, particularly in its areas of interest, which include defense, aerospace, energy, governments, telecoms, media, and finance. Aside from a suite of advanced modular malware, the group is notable for its ability to make use of new platforms such as the cloud, IoT, and mobile to facilitate its attacks. An “early adopter”, Inception’s tactics may point the way towards how other espionage groups may modify their methods in years to come.",
    "reports": [
        {
            "link": "https://unit42.paloaltonetworks.com/unit42-inception-attackers-target-europe-year-old-office-vulnerability/",
            "content": "During the infection process, the malware communicates with three different C&C servers.Since mid-May, the group has been conducting spear-phishing campaigns distributed the LNK file bundled in an archive as malicious attachments.The APT group carried out similar attacks in March using COVID19 themed phishing emails.The group was discovered recently, but attackers have been operating for several years and use common tools to complicate the attribution.The malware achieves persistence via a scheduled task while masquerading as a legitimate binary in the Windows startup folder.They mainly use mobile malware and the Gh0st and PlugX trojans.",
            "domain": "unit42.paloaltonetworks.com",
            "tokenized": [
                {
                    "sent": "Earlier, we mentioned that previous attacks were apparently delivered over two spear phishing emails, with the first only being used for reconnaissance.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In the last writeup by Symantec they describe a two-stage spear phishing process used by the Inception attackers, whereby the attackers first send a reconnaissance spear phish, and follow this up with a second spear phish containing a remote template, which if loaded delivers a first stage payload.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Inception attackers have been active since at least 2014 and have been documented previously by both Blue Coat and Symantec; historical attacks used custom malware for a variety of platforms, and targeting a range of industries, primarily in Russia, but also around the world.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Inception attacks continue to mostly stay under the radar, which in part is down to the effort put in by the attackers to make their attacks harder to analyze.",
                    "is_evidence": 0
                },
                {
                    "sent": "This blog describes attacks against European targets observed in October 2018, using CVE-2017-11882 and a new PowerShell backdoor we’re calling POWERSHOWER due to the attention to detail in terms of cleaning up after itself, along with the malware being written in PowerShell.",
                    "is_evidence": 0
                },
                {
                    "sent": "Using a remote template in this way has been a consistent feature of the Inception attackers’ attacks for the past 4 years and has three main benefits to the attacker: The initial document does not contain any explicitly malicious object, it simply references an external object, meaning it should bypass static analysis techniques, an example of how this appears in the document is shown in Figure 2.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.kaspersky.com/about/press-releases/2019_cloud-atlas-apt-upgrades-its-arsenal-with-polymorphic-malware",
            "content": "Cloud Atlas is a threat actor that has a long history of cyber-espionage operations targeting industries, government agencies and other entities.In the case of a successful exploitation, PowerShower – the attached malware, used for initial reconnaissance and to download additional malicious modules – would then be executed to allow cyberattackers to proceed with an operation.This doesn’t mean that actors are becoming harder to catch, but that security skills and the defenders toolkit needs to evolve along with the toolkit and skills of the malicious actors they are tracking,” – said Felix Aime, security researcher in the Kaspersky Global Research and Analysis Team.This first emerged with ProjectSauron, which would create a unique set of IoC for each of its victims and continued with the trend of using open source tools in espionage operations instead of unique ones.This practice allows us to respond to ongoing international cyber-espionage operations quite swiftly, preventing any further damage they could cause.“It has become good practice in the security community to share the Indicators of Compromise (IoC) of malicious operations we find through research.",
            "domain": "www.enigmasoftware.com",
            "tokenized": [
                {
                    "sent": "Cloud Atlas is a threat actor that has a long history of cyber-espionage operations targeting industries, government agencies and other entities.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In the case of a successful exploitation, PowerShower – the attached malware, used for initial reconnaissance and to download additional malicious modules – would then be executed to allow cyberattackers to proceed with an operation.",
                    "is_evidence": 0
                },
                {
                    "sent": "This doesn’t mean that actors are becoming harder to catch, but that security skills and the defenders toolkit needs to evolve along with the toolkit and skills of the malicious actors they are tracking,” – said Felix Aime, security researcher in the Kaspersky Global Research and Analysis Team.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "This first emerged with ProjectSauron, which would create a unique set of IoC for each of its victims and continued with the trend of using open source tools in espionage operations instead of unique ones.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "This practice allows us to respond to ongoing international cyber-espionage operations quite swiftly, preventing any further damage they could cause.",
                    "is_evidence": 0
                },
                {
                    "sent": "“It has become good practice in the security community to share the Indicators of Compromise (IoC) of malicious operations we find through research.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.trendmicro.com/vinfo/fr/security/news/cybercrime-and-digital-threats/cloud-atlas-group-updates-infection-chain-with-polymorphic-malware-to-evade-detection",
            "content": "As in its previous iteration, the routine used by Cloud Atlas begins with phishing emails to high-value targets.As reported by researchers at Kaspersky, the campaign can be traced to the advanced persistent threat (APT) group Cloud Atlas (aka Inception), whose activities were first reported in 2014 and have recently been identified in relation to attacks on various organizations in Russia, Central Asia, Europe, and Portugal.Polymorphism and PowerShell abuse for malware propagation and infection are not new.Threat actors have been abusing new scripting languages, for example, to make it difficult for enterprise IT teams to seek, monitor, and defend against these threats.Trend Micro researchers have been tracking such evasion and infection techniques.cloud-atlas-powershower-vbshower-lazagneA malware campaign that uses a polymorphic HTML application (HTA) and a polymorphic backdoor to evade detection has recently been observed by security researchers.",
            "domain": "www.trendmicro.com",
            "tokenized": [
                {
                    "sent": "As in its previous iteration, the routine used by Cloud Atlas begins with phishing emails to high-value targets.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "As reported by researchers at Kaspersky, the campaign can be traced to the advanced persistent threat (APT) group Cloud Atlas (aka Inception), whose activities were first reported in 2014 and have recently been identified in relation to attacks on various organizations in Russia, Central Asia, Europe, and Portugal.",
                    "is_evidence": 0
                },
                {
                    "sent": "Polymorphism and PowerShell abuse for malware propagation and infection are not new.",
                    "is_evidence": 0
                },
                {
                    "sent": "Threat actors have been abusing new scripting languages, for example, to make it difficult for enterprise IT teams to seek, monitor, and defend against these threats.",
                    "is_evidence": 0
                },
                {
                    "sent": "Trend Micro researchers have been tracking such evasion and infection techniques.",
                    "is_evidence": 0
                },
                {
                    "sent": "cloud-atlas-powershower-vbshower-lazagneA malware campaign that uses a polymorphic HTML application (HTA) and a polymorphic backdoor to evade detection has recently been observed by security researchers.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://securelist.com/recent-cloud-atlas-activity/92016/",
            "content": "Also known as Inception, Cloud Atlas is an actor that has a long history of cyber-espionage operations targeting industries and governmental entities.During recent months, we have seen a new infection chain, involving a polymorphic HTA, a new and polymorphic VBS implant aimed at executing PowerShower, and the Cloud Atlas second stage modular backdoor that we disclosed five years ago in our first blogpost about them and which remains unchanged.From the beginning of 2019 until July, we have been able to identify different spear-phishing campaigns related to this threat actor mostly focused on Russia, Central Asia and regions of Ukraine with ongoing military conflicts.The Windows branch of the Cloud Atlas intrusion set still uses spear-phishing emails to target high profile victims.The actor’s massive spear-phishing campaigns continue to use its simple but effective methods in order to compromise its targets.This malware has been used since October 2018 by Cloud Atlas as a validator and now as a second stage.",
            "domain": "securelist.com",
            "tokenized": [
                {
                    "sent": "Also known as Inception, Cloud Atlas is an actor that has a long history of cyber-espionage operations targeting industries and governmental entities.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "During recent months, we have seen a new infection chain, involving a polymorphic HTA, a new and polymorphic VBS implant aimed at executing PowerShower, and the Cloud Atlas second stage modular backdoor that we disclosed five years ago in our first blogpost about them and which remains unchanged.",
                    "is_evidence": 0
                },
                {
                    "sent": "From the beginning of 2019 until July, we have been able to identify different spear-phishing campaigns related to this threat actor mostly focused on Russia, Central Asia and regions of Ukraine with ongoing military conflicts.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Windows branch of the Cloud Atlas intrusion set still uses spear-phishing emails to target high profile victims.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The actor’s massive spear-phishing campaigns continue to use its simple but effective methods in order to compromise its targets.",
                    "is_evidence": 0
                },
                {
                    "sent": "This malware has been used since October 2018 by Cloud Atlas as a validator and now as a second stage.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}