claim：At the beginning of October 2020 we found a copy of a malicious document potentially to be attributed to an APT group known with the name of APT34 / OilRig.
explain：At the beginning of October 2020 we found copy of a malicious document potentially to be attributed to an APT group known with the name of APT34 / OilRig. The attribution, based on several elements found within the malicious document, was firstly reported by a security researcher through a social network. The above-mentioned document, which also had a name potentially compatible with the interests and objectives pursued by the threat actor in question, can be uniquely identified by the following indicators: According the extracted evidences, the author “signed” this malicious document leaving his/her username within the document metadata. This nickname was already widely known within the Cyber Threat Intelligence field because attributed to a member of the already mentioned threat group. Indeed this nickname is Iamfarhadzadeh, linked to Mohammad Farhadzadeh, believed to be a member of the hacking unit identified by the community as APT34 / OilRig. Considering this threat and proceeding further with our analysis we extracted several evidences that highlighted a connection with a common cyber-crime adversary. In particular the execution of the hidden macro permitted to download a copy of a malicious executable identified as a variant of AgentTesla that, to the best of our information, has no ties to the already reported threat actor. These evidences headed our research team to dig further in order to understand who was behind this campaign and why that nickname was left within the meta-content. Our first hypothesis was a deliberate attempt to deceive security researchers pushing them to attribute the malicious campaign to a cyber-espionage operation by releasing a malicious document linked to a socio-politic event.Our investigation covered a quite extended timeframe and permitted to continuously monitor the attackers activities and, with a wider point of view, what is lately happening within the cyber-crime panorama and how these cyber criminals act. To better clarify, we tracked and observed the use of tools to quickly create new phishing campaigns aimed to steal data and information that could be sold on the dark market or used to directly cause an economic loss to their victims. In details, the analyzed document, contains a hidden macro that through the subroutine auto_run runs automatically the obfuscated VBA code downloading a malicious payload from the following URL .to be later implanted within the victim’s temp folder. Following same evidences about the encoded URL as observed during the analysis the extracted payload matched exactly with AgentTesla payloads. This means that once executed the malware is able to record keystrokes, to collect user clipboard data, to get screenshots from the victim machine and to send all to the attacker command and control. The analysis gave us also the opportunity to establish an attacker “fingerprint”, to deeply track it, to study all its actions and to learn about tools and methods it used to start and deploy a new malware campaign and operations. We identified infected victims but also all information related the attacker’s host. We got evidences that the actor was likely a member of a cyber-crime team with a low knowledge about packers, evasion techniques and malware in general. Furthermore, we observed that he repeatedly executed his own malicious payloads over his machines from which the campaigns are operated. Among all data about the threat actor, we collected several IP addresses used by attacker as bridges in order to pack malicious documents and spread phishing waves. All of these servers are reachable via RDP services. A quite funny part of our investigation involved also evidences about Skype and ICQ accounts of the crew that are currently used for sharing and exchanging compromised assets and emails with other cyber-criminals. It is interesting to note that, during the preparation phases of the campaigns, the threat actor seemed to act by choosing potential targets on the basis of very specific address lists, probably cataloged on the basis of the sector of interest. For example, while preparing campaigns aimed at compromising entities operating in Oil&Gas sector, the collected evidences suggest a web browsing activity performed by the adversary towards websites dedicated to news about industrial groups operating in this sector. One of these websites, which cybercriminals rely on to acquire information about the Oil&Gas industry, is ognnews.com, showed within the screenshot reported here below:In other cases members of the crew search directly in darkweb websites dedicated to the provision of phishing kits and lists of email addresses to be included among potential targets. We tracked at least 8 different underground forums consulted by the group for purchasing compromised assets and get tools to obfuscate malware. In particular, threat actor seems to prefer buy and use a malware core which can be referred to as OriginLogger. OriginLogger in conjunction with the use of an online PE crypter, called Cassandra, generates malicious payloads internally matching AgentTesla's signatures. Furthermore, in order to have a clearer view about the spread of the threat, an ad-hoc signature has been internally created for the malware family in question, starting from the sample identified by the following hash: This signature made it possible to obtain a good level of detection with a low false positive rate. As the image below reports, starting from the second week of October 2020, the group began to heavily spread “OriginLogger plus Cassandra” payloads, internally reaching a number of unique detections exceeding the 500 hits from midOctober until dropping around only 10 to December 1, 2020 (this is probably as a consequence of the increase in the global detection rates of the variants in question).Threat actor targeted many entities and organizations across different industrialized countries, including Italy. The operations involved as well many individual users. We counted around at least 300 Italian email addresses as targets of phishing campaigns operated by this adversary from mid-October 2020. Among the most impacted sectors we observed industry, manufacturing, transports, energy and oil&gas. According to the collected evidences below are reported details about to the countries where victims of these phishing campaigns are located: Our internal Threat Intelligence Research Team links the threat actor in question with a criminally-motivated organization operating from Nigeria. The techniques, tactics and procedures observed overlaps with a threat actor described in a research paper by NTT, dated October 2020, available at URL https://hello.global.ntt/-/media/ntt/global/insights/gtic-monthly-threat-report/gticmonthly-threat-report-october-2020.pdf In this paper, NTT researchers described malicious campaigns and BEC operations perpetrated by an actor operating from Nigeria, they named OZIE Team. As many of the characteristics of the adversary we tracked overlap with what is reported in the aforementioned document, we assert, with a medium degree of confidence, that the threat actor in question is part of or is potentially close to the OZIE gang.Telsy internal research team has been supported by the collaboration of several independent security researchers during the acquisition and analysis phases of parts of the artifacts and evidences collected. Among these we thank Vito Alfano (@vxsh4d0w) for his precious support and collaboration.
[
    {
	link：https://www.fireeye.com/blog/threat-research/2019/07/hard-pass-declining-apt34-invite-to-join-their-professional-network.html
        "report_id": "report_0",
        "sentences": [
            "Figure 5 shows our testing of RGDoor’s upload command, specifically “upload$c:⧵windows⧵temp⧵test.txt” that uploads a file from our local system to the webserver.",
            "Our data suggests that actors have deployed the RGDoor backdoor on webservers belonging to eight Middle Eastern government organizations, as well as one financial and one educational institution.",
            "The RGDoor provides backdoor access to the compromised server, which we speculate the actors loaded in order to regain access to the server in the event the TwoFace webshell was removed.",
            "The use of RGDoor suggests that this group has contingency plans to regain access to a compromised network in the event their webshells are discovered and remediated.",
            "We believe the actors deploy RGDoor as a secondary backdoor to regain access to a compromised webserver in the event a victim organization detects and removes the TwoFace shell.",
            "While investigating files uploaded to a TwoFace (https://researchcenter.paloaltonetworks.com/tag/twoface/) webshell, Unit 42 discovered actors installing an Internet Information Services (IIS) backdoor that we call RGDoor."
        ]
    },
    {
	link：https://securityintelligence.com/posts/new-destructive-wiper-zerocleare-targets-energy-sector-in-the-middle-east/
        "report_id": "report_1",
        "sentences": [
            "For initial access, the IP address 193.111.152[.]13, which was associated with ITG13 in recent Oilrig/APT34 leaks, and as also reported by Palo Alto, was used to scan target networks and access accounts as early as the Fall of 2018.6 A different Iranian threat actor likely accessed accounts from that address in mid-2019 preceding disk wiping operations.",
            "Nation-state groups and cyber criminals frequently use legitimate tools in ways that a vendor did not intend to accomplish malicious or destructive activity.",
            "One of the IP addresses used to access compromised network accounts in mid-2019 was 194.187.249[.]103, which is adjacent to another IP address, 194.187.249[.]102.",
            "These types of attackers may be tasked with conducting anything from industrial espionage, to cyber kinetic attacks9 designed to disrupt the critical infrastructure of rival nations.",
            "We decrypted the contents of $UpdateTempContents using the identified key and found that these files all matched samples we encountered previously in this attack, namely.",
            "X-Force IRIS assesses that the ITG13 threat group, also known as APT34/OilRig, and at least one other group, likely based out of Iran, collaborated on the destructive portion of the attack."
        ]
    },
    {
	link：https://www.mandiant.com/resources/blog/targeted-attack-in-middle-east-by-apt34
        "report_id": "report_2",
        "sentences": [
            "APT34 aligns with elements of activity reported as OilRig and Greenbug, by various security researchers.",
            "APT34 is an Iran-nexus cluster of cyber espionage activity that has been active since at least 2014.",
            "Additionally, with the assistance of our FireEye Labs Advanced Reverse Engineering (FLARE), Intelligence, and Advanced Practices teams, we identified three new malware families and a reappearance of PICKPOCKET, malware exclusively observed in use by APT34.",
            "In late June 2019, FireEye identified a phishing campaign conducted by APT34, an Iranian-nexus threat actor.",
            "The Managed Defense SOC analyzed the alert and identified a malicious file named System.doc (MD5: b338baa673ac007d7af54075ea69660b), located in C:\\Users\\ \\.templates.",
            "The activity described in this blog post presented a well-known Iranian threat actor utilizing their tried-and-true techniques to breach targeted organizations."
        ]
    },
    {
	link：https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
        "report_id": "report_3",
        "sentences": [
            "APT34 sent a malicious .rtf file (MD5: a0e6933f4e0497269620f44a083b2ed4) as an attachment in a malicious spear phishing email sent to the victim organization.",
            "APT34 uses a mix of public and non-public tools, often conducting spear phishing operations using compromised accounts, sometimes coupled with social engineering tactics.",
            "During the same month, FireEye observed APT34 target a separate Middle East organization using a malicious .rtf file (MD5: 63D66D99E46FB93676A4F475A65566D8) that exploited CVE-2017-0199.",
            "In July 2017, we observed APT34 targeting a Middle East organization using a PowerShell-based backdoor that we call POWRUNER and a downloader with domain generation algorithm functionality that we call BONDUPDATER, based on strings within the malware.",
            "We assess this activity was carried out by a suspected Iranian cyber espionage threat group, whom we refer to as APT34, using a custom PowerShell backdoor to achieve its objectives.",
            "We believe APT34 is involved in a long-term cyber espionage operation largely focused on reconnaissance efforts to benefit Iranian nation-state interests and has been operational since at least 2014."
        ]
    }
]