{"url": "http://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "text": "Prince Harry loses court battle over UK security protection, plans to appeal Prince Harry lost his battle for publicly funded protection in Britain.On Wednesday, a London judge ruled that the U.K. government did not act irrationally in deciding to strip the Duke of Sussex of security privileges after he stepped back as a senior royal in 2020 and moved to the U.S. A spokesperson for the 39-year-old said that he plans to appeal the ruling. The decision was made by the Royal and VIP Executive Committee (RAVEC). The group is made up of members of the royal family staff, Read more\n\nDrew Barrymore’s daughter used Playboy cover against her in argument Drew Barrymore revealed that her daughter Olive doesn't shy away from bringing up her mother's past during arguments over what items of clothing are appropriate for the 11-year-old to wear.During Tuesday's episode of \"The Drew Barrymore Show,\" the 49-year-old actress and Christina Aguilera were discussing raising their children after their own \"very liberal\" and \"free-spirited\" early years.\"My daughter wants to wear a crop top,\" said Barrymore, who shares Olive and another daughter, Frankie, wit Read more\n\nBradley Cooper roasts himself as director with 'crazy demands' Bradley Cooper is admitting he’s not an easygoing director. The \"Maestro\" star threw shade at himself last Friday during a pre-Oscars panel in Los Angeles, joking that the \"biggest challenge\" while making the Academy Award-nominated movie \"by far was the f---ing director,\" referring to himself.\"He had these crazy demands like shooting in black and white, 35-millimeter stock and a 1:3:3 aspect ratio, and half the movie had black and white, and shooting it live and wanting to be on loca Read more\n\nBen Affleck admits Jennifer Lopez romance forced him to make major compromises: 'A reluctant participant' Jennifer Lopez and Ben Affleck’s relationship is back under a microscope in a new documentary, \"The Greatest Love Story Never Told,\" and it appears Affleck is still reluctantly dealing with the public scrutiny that followed the couple when they first got together in the early 2000s.The documentary follows Lopez as she works on not only her new album, \"This is Me…Now,\" but also the high-concept music film \"This is Me…Now: A Love Story.\"In the early minutes of the film, Lopez s Read more\n\nSusan Lucci, 77, eats same 3 foods daily after near-miss 'widowmaker' heart attack There are three foods Susan Lucci eats every day.The \"All My Children\" alum told Fox News Digital there are certain ingredients she lives on and always has in stock in her fridge.\"Salmon, blueberries and kale,\" the actress said of her clean diet. \"My doctor told me, ‘You keep doing what you’re doing because something good will come from that.'\"SUSAN LUCCI, 76, HAS NO PLANS TO SLOW DOWN, CALLS RETIREMENT A 'DIRTY WORD'The 77-year-old, a longtime ambassador of the American Heart Associ Read more\n\nPhotographer who claims Taylor Swift’s dad assaulted him speaks out: 'I was not aggressive' An Australian photographer who claims Taylor Swift’s father Scott assaulted him early Tuesday denies he did anything to provoke the 71-year-old. \"There was no situation where we were aggressive,\" Ben McDonald, 52, told Fox News Digital of the alleged altercation. \"You know, I was not aggressive. They just didn't call for it, you know what I mean?\"He added, \"I think that the security detail were annoyed by the fact that we discovered where they were getting her off\" their yacht. E Read more\n\n'Rust' armorer becomes distressed when shown autopsy photos of Halyna Hutchins during shooting trial Hannah Gutierrez Reed became visibly distressed when autopsy photos of cinematographer Halyna Hutchins were shown in court Tuesday.The prosecution showed photos of the gunshot wounds Hutchins' suffered in the fatal Oct. 21, 2021 \"Rust\" shooting. The jury was shown a photo of Hutchins' uncleaned entry wound — which is part of the medical examiner's policy — and another photo of the uncleaned exit wound.Gutierrez Reed, who worked as the movie's armorer and is being tried on charge Read more\n\nRachel Bilson shares 'the most offensive part' of getting burglarized by infamous crime ring Rachel Bilson is opening up about her past traumas.During a recent episode of her podcast, \"Broad Ideas with Rachel Bilson and Olivia Allen,\" the \"Hart of Dixie\" star and her guest, Audrina Patridge, bonded over their shared experiences as targets of The Bling Ring, a group of burglars who targeted celebrities in 2009.The Bling Ring broke into Bilson's home when she was out of town, five times between April and May 2009, stealing hundreds of thousands of dollars worth of belongings, including he Read more\n\nAnn-Margret, 82, still rides her Harley-Davidson: ‘I love speed’ At age 82, Ann-Margret is living life in the fast lane.The \"Bye Bye Birdie\" and \"Viva Las Vegas\" actress was recently at the Women’s Image Network’s 25th Women’s Image Awards in Beverly Hills, where she revealed one thing that keeps her young — a Harley-Davidson.\"It’s lavender, and it’s got white daisies all over it,\" the star gushed to People magazine. \"There [are] flowers on the back fender and the front fender. … I love speed. Not the drug.\"ANN-MARGR Read more\n\nJury convicts killers of Run-DMC star Jam Master Jay Two men were convicted of murder Tuesday in the death of Run-DMC star Jam Master Jay, a brazen 2002 shooting in the rap legend’s studio.An anonymous Brooklyn federal jury delivered the verdict in the trial of Karl Jordan Jr. and Ronald Washington.TRIAL BEGINS FOR MURDER OF JAM MASTER JAY, MEMBER OF INFLUENTIAL HIP HOP GROUP RUN-DMCJam Master Jay, born Jason Mizell, worked the turntables in Run-DMC as it helped hip-hop break into the pop music mainstream in the 1980s with such hits as \"It&r Read more\n\nArnold Schwarzenegger, 76, shows off workout routine with physical therapist girlfriend, 49 Arnold Schwarzenegger showed off his workout routine recently with his physical therapist girlfriend Heather Milligan as they discussed avoiding joint injuries in a video for his Pump Club. \"Heather Milligan is not only my girlfriend, she’s also a great, if not the best, physical therapist in the world,\" the 76-year-old action star said as Milligan, 49, stood beside him in a video for his Pump Club YouTube channel last Friday. \"That’s actually how we met. She fixed my shoul Read more\n\nWendy Williams documentary producers wouldn't have filmed her if they'd known she had dementia A two-part documentary about Wendy Williams was released over the weekend, and the footage was shocking to see.Just before the premiere, it was revealed that Williams was diagnosed with \"primary progressive aphasia and frontotemporal dementia (FTD),\" and now producers are admitting that if they had known she was suffering from the disease, they never would have done the documentary.Producer Mark Ford, executive producer Erica Hanson and Brie Miranda Bryant, an executive at Lifetime, spoke t Read more\n\nActor Gary Sinise's son dead following battle with rare form of cancer Gary Sinise's son, McCanna \"Mac\" Sinise, has died from a rare form of cancer. He was 33.The Gary Sinise Foundation shared the news on Instagram of Sinise's death on Tuesday, with the caption, \"In Honor & Memory of McCanna ‘Mac’ Sinise 1990-2024.\" In a statement, the foundation said that on August 8, 2018, Mac was diagnosed with a very rare cancer called chordoma. The foundation said chordoma is cancer that originates in the spine and only affects an average of 300 people in the U Read more", "images": ["https://img4.newslocker.com/2024/02/29/310376371_350.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img4.newslocker.com/2024/02/29/310376373_350.jpg", "https://img4.newslocker.com/2024/02/29/310376374_350.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2024/02/28/310326150_725.jpg", "https://img4.newslocker.com/2024/02/28/310326140_725.jpg", "https://img4.newslocker.com/2024/02/28/310326137_725.jpg", "https://img4.newslocker.com/2024/02/29/310378737_350.jpg", "https://img4.newslocker.com/2024/02/28/310326147_725.jpg", "https://img4.newslocker.com/2024/02/28/310326143_725.jpg", "https://img4.newslocker.com/2024/02/29/310376372_350.jpg", "https://img4.newslocker.com/2024/02/28/310326141_725.jpg", "https://img4.newslocker.com/2024/02/29/310376367_350.jpg", "https://img4.newslocker.com/2024/02/28/310326139_725.jpg", "https://img4.newslocker.com/2024/02/28/310326138_725.jpg", "https://img4.newslocker.com/2024/02/29/310376366_350.jpg", "https://img4.newslocker.com/2024/02/28/310326148_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img4.newslocker.com/2024/02/28/310326142_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img4.newslocker.com/2024/02/28/310326134_725.jpg", "https://img4.newslocker.com/2024/02/28/310326144_725.jpg", "https://img4.newslocker.com/2024/02/28/310326133_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/share-linkedin.png", "https://img4.newslocker.com/2024/02/28/310326135_725.jpg", "https://img4.newslocker.com/2024/02/29/310376370_350.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img4.newslocker.com/2024/02/28/310326149_725.jpg", "https://img4.newslocker.com/2024/02/29/310376368_350.jpg", "https://img4.newslocker.com/2024/02/28/310326146_725.jpg", "https://img4.newslocker.com/2024/02/28/310326136_725.jpg", "https://img4.newslocker.com/2024/02/29/310376369_350.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img4.newslocker.com/2024/02/28/310326145_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "title": "Peta Murgatroyd: Maksim Chmerkovskiy and Heather Morris' Shocking Dancing With the Stars Elimination Is \"Awful\"", "meta_data": {"description": "He got it, the right stuff: Nick Viall has some serious boy band dance moves. The Bachelor star did the jive with Peta Murgatroyd to The Beach Boys' Fun, Fun, Fun and received a 28...", "og": {"title": "Peta Murgatroyd: Maksim Chmerkovskiy and Heather Morris' Shocking Dancing With the Stars Elimination Is Awful - Celebrity news - NewsLocker", "description": "He got it, the right stuff: Nick Viall has some serious boy band dance moves. The Bachelor star did the jive with Peta Murgatroyd to The Beach Boys' Fun, Fun, Fun and received a 28...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1493128800.0, "source": "http://www.newslocker.com", "summary": ""}