[
    "claim":"Poseidon Group is a Portuguese-speaking threat group that has been active since at least 2005. The group has a history of using information exfiltrated from victims to blackmail victim companies into contracting the Poseidon Group as a security firm. ",
    "explain":"Transparent Tribe (a.k.a APT36, Earth Karkaddan, TEMP. Lapis, Mythic Leopard…) is an advanced threat actor group that is politically motivated and has suspected Pakistani origins. They mainly target government, diplomatic, defense, military, education, energy, and research organizations in India, Afghanistan, and Iran since 2012.The main reason for suspected origins is based on the Unit42 analyst’s suggested direct linkage of individuals from Pakistan to the infrastructure. This linkage is based on an individual’s OPSEC failure based on real name and mail address usage during infrastructure domain registration.The group primarily focuses on Indian government institutions and employees. Phishing domain names squatted by the group are based on payment service authorities and India’s military and government personnel websites. Their contents are also the same as mimicked via tools such as httrack. Aside from this, domain names similar to file-sharing services are used to trick the general audience into downloading malicious XLS files with macros that download malware samples of CrimsonRAT, ObliqueRAT, and Poseidon families. Targeted malspam campaigns that contained malicious XLS files with VBA macros, which later dropped CrimsonRAT and ObliqueRAT. For instance, this report explains the usage of Poseidon malware which targets government employees who use UNIX-based systems for their jobs by mimicking Kavach service that is used for automation in train protection and collision avoidance systems in India by locomotive pilots and rail-station workers. Malicious documents crafted for generic campaigns include resumes, CVs, or honeytraps (pictures of women). Malicious documents are disguised as conference agendas, invitations, and diplomatic reports if diplomatic entities are targeted. Malspam campaigns target government officials and military entities’ masquerades as guidelines, policies, and activity plans for defense organizations’ personnel, advisories, or top secret briefings.Poseidon is one of many agents of the open-source Mythic C2 Framework. Since this framework is open-sourced, the Poseidon agent can be used by any other actor with internet access. Therefore, it is impossible to say every Poseidon build seen in the wild can be attributed to Transparent Tribe. The same occasion is not valid for CrimsonRAT and ObliqueRAT. These two families are unavailable for everyone, not sold in forums with the MaaS model, and their previous activities are attributed to the activities of the Transparent Tribe group with high confidence. However, this interpretation does not mean Transparent Tribe has no Pakistan-related affiliations. It only means there is not enough data and research to back this verdict at this point.The first ELF file detected in the attack campaign is the Python script file wrapped in ELF format, and the file’s header information shows the presence of the .pydata section.By extracting the compiled Python file (Kavach.pyc) from the pydata section of the ELF file and converting it to the source code, it becomes clear to understand the purpose of the 1st stage file.In the Python code we extracted, we first see the URL of the official website of the Indian government. The threat actor uses the official website login panel to display in the browser to the user.It creates a two command line scheduled task in /dev/shm/mycron for the currently logged-in user. The threat actor has set the scheduled task to run the specified files every time the system is rebooted.After setting the crontab, it deletes the /dev/shm/mycron file containing the above commands from the system. Another vital function of the 1st stage file is downloading additional files from the remote server. Notice that the file to download (bosshelp) matches the filename in the scheduled task set earlier.The 2nd stage file is defined as a payload named Poseidon, written in Go programming language and included in the MythicAgents project on GitHub. The first time the Poseidon malware is run on the target system, a new profile is created for C2 communication. This operation is defined in the main.init function before main.Information about the new profile is in the image below, and as a result, it is kept as a structure containing this information. Important information such as C2 IP address (hard coded), port number, RSA key, and KillDate are found in the C2 profile created in main.init. The RSA key in the profile is generated by the GenerateRSAKeyPair function in the C2 Check-in action, which we describe later.The use of the functionality of the program is decided by using the switch-case structure in the main_handleNewTask routine.The listed functions are used as Wrappers for routines that will provide functionality. For example, the wrapper function of the shell command execution functionality corresponding to task number 4 is labeled as main_handleNewTask_dwrap_4. The code snippet of the function it calls internally is as follows: this structure is similar to other wrapper functions.Each task can be associated with the number at the end of the function name, but remember that this number has no equivalent in the switch-case statement.The Poseidon malware agent installed on the target system can receive commands from the threat actor,To initiate communication with C2, Poseidon first executes an action in the Poseidon project called Check-in. The information collected by the CreateCheckinMessage function indicates that the malware intended to gather information before communicating with C2 on the system it is running. Below we have listed the types of information included in the Check-in message.This value is used as the UUID (HTTP, WEBSOCKET, or TCP) value found in the configuration data while the threat actor prepares a new Poseidon instance and is specific to the detected file.The malware used in the campaign is trying to send data to the remote server with a POST request by establishing a TCP connection with the IP address 70.34.214[.]252, but we cannot obtain details because the server is inactive when the file is analyzed.",
    {
        "report_id": "report_0",
        "link":"https://www.kaspersky.com/blog/poseidon-apt/5165/",
        "sentences": [
            "For initial penetration, they use no exploits; only well-crafted spear-phishing emails carrying DOC/RTF files with encapsulated executables – an uncommon approach nowadays.",
            "Masquerading behind a front-end ‘security company’, they used harvested secrets to blackmail targets into accepting them as IT security contractors.",
            "Of course, with spear-phishing as the penetration method of choice for the majority of Targated Attack groups, scanning email streams is also absolutely crucial nowadays.",
            "The group has been using state-of-the-art custom malware since 2005, at least, and there’s data to suggest that some could have been prototyped as early as 2001.",
            "To fool existing security solutions, they often sign these binaries with real certificates – issued for fake companies or even belonging to genuine well-respected and trusted organizations.",
            "Using this information, and ace Windows admin skills, the attackers can then move laterally without triggering any alarms, their next objective being to obtain Domain Admin rights."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://securelist.com/poseidon-group-a-targeted-attack-boutique-specializing-in-global-cyber-espionage/73673/",
        "sentences": [
            "As we have seen in other targeted campaigns, social engineering and carefully crafted spear-phishing attacks play a crucial role in the effectiveness of getting a foothold in the desired system.",
            "These digital certificates are often issued in the name of rogue and legitimate companies to avoid arousing suspicion from researchers and incident responders.",
            "They are dedicated to running targeted attacks campaigns to aggressively collect information from company networks through the use of spear-phishing packaged with embedded, executable elements inside office documents and extensive lateral movement tools.",
            "This phase will often leverage a specialized tool that automatically collects a wide array of information including credentials, group management policies, and even system logs to better hone further attacks and assure execution of their malware.",
            "This process revealed a series of campaigns with highly-regionalized malware practices and geographically-skewed victim tasking, unsurprising in a region with a gradually-maturing cybercrime industry.",
            "With a set of tools developed for the sole purpose of information gathering and privilege escalation, the sophistication level of campaign highlights that, today, regional actors are not far behind better-known players in the global game of targeted attacks."
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://www.defesanet.com.br/security/poseidon-group-a-targeted-attack-boutique-specializing-in-global-cyber-espionage/",
        "sentences": [
            "As we have seen in other targeted campaigns, social engineering and carefully crafted spear-phishing attacks play a crucial role in the effectiveness of getting a foothold in the desired system.",
            "These digital certificates are often issued in the name of rogue and legitimate companies to avoid arousing suspicion from researchers and incident responders.",
            "They are dedicated to running targeted attacks campaigns to aggressively collect information from company networks through the use of spear-phishing packaged with embedded, executable elements inside office documents and extensive lateral movement tools.",
            "This phase will often leverage a specialized tool that automatically collects a wide array of information including credentials, group management policies, and even system logs to better hone further attacks and assure execution of their malware.",
            "This process revealed a series of campaigns with highly-regionalized malware practices and geographically-skewed victim tasking, unsurprising in a region with a gradually-maturing cybercrime industry.",
            "With a set of tools developed for the sole purpose of information gathering and privilege escalation, the sophistication level of campaign highlights that, today, regional actors are not far behind better-known players in the global game of targeted attacks."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://www.infosecurity-magazine.com/news/poseidon-group-global-cyber/",
        "sentences": [
            "The Poseidon Group is an advanced threat actor active in global cyber-espionage operations.",
            "The Poseidon Group relies on spear-phishing emails with RTF/DOC files, usually with a human resources lure, that drop a malicious binary into the target’s system when clicked on.",
            "The first ever publicly-known Brazilian Portuguese-speaking cyber-espionage campaign has been uncovered, targeting financial institutions as well as telecommunications, manufacturing, energy and media companies.",
            "“In addition, the malware is designed to function specifically on English and Brazilian Portuguese Windows machines, a first for a targeted attack.”",
            "“This phase will often leverage a specialized tool that automatically and aggressively collects a wide array of information including credentials, group management policies and even system logs to better hone further attacks and assure execution of the malware,” the firm said.",
            "“What makes the Poseidon Group stand out is that it’s a commercial entity, whose attacks involve custom malware digitally signed with rogue certificates deployed to steal sensitive data from victims to coerce them into a business relationship,” researchers said in a blog post."
        ]
    }
]