{"url": "http://www.newslocker.com/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "text": "Madelaine Petsch & Froy Gutierrez Are Terrorized By Masked Strangers in 'The Strangers: Chapter 1' Trailer The official trailer for the movie The Strangers: Chapter 1 has arrived and it looks terrifying.\n\nRiverdale actress Madelaine Petsch and Cruel Summer actor Froy Gutierrez lead the cast of the new horror film, which will arrive in theaters on May 17.\n\nAfter their car breaks down in an eerie small town, a young couple (Petsch and Gutierrez) are forced to spend the night in a remote cabin. Panic ensues as they are terrorized by three masked strangers who strike with no mercy and seemingly no motive. Read more\n\nAshley Park & Boyfriend Paul Forman Make a Fashionable Couple During Paris Fashion Week Ashley Park is enjoying Paris Fashion Week during her break from filming Emily in Paris!\n\nThe 32-year-old actress was joined by her boyfriend and co-star Paul Forman while attending the Giambattista Valli fashion show on Friday morning (March 1) in Paris, France.\n\nAshley and Paul sat together in the front row, both wearing shoulder-baring looks. Also in attendance at the show was Extended Family actress Abigail Spencer.\n\nThat same day, Ashley was seen heading into the Nina Ricci show.\n\nOn Wednesday Read more\n\nMiley Cyrus Credits Pharrell Williams With Helping Her Rebuild Her Identity After 'Hannah Montana' Miley Cyrus has a special relationship with Pharrell Williams that she can trace back over a decade.The 31-year-old “Flowers” Grammy winner joined forces with the musician on their new song “Doctor (Work It Out),” which arrived on Friday (March 1).In a joint interview, Miley revealed how Pharrell helped her rediscover her own identity after leaving behind her Hannah Montana days. She even shared a specific change to her appearance that he encouraged her to make when no o Read more\n\nHailey Bieber's Sister Alaia Baldwin Aronow Arrested on Assault & Battery Following Bar Incident Hailey Bieber‘s older sister was arrested last weekend in Georgia.\n\nOn Sunday (Feb. 24), Alaia Baldwin Aronow was arrested on charges of simple assault, simple battery, battery and criminal trespassing following an incident where was accused of throwing her tampon at an employee at the club Elan in Savannah.\n\nKeep reading to find out more…Security footage from the club shows, Alaia, 31, “forcing her way into the locked employee bathroom,” according to a police report obta Read more\n\nSteph Curry & Wife Ayesha Expecting Baby No. 4! Steph and Ayesha Curry are having another baby!\n\nIn a new interview published on Friday (March 1), he 34-year-old cookbook author revealed that she and the 35-year-old Golden State Warriors player are expecting their fourth child.\n\nKeep reading to find out more…While chatting with Sweet July Magazine, Ayesha said while she and Steph initially “thought we were done” having kids, they realized last year that “somebody was missing.”\n\nSteph and Ayesha have been married s Read more\n\nSummer House's Lindsay Hubbard Responds to Backlash After Questioning Carl Radke's Sobriety Lindsay Hubbard is addressing all of the backlash following the most recent episode of Summer House.\n\nIn the Thursday (Feb. 29) episode of the hit Bravo reality series, Lindsay, 37, and Carl Radke arrive at in the Hamptons before getting into a explosive argument.\n\nAfter the fight, Lindsay questioned her then-fiancé’s sobriety.\n\nIf you didn’t know, Carl, 39, has been sober from alcohol and drugs since 2021.\n\nKeep reading to find out more…“The way that he spoke to me Read more\n\nPawn Stars' Rick Harrison's Son Adam's Cause of Death Revealed More details have been revealed following the death of Rick Harrison‘s son.\n\nBack in January, it was announced that Adam Harrison, one of the sons of the 58-year-old Pawn Stars creator and star, had died at the age of 39. At the time, it was revealed that Adam died from a drug overdose.\n\nOn Thursday (Feb. 28), Adam‘s official cause of death was confirmed the coroner’s office.\n\nKeep reading to find out more…Adam passed from fentanyl and methamphetamine toxicity, a public in Read more\n\nLiam Payne is All About Plaid & Girlfriend Kate Cassidy During Paris Trip After Dropping New Single Liam Payne jumpstarted a new era in his career and then jetted straight to Paris, France with girlfriend Kate Cassidy.\n\nThe 30-year-old One Direction musician dropped his new single “Teadrops,” which was co-written by another boy bander.On Friday (March 1), he and Kate were spotted arriving at Hotel la Reserve in the midst of Paris Fashion Week. The couple changed and then headed out to take in the sights in the city of love.\n\nKeep reading to find out more…\n\nArriving at the hote Read more\n\nRichest S Club 7 Members, Ranked From Lowest to Highest Net Worth There still ain’t no party like an S Club party, even 20 years later!\n\nThe British co-ed pop sensations S Club, also known as S Club 7, made a huge name for themselves in the ’00s across the world with hits like “Don’t Stop Movin’,” “Bring It All Back,” “Never Had a Dream Come True,” “Reach” and “Have You Ever.”\n\nThe group was formed with seven members, and would go on release four studio albums from 1999 to 2002, Read more\n\nElizabeth Olsen Meets Up with Sisters Mary-Kate & Ashley Olsen for Dinner in Paris The Olsen sisters are enjoying a night out in Paris!\n\nElizabeth Olsen met up with sisters Mary-Kate and Ashley Olsen along with a bunch of friends for dinner at Caviar Kaspia on Thursday night (February 29) in Paris, France.\n\nPHOTOS: Check out the latest pics of Elizabeth Olsen\n\nAfter dinner, Elizabeth, 35, was seen holding hands with husband Robbie Arnett as they left the restaurant and hopped into their ride and heading to their hotel.\n\nThe day before, Mary-Kate and Ashley debuted their latest Th Read more\n\nVictoria Beckham Steps Out on Crutches in Paris Following Foot Injury Victoria Beckham isn’t letting a foot injury slow her down!\n\nThe 49-year-old fashion designer and former Spice Girls singer walked with crutches as she arrived at Hotel La Réserve on Friday (March 1) in Paris, France.\n\nPHOTOS: Check out the latest pics of Victoria Beckham\n\nFor her outing, Victoria wore a leather jacket paired with black, wide-legged trousers and sunglasses.Later in the day, Victoria will be debuting her Fall/Winter 2024-2025 collection during Paris Fashion Week.\n\nIf yo Read more\n\nKarol G's Private Plane Makes Emergency Landing After Pilot Discovers Smoke in Cockpit - Report Karol G‘s private jet reportedly had to make an emergency landing following a scary incident.\n\nShortly after takeoff on Thursday night (February 29), the 33-year-old Colombian singer’s plane had to make an emergency landing at Van Nuys Airport in Los Angeles around 9pm local time after the pilot reportedly discovered smoke in the cockpit.\n\nKeep reading to find out more…According to ABC7, the jet carrying 16 people took off from Hollywood Burbank Airport, but had to turn around Read more\n\n'Cabaret' Stars Eddie Redmayne & Gayle Rankin Support Opening Night of Liev Schreiber's Play 'Doubt' Eddie Redmayne is getting ready for his return to Broadway in Cabaret alongside Gayle Rankin and they took a break from rehearsals to catch the opening night of Doubt: A Parable.\n\nThe future co-stars walked the red carpet together at the opening performance on Thursday night (February 29) at the Todd Haimes Theatre in New York City.\n\nLiev Schreiber stars in the play and was joined on the carpet by co-stars Amy Ryan, Zoe Kazan, and Quincy Tyler Bernstine, as well as his wife Taylor Neisen and chil Read more\n\nLiam Payne Releases 'Teardrops' Song - Read Lyrics & Listen Now! Liam Payne is back with a brand new song and it was co-written by NSYNC‘s JC Chasez!\n\nThe 30-year-old One Direction singer has released “Teardrops” to kick off the new chapter of his career.\n\n“Teardrops is about the vulnerability of heartbreak and the challenge of overcoming those moments. This song marks the start of a new beginning, there’s lots more to come in 2024,” Liam said in a statement.\n\nSong co-writer Jamie Scott described Liam‘s past year in the Read more", "images": ["http://www.newslocker.com/images/share-twitter.png", "https://img4.newslocker.com/2024/03/01/310606099_350.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2024/03/01/310596031_725.jpg", "https://img4.newslocker.com/2024/03/01/310596032_725.jpg", "https://img4.newslocker.com/2024/03/01/310596030_725.jpg", "https://img4.newslocker.com/2024/03/01/310596039_725.jpg", "https://img4.newslocker.com/2024/03/01/310596037_725.jpg", "https://img4.newslocker.com/2024/03/01/310606100_350.jpg", "https://img4.newslocker.com/2024/03/01/310596033_725.jpg", "https://img4.newslocker.com/2024/03/01/310596025_725.jpg", "https://img4.newslocker.com/2024/03/01/310596017_725.jpg", "https://img4.newslocker.com/2024/03/01/310596029_725.jpg", "https://img4.newslocker.com/2024/03/01/310596015_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img4.newslocker.com/2024/03/01/310596020_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img4.newslocker.com/2024/03/01/310606098_350.jpg", "https://img4.newslocker.com/2024/03/01/310596022_725.jpg", "https://img4.newslocker.com/2024/03/01/310596023_725.jpg", "https://img4.newslocker.com/2024/03/01/310596034_725.jpg", "https://img4.newslocker.com/2024/03/01/310596024_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img4.newslocker.com/2024/03/01/310596026_725.jpg", "https://img4.newslocker.com/2024/03/01/310596018_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img4.newslocker.com/2024/03/01/310596027_725.jpg", "https://img4.newslocker.com/2024/03/01/310596019_725.jpg", "https://img4.newslocker.com/2024/03/01/310606101_350.jpg", "https://img4.newslocker.com/2024/03/01/310596016_725.jpg", "https://img4.newslocker.com/2024/03/01/310596021_725.jpg", "https://img4.newslocker.com/2024/03/01/310596035_725.jpg", "https://img4.newslocker.com/2024/03/01/310596028_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "https://img4.newslocker.com/2024/03/01/310596036_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img4.newslocker.com/2024/03/01/310596038_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "title": "Does Hollywood Hate the Easter Bunny?", "meta_data": {"description": "Ask anyone to name his favorite Easter movie, and chances are you'll get a blank stare.A few people might say Here Comes Peter Cottontail (which was actually a 1971 stop motion...", "og": {"title": "Does Hollywood Hate the Easter Bunny? - Celebrity news - NewsLocker", "description": "Ask anyone to name his favorite Easter movie, and chances are you'll get a blank stare.A few people might say Here Comes Peter Cottontail (which was actually a 1971 stop motion...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492264800.0, "source": "http://www.newslocker.com", "summary": ""}