[
    "claim":"Candiru spyware is part of a thriving private industry selling technology to governments and authoritarian leaders so they can gain access to the communications of private citizens and political opposition [File: John Taggart/Bloomberg]",
    "explain":"The researchers found that the websites that were ‘known targets’ of this kind of attack included Middle East Eye, a London-based news website, and multiple websites associated with government ministries in Iran and Yemen. Photograph: Yuichiro Chino/Getty Images Malware This article is more than 2 years old Israeli firm’s spyware linked to attacks on websites in UK and Middle East This article is more than 2 years old Canada-based researchers say new evidence suggests Candiru’s software used to target critics of autocratic regimes Stephanie Kirchgaessner in Washington Tue 16 Nov 2021 11.15 EST Researchers have found new evidence that suggests spyware made by an Israeli company that was recently blacklisted in the US has been used to target critics of Saudi Arabia and other autocratic regimes, including some readers of a London-based news website. A report by Montreal-based researchers from Slovakian company Eset, an internet security firm, found links between attacks against high-profile websites in the Middle East and UK, and the Israeli company Candiru, which has been called Israel’s “most mysterious cyberwarfare company”. Candiru and NSO Group, a much more prominent Israeli surveillance company, were both added to a US blacklist this month after the Biden administration took the rare step of accusing the firms of acting against US national security interests.The Eset report revealed new information about so-called “watering hole attacks”. In such attacks, spyware users launch malware against ordinary websites that are known to attract readers or users who are considered “targets of interest” by the user of the malware. The sophisticated attacks allow the malware user to identify characteristics about the individuals who have visited the website, including what kind of browser and operating system they are using. In some cases the malware user can then launch an exploit that allows them to take over an individual target’s computer. Unlike NSO Group’s signature spyware, which is called Pegasus and infects mobile phones, Candiru’s malware is believed by researchers to infect computers. The company appears to be named after a parasitic freshwater catfish that can be found in the Amazon. The researchers found that the websites that were “known targets” of this kind of attack included Middle East Eye, a London-based news website, and multiple websites associated with government ministries in Iran and Yemen. Candiru did not respond to the Guardian’s request for comment. Middle East Eye condemned the attacks. In a statement, its editor-in-chief, David Hearst, said the outlet was no stranger to attempts to take the website down by state and non-state actors. “Substantial sums of money have been spent trying to take us out. This has not stopped us reporting what is going on in all corners of the region and I am confident that they will not stop us in future,” he said. Once websites are compromised, researchers at Eset say, they are considered “jumping off sites” that help malware users target individuals. In other words, not every individual who visited one of the compromised websites would have been in danger of being hacked, but users of the malware are believed to have used the websites as a starting point to help identify a much smaller group of individuals who were then targeted. Matthieu Faou, who uncovered the campaigns, said Eset developed a custom in-house system in 2018 to uncover “watering holes” on high-profile websites. In July 2020, the system notified them that an Iranian embassy website in Abu Dhabi had been tainted with malicious code. “Our curiosity was aroused by the high-profile nature of the targeted website, and in the following weeks we noticed that other websites with connections to the Middle East were also targeted,” Faou said. The “threat group” then “went quiet” until it resurfaced in January 2021 and was active until late summer in 2021, when all the websites that were observed to have been victims of attacks were then “cleaned”, Eset said. Eset said it believed hacking activities ended in late July 2021 after a report by researchers at Citizen Lab, released in conjunction with Microsoft, detailed Candiru’s alleged surveillance activities. That report accused Candiru of selling spyware to governments linked to fake Black Lives Matter and Amnesty International websites that were used to hack targets. In the July 2021 report, Citizen Lab, a research group affiliated with the University of Toronto, said the Tel Aviv-based Candiru made “untraceable” spyware that could infect computers and phones. At the time, Candiru declined to comment. Microsoft said in July that it appeared that Candiru sold the spyware that enabled the hacks, and that the governments generally chose who to target and ran the operations themselves. The company also announced at the time that it had disabled the “cyberweapons” of Candiru and built protections against the malware, including issuing a Windows software update. There is little public information available about Candiru, which was founded in 2014 and has undergone several name changes. In 2017 the company was selling its malware to clients in the Gulf, western Europe and Asia, according to a lawsuit reported in an Israeli newspaper. Candiru may have deals with Uzbekistan, Saudi Arabia and the UAE, Forbes has reported.Microsoft reported that it had found victims of the spyware in Israel and Iran. Citizen Lab said it was able to identify a computer that had been hacked by Candiru’s malware, and then used that hard drive to extract a copy of the firm’s Windows spyware. The owner of the computer was a “politically active” individual in western Europe, it said. This month Candiru made headlines after the Biden administration announced it had added the company to the commerce department’s entity list, a blacklist usually reserved for America’s worst enemies, including Chinese and Russian hackers. In its press release, the commerce department said it had evidence that Candiru developed and supplied spyware to foreign governments that used it to maliciously target government officials, journalists, businesspeople, activists, academics and embassy workers. The tools also helped to enable foreign governments to conduct “transnational repression”, the department said.",
    {
        "report_id": "report_0",
        "link":"https://decoded.avast.io/janvojtesek/the-return-of-candiru-zero-days-in-the-middle-east/",
        "sentences": [
            "After Candiru was exposed by Microsoft and CitizenLab in July 2021, it laid low for months, most likely taking its time to update its malware to evade existing detection.",
            "Based on the malware and TTPs used to carry out the attack, we can confidently attribute it to a secretive spyware vendor of many names, most commonly known as Candiru.",
            "In Lebanon, the attackers seem to have compromised a website used by employees of a news agency.",
            "Specifically, a large portion of the attacks took place in Lebanon, where journalists were among the targeted parties.",
            "We can’t say for sure what the attackers might have been after, however often the reason why attackers go after journalists is to spy on them and the stories they’re working on directly, or to get to their sources and gather compromising information and sensitive data they shared with the press.",
            "We recently discovered a zero-day vulnerability in Google Chrome (CVE-2022-2294) when it was exploited in the wild in an attempt to attack Avast users in the Middle East."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://www.jpost.com/business-and-innovation/all-news/article-713023",
        "sentences": [
            "Al Manar, for example, is a media outlet that is run by Hezbollah and was designated as a terror entity by the United States back in 2006.",
            "Also known as SAITO Tech, Candiru is an Israeli technology company that creates cyberespionage systems, often for governmental clients, including the Israeli Ministry of Defense.",
            "Although Candiru’s motives were unclear, “the reason why attackers go after journalists is to spy on them and the stories they’re working on directly, or to get to their sources and gather compromising information and sensitive data they shared with the press,” the cybersecurity firm explained.",
            "That Candiru’s attacks were detected emphasizes the value of cybersecurity firms that look out for mercenary spyware, Bill Marczak, a member of CitizenLab’s investigation into the company, said.",
            "The cyberattacks in Lebanon allegedly compromised a website that journalists frequented, according to Avast.",
            "“Based on the malware and TTPs used to carry out the attack, we can confidently attribute it to a secretive spyware vendor of many names, most commonly known as Candiru,” Avast wrote."
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://www.eset.com/int/about/newsroom/press-releases/research/eset-research-discovers-watering-hole-attacks-on-websites-in-the-middle-east-with-links-to-candiru-s-1/",
        "sentences": [
            "Candiru is a private Israeli spyware company that was recently added to the US Department of Commerce’s Entity List.",
            "ESET researchers have discovered strategic web compromise (watering hole) attacks against high-profile websites in the Middle East, with a strong focus on Yemen.",
            "The attacks are linked to Candiru, a company that sells state-of-the-art offensive software tools and related services to government agencies.",
            "The campaign has strong links to Candiru, an Israeli spyware firm recently blacklisted by the US Department of Commerce, that sells state-of-the-art offensive software tools and services to government agencies.",
            "The victimized websites belong to media outlets in the UK, Yemen, and Saudi Arabia, as well as to Hezbollah; to government institutions in Iran (Ministry of Foreign Affairs), Syria (including the Ministry of Electricity), and Yemen (including the Ministries of Interior and Finance); to internet service providers in Yemen and Syria; and to aerospace/military technology companies in Italy and South Africa.",
            "“In a blogpost about Candiru by Citizen Lab at the University of Toronto, the section called ‘A Saudi-Linked Cluster?’ mentions a spearphishing document that was uploaded to VirusTotal and multiple domains operated by the attackers."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://www.aljazeera.com/economy/2021/7/15/citizen-lab-spyware-by-israels-candiru-used-to-target-activists",
        "sentences": [
            "Another Israeli company, NSO Group Ltd., has been accused of providing spyware to repressive governments that have used it to snoop on journalists and activists.",
            "At least 100 activists, journalists and government dissidents across 10 countries were targeted with spyware produced by an Israeli company called Candiru, according to cybersecurity researchers at the University of Toronto’s Citizen Lab, which tracks illegal hacking and surveillance.",
            "Indian journalists targeted by Israeli spyware again: What do we know?",
            "The Citizen Lab researchers said the Candiru spyware is part of a thriving private industry selling technology to governments and authoritarian leaders so they can gain access to the communications of private citizens and political opposition",
            "The Citizen Lab researchers said the Candiru spyware is part of a thriving private industry selling technology to governments and authoritarian leaders so they can gain access to the communications of private citizens and political opposition.",
            "Using a pair of vulnerabilities in Microsoft Corp.’s Windows, cyber operatives operating in Saudi Arabia, Israel, Hungary, Indonesia and elsewhere purchased and installed remote spying software made by Candiru, according to the researchers."
        ]
    }
]