claim：Recently a new series of malware samples were submitted to the major online sandboxes. We noticed one sample submitted to Virus Total that was attributed by some experts to the Russian APT28 group.
explain：Recently, a new series of malware samples were submitted to the major online sandboxes. We noticed one sample submitted to Virus Total that was attributed by some experts to the Russian APT28 group. The APT28 group (aka Fancy Bear, Pawn Storm, Sednit, Sofacy, and Strontium) has been active since at least 2007 and it has targeted governments, militaries, and security organizations worldwide. The group was involved also in the string of attacks that targeted 2016 Presidential election. With the help of the researcher that goes online with the Twitter handle Drunk Binary (@DrunkBinary) we obtained a collection of samples to compare with the one we were in possession to discover if we were in presence of a new variant of the infamous APT28 backdoor tracked as X-Agent. The attack we analyzed is multi-stage, an initial dropper malware written in Delphi programming language (a language used by the APT28 in other campaigns) downloads a second stage payload from internet and executes it. The payload communicates to the server using HTTPS protocol, making it impossible to eavesdrop on the malicious traffic it generates. We also analyzed another malicious DLL, apparently unrelated to the previous samples, that presents many similarities with other payloads attributed to the Russian APT group. This malware is particularly interesting for us because it contacts a command and control with the name “marina-info.net” a clear reference to the Italian Military corp, Marina Militare. This lead us into speculating that the malicious code was developed as part of targeted attacks against the Italian Marina Militare, or some other entities associated with it. This last DLL seems to be completely unconnected with the previous samples, but further investigation leads us into believing that it was an additional component used by APT28 in this campaign to compromise the target system. APT28 has a rich arsenal composed of a large number of modular threats and the dll is the component of the X-Agent we analyzed. X-Agent is a persistent payload injected into the victim machine that can be compiled for almost any Operating System and can be enhanced by adding new ad-hoc component developed for the specific cyber-attack. In our case, the component was submitted to online sandboxes while the new campaign was ongoing. We cannot exclude that the APT group developed the backdoor to target specific organizations including the Italian Marina Militare or any other subcontractor. In our analysis we were not able to directly connect the malicious dll file to the X-Agent samples, but believe they are both part of a well-coordinated surgical attack powered by APT28. The dll that connect to “marina-info.net” may be the last stage-malware that is triggered only when particular conditions occur, for example when the malware infects a system with an IP address belonging to specific ranges.In this section we reports all the sample we analyzed in our investigation. The first four executables listed in the previous paragraph were used as infection vectors in the new campaign we investigated. The samples appear as different payloads but further basic static analysis allowed us to discover that they are the same malware sample:These files seem to be a classic img and a link, but actually the jpg file is the executable of the second sample and in the link file is hidden the following command:After executing the file, it contacts the IP “45.124.132.127” where it sends periodically some information gathered on the operative system, using the command line “cmd.exe /c tasklist & systeminfo”. The information is sent to the command and control through HTTPS communication using a POST method.Once the malware has sent the information about the host configuration to the C2, it will download another file, “upnphost.exe”, stored in the path “%APPDATA%\Local\Temp” that probably is the final payload. Moreover, the executable implements a persistence mechanism by setting the registry key: This other file contacts another command and control “46.183.218.37”, located in Latvia:We also discovered that the “upnphost.exe” file was submitted to Virus Total by us, likely because the evasion technique implemented by the dropper. In order to analyze the dropper, we patched it. Once the patching was applied we was able to analyze the complete malicious behavior of the malware. The malicious code starts contacting the previously mentioned Command and Control and downloads this “upnphost.exe” file. Below the results we obtained submitting the patched version of the binary on VirusTotal: The communication with the command and control is managed with a script written in the AutoIt language. This script is embedded in the “upnphost.exe” file as resource, and, when it is launched, it communicates with this other server in HTTPS, sending some information about the victim’s computer.The above figure shows a piece of decompiled code of the AutoIt script, where the IP address and the path, with relative user agent are masqueraded in hexadecimal encoding. After decoding the parameters, we obtain the IP address, the path and the user agent used to contact the C&C and send back the information about the target system.Another peculiarity, is the name of the function where is present the code for the HTTPS communication. It is “checkupdate()” and it seems that the malware is instructed to contact periodically the C&C waiting for new commands. The following picture shows the multi-stage attack:This file was retrieved from the threat intelligence platforms and was flagged as an APT28 sample, such as also the previous files. It is not clear if this sample is connected to the previous ones, but probably it belongs to the same infection campaign because it was uploaded in the same time period on several online sandboxes. Another characteristic in common to the previous files is that, this one is written in Delphi programming language, like also the four initial file droppers. It is rare to find a malware written in Delphi language, but previous investigations conducted by other security firms confirm that the APT28 group already used malware written in this language in past campaigns. The most important evidence emerged from the analysis of the sdbn.dll is that it contacted the domain: “marina-info.net,” a clear reference to the Italian Marina Militare. The domain is resolved in the IP “191.101.31.250” which is located in Holland:The communication to the C2 is performed also in this case by using the HTTPS protocol. We discovered at least three paths contacted with a custom user agent header:Like the “upnphost.exe” malware, this other executable periodically contacts the command and control waiting for new commands. However, we discovered that the server responds always with 403 Status code Forbidden, also to the requests sent by the malware itself. This behavior could be the result of a server-side control implemented by the server to allow the requests coming only from particular IP addresses or simply it was intentionally disabled by the attackers likely because they believe to have been uncovered by the victims or by the security firms. It could be a security mechanism implemented by the attackers to make hard the investigation of security firms. Moreover, we decided to further investigate the detection rate of this new file on VirusTotal. When we started our analysis it was zero, this means that the threat was completely undetected and currently the malicious code has a detection rate of 35/65.In this paragraph, we show the threat map with the location of the various IP addressed contacted by the samples we analyzed. As we can see, the attack surface covered by the hacker group is incredibly wide: there are two different C2Cs in Europe and another one in China to mislead the analysis and this create confusion during the reconstruction of the complete cyber-attack.
[
    {
	link：https://www.welivesecurity.com/2018/09/27/lojax-first-uefi-rootkit-found-wild-courtesy-sednit-group/
        "report_id": "report_0",
        "sentences": [
            "Additional pivoting based on artifacts unique to this malware family expanded our dataset to hundreds of samples used over the last several years.",
            "Also, we found the IP address 185.25.50[.]93 hosting C2 services for a Delphi backdoor that ESET’s report states is the final stage payload for these attacks.",
            "Based on dynamic and static analysis of the malware sample associated with the supservermgr[.]com domain however, we were able to determine several unique artifacts which allowed us to expand our dataset and discover additional findings.",
            "In addition to the large number of Zebrocy attacks we discovered, we also observed instances of the Sofacy group leveraging the Dynamic Data Exchange (DDE) exploit technique previously documented by McAfee.",
            "In our February report, we discovered the Sofacy group using Microsoft Office documents with malicious macros to deliver the SofacyCarberp payload to multiple government entities.",
            "In that report, we documented our observation that the Sofacy group appeared to use conventional obfuscation techniques to mask their infrastructure attribution by using random registrant and service provider information for each of their attacks."
        ]
    },
    {
	link：https://securelist.com/author/great/
        "report_id": "report_1",
        "sentences": [
            "It appears that Sofacy may have used an open-source tool called Luckystrike (https://github.com/curi0usJack/luckystrike) to generate the delivery document and/or the macro used in this attack.",
            "The Sofacy group (AKA APT28, Fancy Bear, STRONTIUM, Sednit, Tsar Team, Pawn Storm) is a well\u0002known adversary that remains highly active in the new calendar year of 2018.",
            "The loader Trojan uses this batch file to run the embedded DLL payload.",
            "The newly dropped executable is a loader Trojan responsible for installing and running the payload of this attack.",
            "To confirm our suspicions, we generated a malicious Excel file with Luckystrike and compared its macro to the macro found within Sofacy’s delivery document.",
            "We performed a more detailed analysis on this loader Trojan, which readers can view in this report’s appendix."
        ]
    },
    {
	https://www.threatminer.org/_reports/2018/SofacyAttacksMultipleGovernmentEntities_PaloAltoNetworks.pdf
        "report_id": "report_2",
        "sentences": [
            "And much of the malware being deployed by Sofacy is quickly changed from C/C++ to .Net",
            "And when specific malware sets are selectively deployed, that may tell us something about how efforts are divided.",
            "Even the individual Linux modules renamed as “Fysbis” backdoors released in 2016 were merely modified and reduced portions of recompiled XAgent C/C++ codebase.",
            "Here, we examine current deployment, code, cryptography, and targeting.",
            "It is easy to expect deliberate changes within this group in 2018, with even more .Net, Delphi, and powershell ports of various tools appearing at Sofacy targets throughout the year",
            "Sofacy, also known as APT28, Fancy Bear, and Tsar Team, is a prolific, well resourced, and persistent adversary."
        ]
    },
    {
	https://unit42.paloaltonetworks.com/unit42-sofacy-groups-parallel-attacks/
        "report_id": "report_3",
        "sentences": [
            "In May 2018, an Arbor Networks blogpost [13] describing several trojanized samples of the LoJack small agent, rpcnetp.exe, was published.",
            "Sednit also known as APT28, Sofacy, Strontium and Fancy Bear – has been operating since at least 2004, and has made headlines frequently in the past years: it is believed to be behind major, high profile attacks.",
            "The differences between the legitimate and trojanized agent are so small that the figures above actually show most of the changes between them.",
            "These malicious samples communicated with a malicious C&C server instead of the legitimate Absolute Software one, because their hardcoded configuration settings had been altered.",
            "We do not know for sure how the different tools ended up on the compromised systems.",
            "While we know of their existence, there has never been a published report detailing a real case of a victim compromised by such malware."
        ]
    }
]