[
    "claim":"PLATINUM is an activity group that has targeted victims since at least 2009, which has focused on targets associated with governments and related organizations in South and Southeast Asia.",
    "explain":"Platinum is one of the most technologically advanced APT actors with a traditional focus on the APAC region. During recent analysis we discovered Platinum using a new backdoor that we call Titanium (named after a password to one of the self-executable archives). Titanium is the final result of a sequence of dropping, downloading and installing stages. The malware hides at every step by mimicking common software (protection related, sound drivers software, DVD video creation tools).During our research we found that the main targets of this campaign were located in South and Southeast Asia.The Titanium APT includes a complex sequence of dropping, downloading and installing stages, with deployment of a Trojan-backdoor as the final step. Almost every level of the system mimics known software, such as security software, software for making DVD videos, sound drivers’ software etc. In every case the default distribution is: an exploit capable of executing code as a SYSTEM user a shellcode to download the next downloader a downloader to download an SFX archive that contains a Windows task installation script a password-protected SFX archive with a Trojan-backdoor installer an installer script (ps1) a COM object DLL (a loader) the Trojan-backdoor itself. Another known way of spreading is the use of a shellcode that needs to be injected into a process. In this case it was winlogon.exe. Unfortunately, we don’t know how the shellcode was injected. See the shellcode description below.Attackers make active use of various kinds of ‘wrappers’. Each wrapper is usually a COM DLL, with the corresponding exported functions. The main purpose of these libraries is to decrypt and load an encrypted file (previously dropped somewhere) into the system memory (a payload) and then redirect calls to the wrapper itself to the payload’s exported functions. This is a password-encrypted SFX archive that can be downloaded via BITS Downloader. The password is hardcoded into the downloader that is used to decrypt the SFX archive using the -p command line argument. The main feature of this archive is that it contains the cURL executable code, compiled into a DLL. Its purpose is to install the Windows task to establish persistence in the infected system. Another type of wrapper DLL is designed to obtain a command line from its exported function argument passed by a caller and create a new process.The backdoor itself uses an SFX archive which must be launched from the command line using a password to unpack it. All paths examples here and there will be for the DVD making software. However, these notes can be also applied to any other known software paths.This component is used to download encrypted files from the C&C server then decrypt and launch them.The shellcode itself contains position-independent code and doesn’t require previously loaded libraries (except Kernel32.dll). Its sole purpose is to connect to the hardcoded C&C address, download an encrypted payload (the password-protected SFX archive), The BITS Downloader is a DLL file which has only one exported function: GetVersionInfoA. The main purpose of this library is to download files in encrypted form from the C&C and launch them.The first thing the downloader does is to check whether it was started using the SYSTEM user. If it was, it launches command line arguments (that were passed to the binary loaded by the downloader DLL) using WMI. If it wasn’t started using the SYSTEM user, the downloader passes command line arguments into the argument parser.If one of these parameters exists, the downloader will collect information about installed antivirus products and send it to the C&C. After that, it sends the download request to the confirmation URL. In response, the C&C sends a file that will be downloaded in the %USERPROFILE% directory. To decrypt the downloaded file, the downloader uses an MD5 hash of the strings’ encryption key.To launch the downloaded file, the downloader uses the WMI classes Win32_ProcessStartup, Win32_Process and their methods and fields.To download a file, the downloader uses the BITS service and its COM interface, called IBackgroundCopyManager. It creates a task with the name Microsoft Download, then specifies remote and local file paths and timeouts.It launches the h.ps1 script to get information about system-wide proxy settings. After that it launches the e.ps1 script to calculate the SystemID that will be used in requests to the C&C. To send a request, it uses c.dll (which is cURL and has an exported function called DllGetClassObject).This request downloads the x.dat file, and the f1.ps1 script decrypts it into u.xml. After that it launches the next request.It downloads the b.dat file, and the f2.ps1 script decrypts it into i.bat (using the same decryption algorithm).In the case of the audio drivers software mimic, it differs only in its installation method compared to DVD making software: the ps1 script uses two known CLSIDs to replace their COM DLL paths with malicious ones.This is the installer script that registers DvDupdate.dll as the ‘DVDMaker Help’ service, and sets its entry point as the DllGetClassObject name. It requires admin privileges to be executed correctly. The script contains configurable parameters, so it’s easy to change any of the required parameters for different systems.This is a service DLL, but with all the same exports you would expect from a COM object. Basically, it’s a payload loader. The whole code is obfuscated with different Windows API calls and loops. It wasn’t designed to confuse a reverse engineer or to make reverse engineering harder, but to bypass some simple AV emulation engines. The first exported function for every COM object is DllGetClassObject.The loader creates a thread that decrypts the payload, restores its PE and MZ headers, and then loads it into memory and launches it. The payload is encrypted with AES 256 CBC. The decryption key is hardcoded along with other encrypted strings. It doesn’t contain ‘MZ‘ and ‘PE‘ tags that allow it to bypass simple AV engines. After initializing the payload, the loader calls its function with ordinal 1.The payload, with backdoor functionality, is a DLL file. The malware functionality is in the first exported entry only.The execution thread is responsible for receiving commands from the C&C server and sending responses. It contains an execution loop that starts by reading configuration item #00 to get the C&C address.To initialize the connection to the C&C, the payload sends a base64-encoded request that contains a unique SystemID, computer name, and hard disk serial number. After that, the malware starts receiving commands.To receive commands from the C&C, the payload sends an empty request to the C&C. It uses the UserAgent string from the configuration and a special cookie generation algorithm to prepare a request. The malware can also get proxy settings from Internet Explorer. In response to this request, the C&C answers with a PNG file that contains steganographically hidden data. This data is encrypted with the same key as the C&C requests. The decrypted data contains backdoor commands and arguments for them.The Titanium APT has a very complicated infiltration scheme. It involves numerous steps and requires good coordination between all of them. In addition, none of the files in the file system can be detected as malicious due to the use of encryption and fileless technologies. One other feature that makes detection harder is the mimicking of well-known software. Regarding campaign activity, we have not detected any current activity related to the Titanium APT.",
    {
        "report_id": "report_0",
        "link":"",
        "sentences": [
            "As a first stage the operators used WMI subscriptions to run an initial PowerShell downloader which, in turn, downloaded another small PowerShell backdoor.",
            "It’s worth mentioning that in the second stage, all executable files were protected with a runtime crypter and after unpacking them we found another, previously undiscovered, backdoor that is known to be related to PLATINUM.",
            "Our paper only includes a description of the two previously undiscovered backdoors while the full report is available to customers of the Kaspersky Intelligence Reporting service (contact intelreports@kaspersky.com).The main binary backdoor is installed with a dedicated dropper.",
            "The result is a list of commands to execute, protected the same way as the backdoor configuration file:The backdoor that we’ve discovered supports the uploading, downloading and execution of files, it can handle requests for a process list and directory list, upgrade and uninstall itself and modify its configuration file.",
            "Typically, the malware drops two files: the backdoor itself and its configuration file.",
            "While investigating further, we found another tool that turned out to be a configuration manager – an executable whose purpose was to create configuration and command files for the backdoors."
        ]
    },
    {
        "report_id": "report_1",
        "link":"",
        "sentences": [
            "Each example found involved the use of an exploit for executing code as a system-level user and shellcode to download an additional downloader.",
            "In attack chains tracked by the team, Platinum will deploy Titanium as the last stage of infection.",
            "Named after a password to one of its archives, Titanium \"hides at every step by mimicking common software\" including protection-related, sound driver software, and video creation tools, according to Kaspersky researchers.",
            "The Platinum advanced persistent threat (APT) cyberattack group has developed a new backdoor with interesting concealment techniques.",
            "The attack chain will then involve the launch of a further archive containing an installer, a COM object DLL, and the Titanium backdoor itself.",
            "Titanium's paths all masquerade as a common software installer, such as for DVD creation software or as an audio driver, and the backdoor will then seek a connection to its C2 once executed."
        ]
    },
    {
        "report_id": "report_2",
        "link":"",
        "sentences": [
            "As part of the Titanium campaign, Platinum used a multi-step infection sequence that employs several downloading, dropping, and installing stages to infect victims from South and Southeast Asia with the final backdoor payload as researchers at Kaspersky found during recent analysis.",
            "Platinum (also tracked as TwoForOne by Kaspersky) has been active since at least 2009 in the APAC region, targeting \"governmental organizations, defense institutes, intelligence agencies, diplomatic institutions, and telecommunication providers in South and Southeast Asia,\" as per Microsoft.",
            "Platinum apparently uses local intranet websites to deliver the malicious artifacts during the infection process or a shellcode that gets injected into a system process via a yet unknown method according to Kaspersky's research team.",
            "The advanced persistent threat (APT) group tracked by Microsoft as Platinum is using a new stealthy Trojan-backdoor malware dubbed Titanium to infiltrate and take control of their targets' systems.",
            "The hacking group employed multiple artifacts during these attacks, with each of them using the following specific distribution sequence:an exploit capable of executing code as a SYSTEM user,a shellcode to download the next downloader,a downloader to download an SFX archive that contains a Windows task installation script,a password-protected SFX archive with a Trojan-backdoor installer,an installer script (ps1),a COM object DLL (a loader), the Trojan-backdoor itself.",
            "The received commands are steganographically hidden data within PNG files and they allow the attackers to perform a wide range of tasks including but not limited to:Read any file from a file system and send it to the C&C ,Drop or delete a file in the file system ,Drop a file and run it ,Run a command line and send execution results to the C&C ,Update configuration parameters (except the AES encryption key) ,Interactive mode – allows to the attacker to receive input from console programs and send their output at the C&C The infiltration scheme used by the Platinum APT group to infect their victims \"involves numerous steps and requires good coordination between all of them,\" Kaspersky concluded."
        ]
    },
    {
        "report_id": "report_3",
        "link":"",
        "sentences": [
            "Furthermore, Kaspersky believes that Platinum APT uses local intranet websites with a malicious code to start spreading the malware.",
            "Platinum (aka TwoForOne) has developed Titanium: a new backdoor, designed to infiltrate and take control of Windows systems.",
            "The Titanium APT includes a complex sequence of dropping, downloading and installing stages, with deployment of a Trojan-backdoor as the final step.",
            "The cyber security experts: The APT malware has a very complicated infiltration scheme and detection is hard According to the cyber security experts, the default Titanium distribution is an exploit capable of executing code as a SYSTEM user; a shellcode to download the next downloader, a downloader to download an SFX archive that contains a Windows task installation script, a password-protected SFX archive with a Trojan-backdoor installer, an installer script, a COM object DLL (a loader), and the Trojan-backdoor itself.",
            "The malware is disguised as security solutions, sound drivers, or software commonly used to create DVDs Platinum (aka TwoForOne) has developed Titanium: a new backdoor, designed to infiltrate and take control of Windows systems.",
            "the malware hides in plain sight by camouflaging as security solutions, sound drivers, or software commonly used to create DVDs."
        ]
    }
]