{"url": "http://www.newslocker.com/en-us/news/celebrity/mom-to-be-brie-bella-thanks-fans-for-their-support-after-hospital-scare/", "text": "Sydney Sweeney Crushes on 'Full-Hetero' Bowen Yang, Has an Affair With Glen Powell on 'SNL' Sydney Sweeney had a steamy encounter with Bowen Yang and doubled down on jokes about the affair rumors between her and Glen Powell while hosting Saturday Night Live tonight (March 2).The 26-year-old actress said that rumors linking her to her Anyone But You costar last year were the “craziest” of all time during her opening monologue. However, she played them up for laughs during a skit later in the show.Head inside to watch two of Sydney Sweeney’s SNL skits…\n\nIn it, sh Read more\n\nLisa Vanderpump Drags Rachel Leviss' 'Ridiculous' Lawsuit Against Ariana Madix & Tom Sandoval Lisa Vanderpump is taking sides as Rachel “Raquel” Leviss sues former costars Tom Sandoval and Ariana Madix.If you missed it, earlier this week the 29-year-old Vanderpump Rules alum filed legal documents against her former costars. She accuses them of revenge porn and causing damage to her career in the aftermath of the Scandoval – when it was revealed that she was having an affair with Tom.\n\nLisa, who is not named in the lawsuit, was asked about the situation recently, and she Read more\n\nQueen Camilla Briefly Steps Back From Royal Appearances Amid King Charles & Kate Middleton's Absences Queen Camilla has been helping to pick up the slack in the Royal Family amid extended absences from both King Charles and Princess Catherine (aka Kate Middleton). However, she is now taking a small break of her own.The 76-year-old royal stepped up to help out after her husband, 75, revealed that he had been diagnosed with cancer. The Princess of Wales has also been out of the public eye since undergoing a planned abdominal surgery. As questions about the latter’s wellbeing ramp up, the Qu Read more\n\nBlake Lively & Ryan Reynolds Cuddle Up During Date Night in NYC Blake Lively and Ryan Reynolds cozied up together while out for date night in New York City on Saturday (March 2).The A-list couple grabbed a bite to eat at Buvette restaurant and walked out arm-in-arm with smiles on their faces.Blake, 36, wore a long black jacket over a purple top and wide-legged jeans. She accessorized with white shoes and a bag. Ryan, 47, opted for a hooded vest to combat the chilly evening.Keep reading to find out more…\n\nThey looked so happy together, and we hope that Read more\n\nSydney Sweeney Rips 'Madame Web,' References Glen Powell Affair Rumors During 'SNL' Monologue Sydney Sweeney threw some shade at one of her new movies and referenced the rumors that she was having an affair with costar Glen Powell during her opening monologue on Saturday Night Live.\n\nThe 26-year-old Euphoria actress is taking over the March 2 episode of the popular late-night show, which features musical guest Kacey Musgraves.She got things started by dragging Madame Web and reacting to some of the craziest rumors about her. There was also a special guest!\n\nKeep reading to find out more&h Read more\n\nVanessa Hudgens Spotted on Set of 'Bad Boys 4' For First Time Vanessa Hudgens is reporting for duty on the set of Bad Boys 4!\n\nOn Friday (March 1), the 35-year-old actress was photographed alongside costars Will Smith and Martin Lawrence for the first time in Miami, Florida.Keep reading to find out more…\n\nIt was first reported that Vanessa had joined the cast of the movie back in March 2023. She’ll be playing Kelly again, a role that she originated in 2020′s Bad Boys for Life.\n\nWill and Martin have been spotted on set quite a bit in recent Read more\n\nLily Gladstone Reveals Surprising Oscars Advice She Got From Her 'Ultimate Actress' Cate Blanchett Lily Gladstone is up for one of the biggest awards of the night at the 2024 Oscars next week, and she’s going into the ceremony with some very unexpected advice from her “ultimate actress” Cate Blanchett.The Killers of the Flower Moon star is in the running for Best Actress, an award Cate has been nominated for five times and won once.\n\nDuring a recent interview, she spilled on the words of wisdom that she picked up from the superstar.Keep reading to find out more…&ldquo Read more\n\nJesse Tyler Ferguson Says the 'Modern Family' SAG Awards Reunion Was Very Important for 1 Costar The cast of Modern Family reunited onstage at the 2024 SAG Awards a week ago, and we’re still not over it!During the awards show, Ed O’Neill, Sofia Vergara, Julia Bowen, Ty Burrell, Jesse Tyler Ferguson and Eric Stonestreet took the stage to hand out an award.Jesse opened up about the opportunity to spend time with his costars during a recent interview. He explained that it almost didn’t happen for a variety of reasons but stressed that it was very important for one costar in Read more\n\n11 Actors Auditioned to Play Spider-Man But Weren't Cast, Including Several Oscar Winners Tobey Maguire, Andrew Garfield and Tom Holland have all swung into action as Spider-Man, one of Marvel‘s most beloved young heroes, on the big screen in the last three decades.Each actor was perfectly cast as the earnest but innocent web-slinger. However, they each faced off against a group of very talented actors to land the role.In fact, many of Hollywood’s biggest stars across multiple generations have been tied to Spider-Man. The majority of them competed with Tobey, Andrew and Read more\n\nLiam Payne's One Direction Bandmate Louis Tomlinson Supports His New Single 'Teardrops' Liam Payne is getting some love from one of his One Direction bandmates.The 30-year-old crooner introduced a new era of music this week with the unveiling of his single “Teardrops.” After it dropped, Louis Tomlinson hopped online to shout it out, prompting a cute exchange between the pair.Keep reading to find out more…\n\n“Liam‘s new single is out today,” Louis wrote on X (formerly Twitter). “Go have a listen.”The “Strip That Down” singe Read more\n\nKyle Richards Responds to Major Rumor About Her & Morgan Wade Kyle Richards is addressing a big rumor about her and Morgan Wade.\n\nFor the past several months, the 55-year-old Real Housewives of Beverly Hills star and the 29-year-old country music singer have faced a lot of dating rumors, but they have both denied that anything romantic is going on between them.\n\nDuring a recent Amazon Live, Kyle responded to a DeuxMoi blind item that many believed may be about her and Morgan.\n\nKeep reading to find out more…DeuxMoi recently posted a blind item on Insta Read more\n\nOlivia Wilde and Zoë Kravitz go sheer at Paris Fashion Week: PHOTOS Olivia Wilde made jaws drop when she went braless under a sheer bodysuit on the red carpet at the Saint Laurent fashion show in Paris. Wilde paired the bodysuit with a brown pencil skirt, and accessorized with black tights, brown opera gloves, a brown belt and sunglasses.The actress and director went through a very public breakup with her longtime fiancé Jason Sudeikis in November 2020. They finalized their custody agreement three years later, in September 2023. She then dated singer Harr Read more", "images": ["http://www.newslocker.com/images/share-twitter.png", "https://img4.newslocker.com/2024/03/03/310765240_725.jpg", "https://img4.newslocker.com/2024/03/03/310726708_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2024/03/03/310765244_725.jpg", "https://img4.newslocker.com/2024/03/03/310765248_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/201744/rs_600x600-170504095153-brie.jpg?downsize=450:*&crop=450:350;left,top", "https://img4.newslocker.com/2024/03/03/310726705_725.jpg", "https://img4.newslocker.com/2024/03/03/310765249_725.jpg", "https://img4.newslocker.com/2024/03/03/310765239_725.jpg", "https://img4.newslocker.com/2024/03/03/310765246_725.jpg", "https://img4.newslocker.com/2024/03/03/310765229_725.jpg", "https://img4.newslocker.com/2024/03/03/310765232_725.jpg", "https://img4.newslocker.com/2024/03/03/310726704_725.jpg", "https://img4.newslocker.com/2024/03/03/310765228_725.jpg", "https://img4.newslocker.com/2024/03/03/310765236_725.jpg", "https://img4.newslocker.com/2024/03/03/310765241_725.jpg", "https://img4.newslocker.com/2024/03/03/310765227_725.jpg", "https://img4.newslocker.com/2024/03/03/310765242_725.jpg", "https://img4.newslocker.com/2024/03/03/310726706_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/rss.png", "https://img4.newslocker.com/2024/03/03/310765238_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img4.newslocker.com/2024/03/03/310765243_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img4.newslocker.com/2024/03/03/310765226_725.jpg", "https://img4.newslocker.com/2024/03/03/310765237_725.jpg", "https://img4.newslocker.com/2024/03/03/310765247_725.jpg", "https://img4.newslocker.com/2024/03/03/310765234_725.jpg", "https://img4.newslocker.com/2024/03/03/310765233_725.jpg", "https://img4.newslocker.com/2024/03/03/310765235_725.jpg", "https://img4.newslocker.com/2024/03/03/310765231_725.jpg", "https://img4.newslocker.com/2024/03/03/310765230_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img4.newslocker.com/2024/03/03/310726707_725.jpg", "https://img4.newslocker.com/2024/03/03/310765245_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/201744/rs_600x600-170504095153-brie.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/mom-to-be-brie-bella-thanks-fans-for-their-support-after-hospital-scare/", "title": "Mom-to-Be Brie Bella Thanks Fans for Their Support After Hospital ''Scare''", "meta_data": {"description": "Wow that's some scary stuff!Total Divas star Brie Bella, who is over nine-months-pregnant, had quite the scary situation earlier in the week when she and husband Daniel Bryan had to...", "og": {"title": "Mom-to-Be Brie Bella Thanks Fans for Their Support After Hospital ''Scare'' - Celebrity news - NewsLocker", "description": "Wow that's some scary stuff!Total Divas star Brie Bella, who is over nine-months-pregnant, had quite the scary situation earlier in the week when she and husband Daniel Bryan had to...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/mom-to-be-brie-bella-thanks-fans-for-their-support-after-hospital-scare/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/201744/rs_600x600-170504095153-brie.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1494124800.0, "source": "http://www.newslocker.com", "summary": ""}