claim：We believe these attacks originated from the same threat actor - Chimera, as these attacks utilized similar tactics, techniques and even the same customized malware.
explain：This threat report provides an analysis of the advanced persistent threat (APT) attacks that have occurred during the past two years on the semiconductor industry. Our research shows that the majority of these attacks were concentrated on the Taiwan semiconductor sector. This is worthy of concern, as Taiwan’s semiconductor industry plays a very crucial role in the world. Even a small disruption in the supply chain could have a serious ripple effect throughout the entire industry. Surprisingly, up until now, there has been less coverage on these attacks. In this report, we seek to shed light on the threat actors and campaigns of these attacks, where they are collectively referred to as Operation Skeleton Key. Additionally, we provide a brief overview of the current information security status of Taiwan’s semiconductor industry. With decades of development, Taiwan has established itself as a leading player in the semiconductor supply chain, including many well-known leaders in the area. According to a report by the Semiconductor Equipment and Materials International (SEMI),the global industry association representing the electronics manufacturing supply chain, Taiwan has been the largest consumer of semiconductor materials in the past several years [1]. Meanwhile, Wikipedia, says that Taiwan is currently among the top 5 sales leaders in multiple segments including foundry, integrated device manufacturer (IDM), fabless and outsourced semiconductor assembly and testing (OSAT) [2]. In 2019, Taiwan’s total semiconductor value reached a staggering $11.4 billion. Needless to say, the repercussions from a cyber attack on Taiwan’s semiconductor sector could be catastrophic. Due to the high market value of the semiconductor industry, vendors have invested heavily in their cyber capabilities, especially in protecting the industrial control system (ICS) equipment used in fabrication plants. Although operational technology (OT) and information technology (IT) security is equally important, more emphasis has been placed on the former. This is evidenced by the fact that many vendors have opted to isolate their ICS equipment to ensure the manufacturing process is never interrupted. The downside to this approach is that once malicious code finds its way into the isolated environment, it can spread to other machines very quickly. One foremost example is the 2018 WannaCry ransomware attack on TSMC [3]. The hit on the world’s largest foundry company forced some of the plants to go offline for an entire day. Additionally, it took several days before the malware could be fully eradicated. The total damage caused by this attack reached $256 million. Separately, ASUS, which is a leading PC manufacturer in Taiwan, saw millions of its users impacted by Operation ShadowHammer [4]. In this report, we will show how IT attacks on semiconductor vendors can be just as damaging as an OT attack. Between 2018 and 2019, we discovered several attacks on various semiconductor vendors located at the Hsinchu Science-based Industrial Park in Taiwan. As these attacks employed similar attack techniques and tactics, a pattern could be discerned from the malicious activities. From this pattern, we deduced that these attacks, which we dubbed Chimera APT Group, were actually conducted by the same threat actor. The main objective of these attacks appeared to be stealing intelligence, specifically documents about IC chips, software development kits (SDKs), IC designs, source code, etc. If such documents are successfully stolen, the impact can be devastating. The motive behind these attacks likely stems from competitors or even countries seeking to gain a competitive advantage over rivals. Since these techniques and tactics were similar to previous attack activities, we suspect the attacker is a China-based hacker group. We thus hope that this report will help semiconductor companies gain a better understanding of the dangers from such attacks. Additionally, as we have worked with several of the semiconductor vendors to improve their cyber security, we wish to share this valuable experience, and highlight the current challenges facing the entire industry. In this report, we conduct a comprehensive analysis on the employed technologies, tactics, and customized malware of Chimera APT Group. As this operation has not yet been documented, the techniques and tactics disclosed in this report can help blue teams design better defenses, and develop better detection and hunting methods. Below summarizes our findings of Chimera. During our investigation of Chimera APT Group between 2018 to 2019, more than 30,000 endpoints belonging to various semiconductor vendors were analyzed. Two representative cases were chosen for a deeper analysis. The two cases (hereafter Case A and Case B) involved in the analysis currently have a leading global position in their own market segments. With business sites scattered around the world and a large annual revenue, their main research and development hub are both located in Taiwan. Two different approaches were adopted when investigating the two companies. For Case A, as we already enjoyed a long-term cooperation, our assistance focused on monitoring their systems. This allowed us to quickly identify the cyber attack in a short period of time. By contrast, as victims in Case B discovered on their own various abnormal activities, they asked for our help to formulate an effective incident response. During our forensic investigation, we found that the attacks had already been occurring for more than a year. As the activities, attack techniques and tactics were similar in the other cases we investigated, we believe this was the work of the same threat actor. In this case, the victim company had already subscribed to our continuous threat hunting service. Our investigation revealed malicious activities occurring between 2019-12-09 ~ 2019-12-10. Meanwhile, in this incident, 15 endpoints and 6 user accounts were compromised, and 4 malwares and 8 C2 servers were found. To help better depict the operational details of this case, the cyber situation graph and storyline is respectively shown in Fig 1. Note that all the server/user names are de-identified, and replaced with names that can represent their roles. The same APT malware - GoogleUpdate.exe - was found on two endpoints. On the day we discovered this malware, no information could be found on VirusTotal (VT). To confuse security products and analysts, the malware replaced the original GoogleUpdate binary and functioned as a mutated Cobalt Strike beacon to inject payloads into other processes. Moreover, network security devices had difficulty detecting the associated C2 servers, as they were located in the Google Cloud Platform. The C2 server domains are listed in Appendix I of the IoC section. After successfully connecting back to the C2, the attacker used RECORDEDTV.MS to archive the stolen data for data exfiltration. It is worthy to note that even without the .exe file extension, the data exfiltration process could still be executed. Identical binaries were found in several machines, but under different names, e.g. RECORDEDTV.MS, uncheck.dmp, and jucheck.exe. This aroused our suspicions and prompted us to suspect the binary was masquerading as a Java Update program. Inserting malware in a location where legal software is stored seems to be a characteristic tactic of Chimera. For this case, it was found that the disguised program, which was a modified RAR software, had a one-byte discrepancy from the original version. We are still ascertaining the reasons behind this difference. To track the root cause, we found that the first Cobalt Strike backdoor was located at NB-CLAIR, and was then remotely copied to Server-LAUREN. A valid account was used to invoke Cobalt Strike via schtasks (Fig 2). Server-LAUREN also archived the registry and ntds.dit to other hosts for offline breaking. The latter is an AD database, which contains information about domain hosts and users, e.g. id, name and password hash. Since this file was encrypted, and the key was stored in the SYSTEM registry, the threat actor needed to archive both ntds.dit and the registry to both decrypt the file and remotely brute-force the password hash. The control of Server-LAUREN , which was also achieved via schtasks, was traced back to the NB-CLAIR machine. From the NB-CLAIR timeline, we noticed that a remote desktop program (RDP) from a certain IP was run just six minutes before the schtasks was executed (Fig 5). Since this IP was a VPN server, and a valid account was used to log in to it, we believe the actor acquired the password from a separate data breach.Suspicious activities were discovered in the victim company of Case B during an upgrade to their network infrastructure. We were tasked by the company to investigate this incident, which began in November 2019. During our investigation, we found that the cyber attack pattern resembled the tactics employed by Chimera. The entire attack occurred between October 7, 2018 to November 18, 2019, and a total of 24 endpoints were compromised. In these endpoints, 8 compromised accounts, 3 malware and 5 C2 servers were discovered. The persistence of this attack can be seen by the fact that it lasted for more than a year. The cyber situation graph and storyline are respectively shown in Fig 6 and Fig 7. Unlike Case A, powershell scripts were widely used, which can be seen in following code snippets. To avoid the file-based detection mechanism, the payload was injected directly into the system memory. The injected malware was discovered in roughly 10 endpoints, which included two domain controllers. The powershell script was a Cobalt Strike backdoor and was used for process migration to other system processes. We found several hosts that had the Cobalt Strike malware implanted in their infected svchost.exe. Despite the discovery of the early stage malware and activities, the launch of our investigation was already at a very late point in time. Thus, there was insufficient evidence to pinpoint the likely initial access point. We surmise that the attack occurred via stolen valid credentials or phishing emails. As mentioned earlier, legal cloud services were widely used by Chimera as their C2 to avoid threat attribution. In this case, Appspot[.]com and azureedge[.]net were applied as the C2. The actor also used a RAR program under the guise of innocuous file names such as RecordedTV.ms, jucheck.exe and vmware.log to archive and steal the data of interest. A similar scheme was utilized by the attacker to archive the passwords they used. The following shows a sample command of the archived information.Based on the file names of the stolen files, it seemed to include chip documents, SDKs and even the source code. The key motive of the actor was to acquire semiconductor proprietary data. Similar to Case A, a DLL file (d3dll.dll) was used to deploy a Skeleton Key malware. An in-memory patch was performed to allow easy system log-in. Some of the de-identified leaked file names are listed below.It is worthy to note that among the various semiconductor vendors we investigated, similarities were seen in the deployed malware, techniques, and tactics. This particular APT group seemed to have a keen interest in targeting the semiconductor industry. Additionally, in the absence of an AD monitoring system, we saw some vendors employing a white-list enforcement approach. Although this is a feasible approach, as the AD cannot execute any software outside the white-list, our investigation shows that APT actors were still able to use Living off the Land Binaries (LOL) bins to launch an attack.Our analysis also revealed several suspicious memory modules. The first memory module resembled a CobaltStrike or metasploit beacon. The memory module was a PE file with a broken header, as seen in Fig 8 and Fig 9. From the figure, we can also see that the PE metadata has some invalid values, which contains a hidden shellcode (from offset 2).The disassembled shellcode, which is a Reflective Loader, is listed in Fig 10. It first located the next payload at offset 0x1791C, and then loaded the payload. Meanwhile, 56A2B5F0 is the API hash of ExitProcess, which denotes the process exit.The other memory modules contained a different CobaltStrike beacon, and were used for migration. The first stage beacon injected a payload to a process for process migration. From the memory content (Fig 11), the “.\pipe\mojo.5688.805…” string was the pipe created by the CobaltStrike beacon.As we performed a deeper reverse engineering, we found that the process migration made use of the pipe inter-process (IPC) mechanism for communication. The injected code first used CreateNamePipe and ConnectNamePipe to establish an IPC with the original beacon (Fig 12). After reading the entire shellcode via the ReadFile from the name pipe, the shellcode was invoked in 0x401155, and a CobaltStrike backdoor was created (Fig 13). Upon discovery of this sample, we first performed a retrohunt analysis. The discovery of a related binary led us to initially believe the sample was a Dumpert. However, a more in-depth analysis revealed that the d3d11.dll sample implanted a skeleton key, where adversaries could persistently control (before the system reboot) the infected machine and machines under the infected AD. More specifically, the malware was an account manipulation tool that contained code extracted from both Dumpert and Mimikatz. We called this malware SkeletonKeyInjector. The malware employed a technique that altered the NTLM authentication program and implanted a skeleton key to allow adversaries to log-in without a valid credential. This allowed the adversary to achieve the following objectives:To show which functions shared a resemblance to Mimikats or Dumpert, we reversed the functions of d3d11.dll and recovered the function names in Fig 14. For easy understanding, we recovered the function names that migrated from Mimikatz, which have either the “kuhl” or “kull” prefix. As for functions that migrated from Dumpert, the prefix “Dumpert” was included in the name. For functions that were implemented by the adversary, no prefix was added.In order to bypass the API monitoring, which is widely used in anti-virus or EDR products, the malware directly invoked syscalls and implemented high level API logic. Since the syscall numbers differ between each Windows version, the following code snippet was used to determine the OS version in use, and thereby obtain the correct syscall number. Our analysis showed that this code snippet was copied from Dumpert.To run the Mimikatz code snippet used by the malware, a privilege called SE_DEBUG_PRIVILEGE was needed. The code shown in Fig 16 used RtlAdjustPrivilege to obtain the SE_DEBUG_PRIVILEGE to allow the malware to open, read, and write other process memory as a debugger. By comparing the code snippet (Fig 17) with the original code in Mimikatz (Fig 18), we found that instead of calling the OpenProcess API, the malware instead invoked OpenProcess via Dumpert. As mentioned earlier, the malware sought to bypass the API hooking via syscalls. SkeletonKeyInjector first searched for the string “Kerberos-Newer-Keys” in the lsass.exe process memory. When the “Kerberos-Newer-Keys” address was found, it then searched for the Unicode structure in the memory that referenced this address. Afterwards, the Unicode structure was altered with empty strings by manipulating the string reference to an empty string and size zero. This manipulation downgraded the lsass.exe in using insecure crypto scheme - RC4 without salt. From Fig 17 and Fig 18, the similar code segments between Mimikatz and d3d11.dll are shown. After downgrading to RC4, the SkeletonKeyInjector altered the function pointers in cryptdll.dll!CDLocateCSystem by redirecting them to its customized functions (Fig 19). Specifically, two functions were altered, one for the RC4 initialization, and the other for the RC4 decryption. In the RC4 initialization function, a new RC4 NTLM was injected with a pre-calculated hash value of the skeleton key. When the authentication check failed due to incorrect credentials, the RC4 decryption function prompted the authentication process to compare the credentials with the skeleton key. Once a match was confirmed, the log in was permitted. Noteworthy, the malware contained customized NTLM hash, which had a slight difference over the original Mimikatz. This program is not considered malware, but a modified legitimate RAR program that was utilized in this operation. The original version is shown below：Specifically, this is a rar.exe v3.6. In Figure 22, the left section shows the original rar.exe, while the right section depicts the RecordedTV.ms. Our research shows one of the bytes in the code segment was altered, as depicted in Figure 23. However, we are still determining the reason why a byte size data was altered. All of the cases that we investigated used this modified rar.exe program to archive the stolen data, which is evidence that these attacks were likely conducted by the same group. The last malware involved in this operation was BaseClient.exe, which is a general network testing tool. We suspect this program was not developed by the adversary, but was obtained from a benign source. Used by the adversary for network reconnaissance, it is unlikely to be flagged by security systems, as the program may be inherently benign.In this chapter, we summarize the techniques employed in Chimera APT. These techniques are organized based on the MITRE ATT&CK framework.For nearly two years, our team monitored several attacks that targeted Taiwan’s semiconductor vendors. We believe these attacks originated from the same threat actor - Chimera, as these attacks utilized similar tactics, techniques and even the same customized malware. The actor likely harvested various valid credentials via phishing emails or data breaches as their starting point to conduct their cyber attack on the vendors. CobaltStrike was later used as their main RAT tool. To avoid detection, the CobaltStrike RAT was often masqueraded as a Google Chrome Update. The RAT would then connect back to their C2 server. As these servers were in a public cloud server, it made it difficult to track. Subsequently, by compromising the AD server, the delicate malware - SkeletonKeyInjector - was invoked to implant a general key to allow LM, persistence and defense evasion. Although this malware was discovered for the first time, we have high confidence that these attacks were conducted by the same threat actor. Based on the stolen data, we infer that the actor’s goal was to harvest company trade secrets. The motive may be related to business competition or a country’s industrial strategy. We hope that the tactics, techniques and IoCs disclosed by this report can better help semiconductor vendors improve their security mechanisms and prevent such attacks from occurring again.
[
    {
	link：https://vpnoverview.com/news/new-threat-group-chimera-abuses-cloud-services-to-exfiltrate-data/#:~:text=Chimera%20is%20believed%20to%20be%20a%20Chinese%20APT,information%20from%20a%20broad%20range%20of%20target%20organizations.
        "report_id": "report_0",
        "sentences": [
            "According to the 2020 Trustwave Global Security Report, the number of attacks on cloud services more than doubled in 2019 and accounted for 20% of investigated incidents.",
            "Chimera is believed to be a Chinese APT (Advanced Persistent Threat) group operating in the interest of the Chinese state.",
            "CyCraft discovered the threat group when the group conducted a series of coordinated attacks against multiple Taiwanese companies active in the superconductor industry.",
            "Such Chimera attacks have targeted semiconductor and airline companies in different geographical areas, not just Asia.",
            "The group collected PRN data from individuals of interest to then conduct credential-stuffing and password‑spraying attacks against target organizations.",
            "Their main aim was to steal intellectual property."
        ]
    },
    {
	link：https://cyware.com/news/operation-skeleton-key-chimera-hacker-group-targets-taiwanese-semiconductor-manufacturers-81090445
        "report_id": "report_1",
        "sentences": [
            "It has been discovered that a hacker group dubbed Chimera has been targeting numerous semiconductor vendors in Taiwan using a skeleton key injector technique to steal intellectual property.",
            "Skeleton APT, operational since 2018, recently targeted at least seven semiconductor manufacturers located at the Hsinchu Science Industrial Park in Taiwan in a well-coordinated attack.",
            "Skeleton key attacks could allow attackers to log into a targeted system without the need for valid credentials.",
            "The threat actors could remain hidden for a long time since their targeted machines (AD and DC Servers) are not rebooted frequently.",
            "To avoid such incidents, users of Azure or other cloud environments must use multi-factor authentication.",
            "While using a plethora of custom-built malicious tools, the group also used several additional tactics during its espionage campaigns."
        ]
    },
    {
	link：https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
        "report_id": "report_2",
        "sentences": [
            "A number of our intrusions involved tips from an industry partner who was able to correlate some of their upstream activity.",
            "NCC Group and Fox-IT have been tracking a threat group with a wide set of interests, from intellectual property (IP) from victims in the semiconductors industry through to passenger data from the airline industry.",
            "Our threat intelligence analysts noticed clear overlap between the various cases in infrastructure and capabilities, and as a result we assess with moderate confidence that one group was carrying out the intrusions across multiple victims operating in Chinese interests.",
            "The earliest and longest lasting intrusion by this threat we observed, was at a company in the semiconductors industry in Europe and started early Q4 2017.",
            "The more recent intrusions took place in 2019 at companies in the aviation industry.",
            "Victim: Semiconductors and aviation industry."
        ]
    },
    {
	link：https://cycrafttechnology.medium.com/threat-attribution-chimera-under-the-radar-7c4cce390efd
        "report_id": "report_3",
        "sentences": [
            "Both threat actors are China-based and located in the UTC +8 timezone.",
            "China-linked threat actors (e.g., Chimera, BlackTech, APT30) are known to share tools and attack methods with each other, making attribution challenging.",
            "China-linked threat actors are known to share tools and attack methods (and possibly even personnel) with each other.",
            "Much like Chimera, the threat actor mentioned in the Fox-IT & NCC Group report (referred to in this article as CUTR, Chimera Under the Radar) targeted intellectual property (IP) from the semiconductor industry; however, the report goes into further detail explaining how their threat actor’s targets were more diverse, including targeting sensitive data from the EU aviation industry.",
            "Some differences in attack behavior may be due to differences in the victims’ architecture, security maturity, or geographic location (EU, not Taiwan).",
            "The threat actor tracked in their report shared many similarities to the China-linked threat actor Chimera, whom CyCraft attributed to a year-long cyberattack targeting the Taiwan semiconductor industry just last year."
        ]
    }
]