[
    "claim":"Russian espionage group Nomadic Octopus infiltrated a Tajikistani telecoms provider to spy on 18 entities, including government officials and public service infrastructures.",
    "explain":"A Russian espionage group tracked as Nomadic Octopus has been observed spying on Tajikistan’s high ranking government officials, public service infrastructures, and telecoms services, likely by infiltrating a mobile phone carrier, cyber threat intelligence company Prodaft reports. Active since at least 2014 and also referred to as DustSquad, Nomadic Octopus is known for the targeting of individuals and diplomatic entities in Central Asia, mainly in Afghanistan and former Soviet Union countries. In 2018, the advanced persistent threat (APT) actor was seen targeting the Democratic Choice (DVK) opposition party in Kazakhstan with the Octopus trojan, disguised as the Telegram messaging application. Dubbed Paperbug (PDF), Nomadic Octopus’ Tajikistani campaign has been ongoing since 2020, resulting in the compromise of government networks, individual computers, and operational technology (OT) devices, such as gas station systems. However, the group was seen removing access to victims that were not deemed valuable and which were unrelated to government infrastructure or public services. As part of the Paperbug campaign, the APT would periodically steal emails, documents, and messaging application chat histories, but would also spy on victims in real time, taking screenshots when they were writing emails or creating new contracts. The group was seen writing notes in Russian about the compromised devices and their owners, who were mainly government entities, but also maintaining connections to compromised OT devices, which were typically categorized based on the victim’s value. Access to victims, Prodaft says, was obtained through the compromised networks of a Tajikistan-based telecom company. The threat actor has continued to harvest information from the carrier since November 2020. “It is determined that the Paperbug operation started in this firm’s network then expanded their access through document theft, stolen clients’ contracts and credentials, weak network security configurations and exploitation of not up-to-date software and services,” Prodaft explains. Nomadic Octopus used multiple servers to manage the backdoors and tools deployed as part of the campaign, including malware that shows similarities to the previously analyzed Octopus. The backdoors allowed the attackers to execute various commands on the victims’ machines. However, the campaign was mostly characterized by the use of public offensive tools, some deployed inattentively, even during the victim’s active hours. However, the attackers named their tools in a manner meant to hide the activity, including Google Update, Chrome Update, Java Update, and Google Crash Handler. Despite the stakes of the campaign, however, the operators appeared to be low-skilled, which led Prodaft to the conclusion that they were given a “list of commands that need to be executed on each machine exactly”. “This is further supported by the obstinate behavior of, trying to execute some commands even though it is clear beforehand that they will fail, thus meaning that the operator follows a checklist and forced to stick to it,” Prodaft notes. When needed, the operators would change tools’ names to more generic programs, to obtain firewall permissions or additional privileges. In some cases, however, the operators would forget to change names when trying alternative tools, thus raising suspicion. “The group usually does not know which device they gained access to. From how Nomadic Octopus group eliminates or keeps connection decision, it is clear to see that Nomadic Octopus is actively searching for OT devices, government networks and officers and public service infrastructures. These targets enable them to gather closed confidential sources and surveillance on Tajikistan and its people,” Prodaft notes.",
    {
        "report_id": "report_0",
        "link":"https://dig.watch/updates/tajikistani-carrier-hacked-by-russia-linked-nomadic-octopus-apt",
        "sentences": [
            "A Russia-linked cyberespionage group Nomadic Octopus APT hacked a Tajikistani telecoms provider to spy on 18 entities, including high-ranking government officials, telecommunications services, and public service infrastructures.",
            "As per a report on the incident by Prodraft, a cyber threat intelligence company, the Nomadic Octopus had been spying on the carrier since November 2020.",
            "In this attack, the Nomadic Octopus group used multiple servers as C2 for its backdoors and tools.",
            "Prodraft also noted that the increase in attacks in Central Asia by state-sponsored Russian-speaking threat actors may indicate the group’s possible connections to other state-sponsored threat actors.",
            "The group compromised a broad range of devices, from individuals’ computers to OT devices, as part of an operation entitled Paperbug.",
            "The report notes the attacker used alternatives if the preferred tool failed, and in some cases, the attacker forgot to change names when trying alternative tools, thus raising suspicion."
        ]
    },
    {
        "report_id": "report_1",
        "link":"https://securityaffairs.com/145536/apt/nomadic-octopus-targets-tajikistani-carrier.html",
        "sentences": [
            "In April 2018, Kaspersky researchers discovered a new Octopus sample developed to target Windows systems, the malicious code had been disguised as a Russian version of the Telegram app used by the Democratic Choice (DVK) opposition party in Kazakhstan.",
            "Russian APT group Nomadic Octopus hacked a Tajikistani carrier to spy on government officials and public service infrastructures.",
            "Russian cyber espionage group Nomadic Octopus (aka DustSquad) has hacked a Tajikistani telecoms provider to spy on 18 entities, including high-ranking government officials, telecommunication services, and public service infrastructures.",
            "The Nomadic Octopus group used multiple servers as C2 for its backdoors and tools in the Paperbug campaign.",
            "The Nomadic Octopus threat actor has continued to spy on the carrier since November 2020.",
            "“According to the frequency of screenshots being taken by Nomadic Octopus especially while targeted victims were writing e-mails and creating new contracts of their customers, the group spied on devices and took their notes diligently.”"
        ]
    },
    {
        "report_id": "report_2",
        "link":"https://asiaplustj.info/en/news/tajikistan/security/20230501/nomadic-octopus-specifically-targets-tajikistan-officials-and-telecommunications-services-says-report",
        "sentences": [
            "However, besides these high-value targets, it reportedly also targets a local political blogger, which may suggest that Nomadic Octopus also conducts cyber surveillance operations.",
            "Nomadic Octopus is a new APT (advanced persistent threat), which has been observed conducting campaigns involving Android and Windows malware, mainly using the Delphi programming language, and building custom variants.",
            "The main goal of Nomadic Octopus appears to be cyber espionage against high-value targets, including diplomatic missions in the region.",
            "This indicates that there might be some ties between the main subject of this report Nomadic Octopus and other prominent espionage groups like Sofacy The report has published names of some high-ranking Tajik state officials who might have been the victims of a hacker attack.",
            "Virus Bulletin says Nomadic Octopus is a Russian-speaking cyber espionage threat group that has primarily targeted Central Asia, including local governments, diplomatic missions, and individuals, since at least 2015.",
            "“Nomadic Octopus’ Paperbug Campaign”, in particular, notes that the group specifically targets Tajikistan’s high ranking government officials, telecommunication services, and public service infrastructures."
        ]
    },
    {
        "report_id": "report_3",
        "link":"https://medium.com/@jennifer_45057/when-cyber-spies-come-calling-27dc2fc940bc#id_token=eyJhbGciOiJSUzI1NiIsImtpZCI6ImJkYzRlMTA5ODE1ZjQ2OTQ2MGU2M2QzNGNkNjg0MjE1MTQ4ZDdiNTkiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2FjY291bnRzLmdvb2dsZS5jb20iLCJhenAiOiIyMTYyOTYwMzU4MzQtazFrNnFlMDYwczJ0cDJhMmphbTRsamRjbXMwMHN0dGcuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJhdWQiOiIyMTYyOTYwMzU4MzQtazFrNnFlMDYwczJ0cDJhMmphbTRsamRjbXMwMHN0dGcuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJzdWIiOiIxMDk2OTY2OTQ2MzM2NDMwNDE1MjQiLCJlbWFpbCI6ImxpaHVhbjE5OTkxMUBnbWFpbC5jb20iLCJlbWFpbF92ZXJpZmllZCI6dHJ1ZSwibmJmIjoxNzA3MjM3NjY2LCJuYW1lIjoiaHVhbiBsaSIsInBpY3R1cmUiOiJodHRwczovL2xoMy5nb29nbGV1c2VyY29udGVudC5jb20vYS9BQ2c4b2NMelNhb0JEdHA2RmdFNnJmYVk4Tk8wRDVTVkNSYzVIdG5Kek5CS1ZhcXI9czk2LWMiLCJnaXZlbl9uYW1lIjoiaHVhbiIsImZhbWlseV9uYW1lIjoibGkiLCJsb2NhbGUiOiJ6aC1DTiIsImlhdCI6MTcwNzIzNzk2NiwiZXhwIjoxNzA3MjQxNTY2LCJqdGkiOiJhNzVjNTBkZWQ5YWExZDNkYmU3YzRjN2Y3NmZlYzBkNmFhNTdjMWNlIn0.RN88jkiuokePZtKP3X79IAcZ4VeL6eaUe5wBnZwQTMChlyc-EbCvnSLB758fvzkMeOszPTQ5a3leV1ISX183K5uqvYqQqyVKE-Vq2OMR5BH6HqUV6Sq1P3mZeVprFrOWXy6dwmgS6Fx1kJxH0Q59GmvTSzas188QYyHvnt3j9dbSKXYjoYmyQawKbKi1nTCExB_NlxVBeBS52W76TPA4NuOcjbxpVGYNmqqnGAwyEQXg7iiLteD-KQkjKqgqUoAKAvA59dRoFKkzHPx5zYsBKCn02y0UAtNW12ydPQ3Va7WkelOPcqGYNeQ8jFZKRc6R2odAP8Qz_iecwm17H8513Q",
        "sentences": [
            "As Paperbug demonstrated once cyber spies gain entry it is all too easy for groups like Nomadic Octopus to extend their tentacles.",
            "Back doors it installed on victims’ devices allowed Nomadic Octopus to not only watch victims write emails and create new contracts for customers but capture the information by secretly taking screenshots, running commands remotely and downloading and uploading files.",
            "In September 2020 a Russian-speaking cyber espionage gang called Nomadic Octopus singled out Tajikistan’s government and its public service infrastructure.",
            "Operating since at least 2008, Crowdstrike says this Russia-based attacker has targeted U.S. political organizations, European military organizations and victims in multiple sectors across the globe.",
            "Paperbug was shut down but Nomadic Ocotopus and other cyber spy groups such as Sofacy (also known as Fancy Bear) are still active in Central Asia and elsewhere.",
            "This activity was conducted by Russian, Iranian, Chinese, and North Korean actors, according to CrowdStrike, a cybersecurity company specializing in endpoint protection that was named a World Economic Forum Technology Pioneer in 2015."
        ]
    }
]